[
  {
    "id": 1,
    "name": "Aisha",
    "description": "A daughter of a noble family from Orvel. As one of the most talented wizards in the Tower of Sage, she has been granted the title of 'Purple' in recognition of her magic capability. She was raised in the Tower of Sage since childhood at her parents' request, but she still retains her dignity as an aristocrat. As a child, she never realized why her parents sent her away on her own, but now she understands their reasons. Now, she is back home, and is always attended by her handmaiden, who is like another member of the family to her.",
    "type_dmg": "Magic",
    "slug": "aisha",
    "role_id": "wizard",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 985328,
        "ATK": 29328,
        "P.DEF": 3904,
        "M.DEF": 5864
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "Penetration": 150,
        "ACC": 100,
        "M.Dodge": 200,
        "M.Block": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Mystic Barrage",
        "description": "Deals 357000 M.DMG to enemies within a small range. Upon a Crit Hit, cooldown is reduced by 1 sec",
        "mana": 2,
        "cooldown": 8,
        "order": 1
      },
      {
        "name": "Destruction Ray",
        "description": "Every 0.5 sec, deals 104294 M.DMG to enemies in a straight line. After 5 sec, consumes 3% of mana every 0.5 sec while DMG is increased by 100%. Max duration is 10 sec",
        "mana": 2,
        "cooldown": 13,
        "order": 2
      },
      {
        "name": "Torrential Rainfall",
        "description": "Deals 590490 M.DMG to random enemies for 3 sec, and reduces target's M.DEF by 5%. Can be stacked up to max 5 times",
        "mana": 3,
        "cooldown": 17,
        "order": 3
      },
      {
        "name": "Mystic Boost",
        "description": "Upon a Crit Hit, deals extra 32814 M.DMG to the enemy",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 2,
    "name": "Annette",
    "description": "A genius technomagi from the Kingdom of Orvelia. She is highly optimistic, and failure never seems to bother her. She dreams of inventing a device that would allow anyone to handle magic one day. She has a magically engineered assistant whom she brought to life after years of research. Following the arrival of the Demons, she incorporated her research into developing weapons that would allow anyone to fight against the invaders.",
    "type_dmg": "Magic",
    "slug": "annette",
    "role_id": "mechanic",
    "position": "Middle",
    "base_stats": [
      {
        "Max HP": 1157176,
        "ATK": 25416,
        "P.DEF": 5376,
        "M.DEF": 4392
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Crit DMG": 50,
        "Penetration": 100,
        "ACC": 200,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Blasting Ray",
        "description": "Attacks enemies in a straight line, dealing 233135 M.DMG, and hit enemies take 25% increased M.DMG. If the skill is used when in Overcharge state, deals 233135 extra M.DMG, and hit enemies take 25% increased M.DMG",
        "mana": 2,
        "cooldown": 11,
        "order": 1
      },
      {
        "name": "Emergency Treatment",
        "description": "Dispels negative effects of all allies and heals a total of 320550 HP for 10 sec while increasing CC Resistance by 250. While Overcharged, all allies' Crit Chance is increased by 250 and gains immunity to CC",
        "mana": 2,
        "cooldown": 17,
        "order": 2
      },
      {
        "name": "Process of Elimination",
        "description": "Fires an exploding energy ball to a random target and nearby enemies in range, dealing a total of 621927 M.DMG. When in Overcharge state, deals a total of 146140 M.DMG and inflicts Stun for 5 sec upon explosion",
        "mana": 3,
        "cooldown": 25,
        "order": 3
      },
      {
        "name": "Charge",
        "description": "Gains 1 stack of Charge every 0.5 sec, and gains 10 stacks of Charge per every orb of mana used. Upon the 100th Charge stacked, enters Overcharge state. When in Overcharge, ATK is increased by 35622 for 15 sec and each auto attack reduces skill cooldown by 10%. All effects cannot be dispelled, and Charge will not stack during Overcharge state",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 3,
    "name": "Arch",
    "description": "An Angel warrior who descended from the Heavens to punish the Demons and stop the spread of chaos on earth. His delegated tasks include scouting, reconnaissance, and execution of any Demons found on earth. He has a strong sense of responsibility and is quick and decisive against any injustice. He truly loves Mankind and all the life forms that inhabit the earth. This is why he strives to prevent the Demons from defiling this world.",
    "type_dmg": "Magic",
    "slug": "arch",
    "role_id": "archer",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 1066728,
        "ATK": 27864,
        "P.DEF": 5376,
        "M.DEF": 4392
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Penetration": 250,
        "ACC": 100,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Celestial Arrow",
        "description": "Deals 193398 M.DMG to 3 enemies and push them back, leaving a Judgment Sigil on them for 15 sec. Deals additional ??? M.DMG to Non-Hero enemies and causes them to take 25% increased M.DMG for 10 sec",
        "mana": 2,
        "cooldown": 6,
        "order": 1
      },
      {
        "name": "Purifying Blaze",
        "description": "Deals 382266 M.DMG to frontal enemies in a straight line. Deals additional 729969 M.DMG that ignores DEF to targets with Judgment Sigil, and reduces their Heal Rate by 50% for 10 sec",
        "mana": 3,
        "cooldown": 15,
        "order": 2
      },
      {
        "name": "Arbiter",
        "description": "Deals 541319 M.DMG to the target and enemies in a nearby range. Enemies with Judgment Sigil take 50% increased M.DMG and become silenced for 5 sec. Afterward, grants immunity to M.DMG to all allies for 5 sec",
        "mana": 4,
        "cooldown": 25,
        "order": 3
      },
      {
        "name": "The Last Judgment",
        "description": "Every 15 sec, deals 154780 M.DMG ignoring DEF to enemies inflicted by Judgement Sigil. Once during every battle, upon reaching near death HP, deals 330835 M.DMG to enemies inflicted by Judgement Sigils and stuns them for 3 sec, while casting a shield that blocks 563411 DMG to all allies for 5 sec. Gains immunity to CC while the shield is in effect. When the shield effect takes place, consumes all mana, and all skill cooldown is increased by 50%",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 4,
    "name": "Artemia",
    "description": "Penteonia is an impenetrable kingdom. Even the Demon Army could not breach its defense 100 years ago. Ruling over this iron kingdom is Artemia, the Empress of Light. Ever since childhood, she has lived under the weight of responsibility of the throne she would eventually inherit. When she finally realized that the victory of her kingdom was only made possible by the sacrifices of her people, she swore to never hide from her duties. She would face the pressure of royal responsibility with courage. Penteonia has historically been a selfish kingdom, only interested in its own safety. Now, with Artemia as its ruler, everything is about to change.",
    "type_dmg": "Magic",
    "slug": "artemia",
    "role_id": "wizard",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 985328,
        "ATK": 29328,
        "P.DEF": 3904,
        "M.DEF": 5864
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "Penetration": 150,
        "ACC": 100,
        "M.Dodge": 200,
        "M.Block": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Pillar of Light",
        "description": "Places a Pillar of Light on target enemy, dealing a total of 366050 M.DMG for 3 sec and reducing enemy ATK by 20% for 10 sec",
        "mana": 2,
        "cooldown": 7,
        "order": 1
      },
      {
        "name": "Critical Intensity",
        "description": "Deals 359697 M.DMG to frontal enemies in a straight line. This attack's Crit DMG is increased by 100%",
        "mana": 3,
        "cooldown": 14,
        "order": 2
      },
      {
        "name": "Light's Judgment",
        "description": "Attacks all enemies 3 times, dealing a total of 545880 M.DMG and stunning them for 5 sec. Per each killed enemy with this skill, cooldown is reduced by 30%",
        "mana": 4,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Blessing of Light",
        "description": "Each attack has a 50% chance of dealing 44816 M.DMG to target and nearby enemies, while Artemia gains 1 stack of Blessing of Light. Blessing of Light can be stacked up to 10 times max. Per every stack, ATK is increased by 5222 , DMG dealt to enemies other than heroes is increased by 7% and DMG received from enemies other than heroes is reduced by 3%",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 5,
    "name": "Aselica",
    "description": "A powerful angel who defends the haven of angels. Even among the Angels who wield the power of light, she has a special connection to the sun, whose divine light she uses to fight against darkness. She is tasked with the protection of the souls of other angels awaiting resurrection. When the Holy Sword reappeared in the world, she heeded the divine call to join the new protector of the world. She will see to it that no chosen warrior would ever succumb to the darkness again.",
    "type_dmg": "Magic",
    "slug": "aselica",
    "role_id": "knight",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1706672,
        "ATK": 19792,
        "P.DEF": 8792,
        "M.DEF": 6840
      }
    ],
    "add_stats": [
      {
        "Crit": 50,
        "P.Block": 100,
        "M.Block": 100,
        "P.Tough": 250,
        "M.Tough": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Sword of the Sun",
        "description": "Deals 138175 M.DMG to enemy and surrounding enemies within range, and inflicts Stun for 3 sec",
        "mana": 2,
        "cooldown": 9,
        "order": 1
      },
      {
        "name": "Blessing of the Sun",
        "description": "Imbues the Blessing of the Sun to the ally with the highest ATK, reducing cooldown of all skills by 20% and increasing ATK by 38948 for 15 sec",
        "mana": 2,
        "cooldown": 20,
        "order": 2
      },
      {
        "name": "Judgment of the Sun",
        "description": "Takes position, focuses to heal HP of nearby allies, excluding self, 8 times for a total of 24357, and increases their P.DEF by 52477 for 5 sec. Deals a total of 277151 M.DMG on enemies within range over 8 times, and decreases their M.DEF by 28970 for 5 sec. After the end of the casting, heals HP of allies within range, excluding self, by 153676, and deals 119552 M.DMG on enemies, and knocks them down for 3 sec",
        "mana": 4,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Curse of the Sun",
        "description": "Upon attack, inflicts Curse of the Sun on the target for 10 sec. Enemies with 10 stacks of Curses of the Sun will consume the stack to receive 111223 M.DMG, and become inflicted with Blind for 2 sec, having their ATK reduced by 20% for 10 sec",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 6,
    "name": "Baudouin",
    "description": "As the most unlikely priest in the Church of Lua, Baudouin is, in a word, a maverick. Since childhood, he has always been a black sheep in the Church of Lua that emphasizes piety. He entered the church with the help of the High Priest Berman, but the religious life was painfully ill-suited for him. One day, however, he suddenly decided to quit his deviant ways, and started following the path of the high priesthood.",
    "type_dmg": "Magic",
    "slug": "baudouin",
    "role_id": "priest",
    "position": "Middle",
    "base_stats": [
      {
        "Max HP": 1104864,
        "ATK": 23216,
        "P.DEF": 4888,
        "M.DEF": 6104
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "ACC": 100,
        "M.Block": 500,
        "M.Block DEF": 250,
        "M.Tough": 150,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Holy Nova",
        "description": "Targets the ally with the lowest HP and allies nearby to heal 194058 HP. Deals 64342 M.DMG to enemies near the target, and reduces enemy ATK Spd by 25% for 10 sec.",
        "mana": 2,
        "cooldown": 6,
        "order": 1
      },
      {
        "name": "Spear of Light",
        "description": "Deals 185571 M.DMG, inflicts knockback, and shackles the target enemy for 6 sec. Enemies inflicted by shackle take 25% increased M.DMG while the effect lasts.",
        "mana": 2,
        "cooldown": 15,
        "order": 2
      },
      {
        "name": "Holy Sanctuary",
        "description": "Grants Invincibility to all allies for 7 sec and heals 298431 HP for the duration of skill.",
        "mana": 1,
        "cooldown": 60,
        "order": 3
      },
      {
        "name": "Training of God",
        "description": "Each attack has a 20% chance of dealing 141067 M.DMG to target and inflicting stun for 1.5 sec.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 7,
    "name": "Bernheim",
    "description": "Born in a noble family in Penteonia, Bernheim von Lachelima was gifted with outstanding martial skills. He had the strength of a giant and excellent judgment, so it was undeniable that he would make a great knight. However, he had a fatal flaw that kept him from being successful in Penteonia: He could not use the power of light at all. No matter how hard he tried, how strong his faith and will were, the power of light did not answer to his calling. Although all he ever wanted was to serve his nation and the Queen, the fact that his incapability was keeping him from being more than a low-level knight frustrated him. Bernheim did not give up and trained hard to handle the power of light, but his constant lack of progress slowly started to weaken his mind. One day, he visited the Central Church to study the power of light and its mechanism. It was when he was quietly reading a book that he heard a sound. It was an angelic voice calling for him. The long-accumulated frustration of Bernheim led him to where the voice was coming from, a room sealed with multiple magic barriers in the basement of the church. As he moved closer to it, the barriers vanished as if they were never there. What he saw inside the room was a sword in the shape of an angel, exuding blinding light. 'You are the chosen one', said the sword, drawing him near with holy light. Thinking that his relentless effort had finally paid off, he slowly grasped the sword. Then, his mind was drawn into the deepest darkness. The darkness that captured him—it was the endless shadowy void of futility. A vessel that could never be filled; a whole other universe. In the vast darkness, Bernheim felt his mind deteriorating and his existence fading away. His mind and body was slowly being encroached by a dark, ominous power. However, Bernheim was also one of the Penteonian Knights, a Knight of Light who swore not to be defeated by darkness. He rose from the shrouding darkness, regaining consciousness with his indomitable spirit. When he came to his senses, lying on the floor, there was a giant black sword in his hand. The demonic sword with the appearance of a demon was laughing and mocking the knight who broke away from the path of light. Eventually, Bernheim was banished from Penteonia, and he started to live a new life as a mercenary in Vespia Empire with that malicious, foul-mouthed demonic sword in his hand...",
    "type_dmg": "Magic",
    "slug": "bernheim",
    "role_id": "warrior",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1449520,
        "ATK": 22488,
        "P.DEF": 7328,
        "M.DEF": 8792
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Penetration": 150,
        "ACC": 100,
        "P.Dodge": 100,
        "M.Dodge": 100,
        "CC Resist": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Circle of Futility",
        "description": "Attacks the target and nearby enemies within range, dealing 207231 M.DMG and placing the Circle of Futility. Circle of Futility deals 367856 M.DMG, reduces ATK Spd by 300 , and prevents enemies from receiving positive effects over 4 sec. A 4 sec Cooldown will be applied at the beginning of the first battle.",
        "mana": 0,
        "cooldown": 15,
        "order": 1
      },
      {
        "name": "Battle Initiation",
        "description": "Attacks enemies within frontal range, dealing 249599 M.DMG and knocking them back. Then, increases own All DMG Reduction by 200 and DEF by 26118, and gains immunity to CC for 15 sec. A 8 sec Cooldown will be applied at the beginning of the first battle.",
        "mana": 0,
        "cooldown": 22,
        "order": 2
      },
      {
        "name": "Destroyer",
        "description": "Deals 429520 M.DMG over 10 attacks to nearby enemies in a circular range around self. Then, attacks enemies in a wide surrounding area, dealing 376852 M.DMG and stunning them for 5 sec. If the target is not a Hero, each attack will deal additional 42074 M.DMG. A 10 sec Cooldown will be applied at the beginning of the first battle.",
        "mana": 0,
        "cooldown": 22,
        "order": 3
      },
      {
        "name": "Breakdown",
        "description": "Bernheim cannot recover Mana, and all his Skills do not consume any Mana. Normal and Skill attacks inflict Breakdown to enemies for 10 sec, reducing their Heal Rate by 1%, and increasing own ATK by 3085 and Heal Rate by 0.5%. All effects stack up to 50 times.",
        "mana": 0,
        "cooldown": 0,
        "order": 4
      }
    ]
  },
  {
    "id": 8,
    "name": "Cain",
    "description": "Ancient Sekireinel was a kingdom blessed with eternal prosperity under the rule of Cain, the greatest king that has ever ruled Sekireinel. Descendants of the desert addess Cain as the God King, as it was their way of expressing their respect to the flawless, god-like king. The people of the desert praised and followed Cain's overwhelming charisma, and Cain in return, gifted them with the fairest rule, and showed endless generosity and benevolence to his people. In Contrast, against those who would threaten his kingdom, Cain did not show any mercy. He ruthlessly tracked down and killed all those who threatened the peace of his kingdom, causing fear within the nations outside. However, deep inside the majestic, ruthless God King who asserted his reign over the kingdom, there lied a deep loneliness. When alone, the God King would contemplate endlessly. It was Laias who held Cain's hands when he was most vulnerable, and Cain fell in love with Laias who sang for him. Cain has since strongly expressed his love to Laias, eager to help Laias fulfill anything she wants.",
    "type_dmg": "Physical",
    "slug": "cain",
    "role_id": "wizard",
    "position": "Middle",
    "base_stats": [
      {
        "Max HP": 985328,
        "ATK": 29328,
        "P.DEF": 3904,
        "M.DEF": 5864
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "Penetration": 150,
        "ACC": 100,
        "M.Dodge": 200,
        "M.Block": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Tremble!",
        "description": "Cain heals the ally with the lowest HP by 237423 and grants the ally with [The God King’s Blessing], which reduces All DMG the ally receives 35% and grants immunity to CC for 3.5 sec. After 3.5 seconds, Cain dispels negative effects from the target and the allies nearby. Afterwards, heals their HP by 237423. [The God King’s Blessing] is irremovable.",
        "mana": 2,
        "cooldown": 14,
        "order": 1
      },
      {
        "name": "Kneel.",
        "description": "Cain deals 212620 P.DMG to the enemy with the highest ATK and casts [Sealing Technique of the Tyrant] that reduces the target's ATK Spd 350 and prevents the target from receiving any positive effects for 5 sec. After 5 sec, Cain deals 176824 P.DMG to the target and the enemies nearby, inflicting stun for 3 sec. [Sealing Technique of the Tyrant] is irremovable.",
        "mana": 2,
        "cooldown": 14,
        "order": "1_2"
      },
      {
        "name": "Behold My Might.",
        "description": "Cain turns into a [Tyrant] and constantly attacks the target, dealing 82084 P.DMG with each hit. While Cain is in [Tyrant] form, [Tremble!] and [Gaze Upon My Almighty Power!] change to [Kneel.] and [Now Die.]. Upon using the Skill again, he returns to [God King] form. [The God King’s Mercy] - While Cain is in God King form, reduces DMG all allies take 10%. [Dignity of the Tyrant] – While Cain is in Tyrant form, increases DMG all enemies take 10%.",
        "mana": 3,
        "cooldown": 8,
        "order": 2
      },
      {
        "name": "Gaze Upon My Almighty Power!",
        "description": "Increases All DEF of allies nearby self by 5222 for 10 sec 10 times. DEF Boost effect stacks up to 10 time(s), and if this Skill is cast on an ally with 10 stacks, increases the target’s ATK 150088 and grants immunity to CC for 10 sec.",
        "mana": 3,
        "cooldown": 25,
        "order": 3
      },
      {
        "name": "Now Die",
        "description": "Places a [Gate of Hell] in frontal area of self for 3 sec, dealing a total of 158780 P.DMG to enemies in range over 10 attack(s) and pulling them to the center. Afterwards, explodes the [Gate of hell], dealing 152815 P.DMG and stunning the enemies for 3 sec.",
        "mana": 4,
        "cooldown": 25,
        "order": "3_2"
      },
      {
        "name": "I Am the King of the Desert.",
        "description": "At the beginning of each battle, gains an irremoveable stack of [King of the Desert]. Each Stack of of [King of the Desert] increases the effect of [The God King's Mercy] and [Dignity of the Tyrant] by 5%. Additionally, recovers 100 Mana every second, and increases ATK by 13055. If [King of the Desert] is stacked 3 time(s) or more, self deals 50% increased DMG to Bosses. [King of the Desert] can be stacked up to 5 times.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 9,
    "name": "Cassandra",
    "description": "She's the owner of 'Gold Bar,' the biggest and the most luxurious tavern in Vespia. Beneath its flashy exterior, the tavern actually serves as a secret meeting place for the social elites, where invaluable secret information is constantly exchanged. Her natural charm and conversation skills can easily break down personal barriers and win the trust of others. Her true identity is a dealer of secret information and weapons.",
    "type_dmg": "Magic",
    "slug": "cassandra",
    "role_id": "priest",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 1104864,
        "ATK": 23216,
        "P.DEF": 4888,
        "M.DEF": 6104
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "ACC": 100,
        "M.Block": 500,
        "M.Block DEF": 250,
        "M.Tough": 150,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Softly~",
        "description": "Heals all allies by 231308 HP and deals 161713 M.DMG to all enemies. Hit enemies are inflicted by Silence for 2 sec.",
        "mana": 2,
        "cooldown": 8,
        "order": 1
      },
      {
        "name": "Fiercely!",
        "description": "For 15 sec, all allies' ATK is increased by 11874 and Crit Chance is increased by 700.",
        "mana": 3,
        "cooldown": 20,
        "order": 2
      },
      {
        "name": "Tempting Wave",
        "description": "Deals 322459 M.DMG to an enemy with the highest ATK. If this skill is used in Arena, inflicts Charm on the target for 7 sec. If this skill is used outside the Arena, enemy takes 25% increased M.DMG. Charmed enemies cannot use any skills, and deals auto attack to own allies.",
        "mana": 4,
        "cooldown": 22,
        "order": 3
      },
      {
        "name": "Gentle Touch",
        "description": "At the start of each battle, reduces mana cost by 2 orbs for a single skill, and all allies' DEF is increased by 20181 for 5 sec.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 10,
    "name": "Cecilia",
    "description": "A girl that dreams of a world without injustice. Cecilia, also known as the Crimson Wind of Justice, defeats enemies with her windily kicks, flying her red ribbon in the air. Her grandfather is Ricardo, the captain of Orvelia Holy Knights. She grew up watching her grandfather render justice with his heart of steel, and now dreams of realizing justice and eradicating the evil in the Empire as a member of the Resistance. Ricardo is worried for his little granddaughter since her pursuit of justice might lead her to danger. However, her shouts and kicks are always dynamic and heroic, and such worries don't bother her at all.",
    "type_dmg": "Physical",
    "slug": "cecilia",
    "role_id": "mechanic",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1157176,
        "ATK": 25416,
        "P.DEF": 5376,
        "M.DEF": 4392
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Crit DMG": 50,
        "Penetration": 100,
        "ACC": 200,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Outta the way!",
        "description": "Marks the farthest enemy as the [Villain], reducing its ATK Spd by 200 for 15 sec. Then, moves to the target to deal 130933 P.DMG. After using this Skill, [Crushing Kick!] becomes available.",
        "mana": 3,
        "cooldown": 12,
        "order": 1
      },
      {
        "name": "Crushing Kick!",
        "description": "Attacks the target, dealing 155307 P.DMG and knocking it away for 4 sec. Enemies marked as [Villain] are prioritized. After using this Skill, [Tempest Kick!] becomes available.",
        "mana": 0,
        "cooldown": 0,
        "order": "1_2"
      },
      {
        "name": "Tempest Kick!",
        "description": "Moves to the farthest enemy, dealing 185279 P.DMG and stunning it for 4 sec. Enemies marked as [Villain] are prioritized.",
        "mana": 0,
        "cooldown": 0,
        "order": "1_3"
      },
      {
        "name": "Infinite Potential",
        "description": "Deals 177450 P.DMG to nearby enemies in a circular range of self, knocking them down for 3 sec. Afterward, Cecilia gains [Infinite Potential], which increases own ATK Spd by 300 for 15 sec. While under [Infinite Potential], Normal and Skill attacks deal 29568 P.DMG to Heroes and 88713 P.DMG to Non-Hero enemies. This effect is irremovable.",
        "mana": 3,
        "cooldown": 20,
        "order": 2
      },
      {
        "name": "WA-TAAAAAH!!!",
        "description": "Deals 495594 P.DMG over 6 attacks to nearby enemies in a circular range of self. Afterward, deals 246321 P.DMG to the target and its nearby enemies, knocking them down for 4 sec. While under [Infinite Potential], [Special Move. Meteor Kick!!!] becomes available for 10 sec.",
        "mana": 3,
        "cooldown": 21,
        "order": 3
      },
      {
        "name": "Special Move. Meteor Kick!!!",
        "description": "Launches a full force attack that deals 762136 P.DMG to the target and enemies nearby, stunning them for 5 sec. This Skill will always be a Critical Hit.",
        "mana": 1,
        "cooldown": 0,
        "order": "3_2"
      },
      {
        "name": "Inborn Talent",
        "description": "Increases own DEF by 4981 and Crit Chance by 200. Cecilia's Normal and Skill attacks will not miss.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 11,
    "name": "Chase",
    "description": "A man who has lost his memory. Test subject Type. 0 that was born as a part of the human enhancement experiment of the empire. As the first type of the Project Evil Knights that were only made to kill, Chase was brought through a secretive contract with the empire to assassinate the sole successor to its throne, Scarlet. However, he went berserk for unknown reasons during a fight against Clause and Demia who were guarding Scarlet, and he abandoned his mission and left. He failed to kill Scarlet and disappeared, so the nobles who had commissioned the assassination found themselves in trouble. In the end, they hired another assassination group, the Laughing Mask, to have him killed. However, Scarlet already gave him a name, Chase, and let him stay by her side.",
    "type_dmg": "Physical",
    "slug": "chase",
    "role_id": "warrior",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1449520,
        "ATK": 22488,
        "P.DEF": 7328,
        "M.DEF": 8792
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Penetration": 150,
        "ACC": 100,
        "P.Dodge": 100,
        "M.Dodge": 100,
        "CC Resist": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "I'll Break You!",
        "description": "Prevents the target from receiving positive effects for 4 seconds, and attacks to inflict 193762 P.DMG and knocks the target back. Inflicts 74425 P.DMG after 1 second to enemies around the target and stuns them for 4 seconds.",
        "mana": 2,
        "cooldown": 12,
        "order": 1
      },
      {
        "name": "Remove Limit",
        "description": "Upon activation, [Remove Limit] takes effects. When activated, consumes 10% of current HP to remove all negative effects on self and deals 201833 P.DMG to nearby enemies in range. While [Remove Limit] is activated, consumes 1.5% of current HP every 1 second, gains Immunity to CC, and increases Crit DMG by 50% and ATK Spd by 500, and enhances normal attacks. The HP consumption, Crit DMG and ATK Spd Boost grow stronger over time. This effect is irremovable, and is automatically deactivated when HP falls under 25% or below.",
        "mana": 3,
        "cooldown": 10,
        "order": 2
      },
      {
        "name": "Burn, Spear of Fury",
        "description": "Charges at an enemy, dealing 130278 P.DMG and knocking it down. Affterward and explodes the ground around self to attack 4 times, dealing a total of 256944 P.DMG and inflicting Stun for 5 sec. Each hit recovers HP equal to 3% of Chase's Max HP + 25% of DMG.",
        "mana": 3,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Remember This in Hell",
        "description": "Chase is not affected by Lifesteal stats. Instead, increases self's Max HP by 20%, Crit Chance by 100, CC ACC by 100, and ACC by 100. Whenever HP drops by 1%, increaes Crit DMG 1% and ATK Spd by 4. Upon taking a fatal DMG by 40%, ATK Spd 400, and gaining immunity to CC for the duration. The resurrection effect can be activated only once in battle, and resurrected Chase cannot use skills.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 12,
    "name": "Chrisha",
    "description": "Commander of Velchia, the proud Magic Knights of the Empire, and the Inquisitor working directly under the Emperor. It is her duty to eliminate corruption, rebels, and everything else that threatens the Empire. The people of the Empire praise her and think of her as a hero, a title she has never been eager to accept. As a daughter of the Van Nosenhill family, and as a soldier of the Empire, all that matters to her is fulfilling her duties.",
    "type_dmg": "Magic",
    "slug": "chrisha",
    "role_id": "mechanic",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 1157176,
        "ATK": 25416,
        "P.DEF": 5376,
        "M.DEF": 4392
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Crit DMG": 50,
        "Penetration": 100,
        "ACC": 200,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Light of Annihilation",
        "description": "Deals 276148 M.DMG that ignores DEF to the target, and inflicts stun for 3 sec. Deals additional 199099 M.DMG that ignores DEF to Non-Hero targets. After use, removes all stacked Lights and gains irremovable Red Light.",
        "mana": 3,
        "cooldown": 19,
        "order": 1
      },
      {
        "name": "Enemy Blockade",
        "description": "Dispels all negative effects from self, deals 70196 M.DMG to all enemies, and silences them for 1 sec. After use, removes all stacked Lights and gains irremovable Blue Light.",
        "mana": 3,
        "cooldown": 16,
        "order": 2
      },
      {
        "name": "Green Zone",
        "description": "Deals 158988 M.DMG to frontal enemies in a straight line and creates a Green Zone ahead. Enemies in the Green Zone cannot receive positive effects and takes a total of 160980 M.DMG over 3 sec, having their Heal Rate reduced by 30%. After use, removes all stacked Lights and gains irremovable Green Light.",
        "mana": 3,
        "cooldown": 25,
        "order": 3
      },
      {
        "name": "Technomagic of the Empire",
        "description": "Increases ATK by 7118 and ACC by 100 for all allies, and own normal attack effect changes according to the color of light owned. Red Light - Increases DMG of normal attack by 100%, and upon attack, reduces Cooldown of [Light of Annihilation] by 1 sec. Blue Light - Reduces DMG of normal attack by 50%, but deals DMG to the entire enemy. Targets take 30% increased M.DMG for 10 sec. Green Light - Reduces DMG of normal attack by 20%, but deals DMG to 2 enemies. Heal Rate of the target is reduced by 20% for 5 sec.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 13,
    "name": "Clause",
    "description": "This upright and righteous man protects Orvel as one of its knights. Many people consider him a dependable defender of Orvel, but due to his lack of interest in wealth and success, his actual rank within the order has never been very high. He grew up together with Kasel and Frey in the same orphanage, and he loves his land as the home of those precious to him. He recently volunteered to join the expedition to investigate the King's Plains.",
    "type_dmg": "Physical",
    "slug": "clause",
    "role_id": "knight",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1706672,
        "ATK": 19792,
        "P.DEF": 8792,
        "M.DEF": 6840
      }
    ],
    "add_stats": [
      {
        "Crit": 50,
        "P.Block": 100,
        "M.Block": 100,
        "P.Tough": 250,
        "M.Tough": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Cut Ground",
        "description": "Leaps into the air and deals 100454 P.DMG to enemies in range, stunning them for 3 sec.",
        "mana": 2,
        "cooldown": 9,
        "order": 1
      },
      {
        "name": "Shield Strike",
        "description": "Deals 153118 P.DMG proportional to DEF to enemies in range and knocks them back. Hit enemies' DEF is reduced by 30%. Upon blocking an attack, skill cooldown is reduced by 0.5 sec.",
        "mana": 1,
        "cooldown": 8,
        "order": 2
      },
      {
        "name": "Guardian Shield",
        "description": "All allies' P.DEF is increased by 18044 for 20 sec and P.Crit Resistance is increased by 30%.",
        "mana": 2,
        "cooldown": 12,
        "order": 3
      },
      {
        "name": "Vow of Knights",
        "description": "Upon blocking, deals 18655 P.DMG to frontal enemies and decreases ATK of affected targets by 20% for 8 sec. Recovers 300 MP after hitting the target.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 14,
    "name": "Cleo",
    "description": "Cleo's earliest memory begins at the Tower of Sage. Raised by Dominiks the Great Sage as an orphan, she is both a genius wizard and a troublemaker. Her inability to control her own power has often led to trouble, including partial destruction of the Red Tower, her own residence. Despite this, her apparent immunity to the wrath of the Great Sage has caused her to be ostracized from her peers. Although this has led her to become selfish and inconsiderate, deep inside, she is still a kindhearted girl who fears abandonment by others.",
    "type_dmg": "Magic",
    "slug": "cleo",
    "role_id": "wizard",
    "position": "Middle",
    "base_stats": [
      {
        "Max HP": 985328,
        "ATK": 29328,
        "P.DEF": 3904,
        "M.DEF": 5864
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "Penetration": 150,
        "ACC": 100,
        "M.Dodge": 200,
        "M.Block": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Fire Needle",
        "description": "Attacks a random enemy 5 times to deal a total of 482115 M.DMG. Recovers own Mana by 100 upon a Critical Hit.",
        "mana": 2,
        "cooldown": 5,
        "order": 1
      },
      {
        "name": "Fire Ball",
        "description": "Attacks the target and the enemies in nearby range, dealing 431029 M.DMG and stunning them for 2 sec. Deals 667081 additional M.DMG to Bosses.",
        "mana": 3,
        "cooldown": 10,
        "order": 2
      },
      {
        "name": "Fire Rain",
        "description": "Attacks all enemies 5 times, dealing a total of 957270 M.DMG. This attack deals 150% increased Crit DMG.",
        "mana": 4,
        "cooldown": 15,
        "order": 3
      },
      {
        "name": "Flame Diffusion",
        "description": "Inflicts a stack of Ember upon hitting an enemy. Enemies affected by Ember take 321520 M.DMG over 20 seconds. Ember can be stacked up to max 10 times.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 15,
    "name": "Crow",
    "description": "Code name: Hound. A bounty hunter known as the hound of hell. It is said that no one can escape from this former Imperial Navy officer once he targets them. The only consolation for criminals is that this man isn’t motivated by their bounties alone. While there are many theories, the most convincing one is that he’s after revenge. There are moments when this cold-hearted man seems to warm up, they say. It's when he pulls out an old pendant, which nobody has actually seen.",
    "type_dmg": "Physical",
    "slug": "crow",
    "role_id": "mechanic",
    "position": "Middle",
    "base_stats": [
      {
        "Max HP": 1157176,
        "ATK": 25416,
        "P.DEF": 5376,
        "M.DEF": 4392
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Crit DMG": 50,
        "Penetration": 100,
        "ACC": 200,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Target will be Eliminated.",
        "description": "Deals a total of 184725 P.DMG to enemies in front over 15 times and leaves 2 'Hunting Dog's Fang Marks' for 40 sec. Hunting Dog's Fang Mark stacks up to max 100 times.",
        "mana": 2,
        "cooldown": 10,
        "order": 1
      },
      {
        "name": "Struggle is Meaningless.",
        "description": "Attacks a random enemy 10 times and deals a total of 220010 P.DMG. Shoots a Frost Bullet that deals 123175 P.DMG to target and surrounding enemies, freezing them for 4 sec. The special Frost Bullet creates a freezing area for 6 seconds that deals 58962 P.DMG every 2 sec, with a 50% chance to freeze for 2 sec.",
        "mana": 3,
        "cooldown": 15,
        "order": 2
      },
      {
        "name": "Even Gods shall Die.",
        "description": "Takes position and focuses to shoot a laser, dealing 217937 P.DMG to frontal enemies within range, and consumes target's stack of Hunting Dog's Fang Mark to deal 5947 additional P.DMG per each stack. Depending on the focusing time, the effect's range increases, and DMG is increased up to max 100%. Once the focus is completed, knocks back the enemy far away.",
        "mana": 4,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Hunting Preparation",
        "description": "Crow is not affected by changes in ATK Spd. ATK increases by 28496 and Crit DMG by 80%. Recovers 300 Mana every second. It also leaves a 'Hunting Dog's Fang Mark' to target for 40 sec when dealing a normal attack.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 16,
    "name": "Dakaris",
    "description": "As the Empire expanded its territory, the long occupying natives resisted relentlessly. However, they all eventually fell before the Empire's brutal military force as well as overwhelming technology. Dakaris' homeland, the reclusive Lake Eretana, hidden deep inside the mountains, was no exception. The Empire let the natives stay in their land, but by no means were they treated with respect. To make things worse, the officers and nobles appointed to the area were mostly corrupted, making it even more difficult for the natives. The noble appointed to Lake Eretana was especially the worse. The atrocities grew worse each day, eventually leading to the deaths of young, and innocent Lizardmen. This lead Dakaris to gather his tribe to get back their freedom. 'To soothe the spirits of my ancestors, and to liberate my tribe - I will not hesitate, I will take back our rightful future with the Resistance.' Currently, he is a key member of the Resistance, leading them with his wisdom and insight.",
    "type_dmg": "Magic",
    "slug": "dakaris",
    "role_id": "wizard",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 985328,
        "ATK": 29328,
        "P.DEF": 3904,
        "M.DEF": 5864
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "Penetration": 150,
        "ACC": 100,
        "M.Dodge": 200,
        "M.Block": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Judgment Upon Them!",
        "description": "Deals 210887 M. DMG to the target and enemies nearby, stunning them for 1 sec and healing allies within the range by 146784 HP. Activating [Grant Me Strength!] will reset Cooldown of this Skill, and remove Cooldown up to 3 Skill uses.",
        "mana": 2,
        "cooldown": 3,
        "order": 1
      },
      {
        "name": "Grant Me Strength!",
        "description": "Over 10 sec, heals own HP by 614290 and recovers 2 orbs of Mana, increasing ATK by 91907 for the duration. If own HP is full upon activation, casts a shield that blocks 131493 DMG and grants CC Immunity for 5 sec. If there are 3 or less allies, this effect will apply to all allies.",
        "mana": 0,
        "cooldown": 18,
        "order": 2
      },
      {
        "name": "May Their Agony End!",
        "description": "Attacks a random enemy 5 times, dealing 734270 M.DMG in total. If the target is not a Hero, deals additional 230620 M.DMG. While [Grant Me Strength!] is active, an enemy with highest ATK will be prioritized.",
        "mana": 3,
        "cooldown": 13,
        "order": 3
      },
      {
        "name": "Might of the Ancestors!",
        "description": "If own HP is full, increases ATK by 83351. If not, heals own HP by 44253 every sec. Upon taking a fatal damage, consumes entire Mana to cast a shield that blocks 654722 DMG and grants CC Immunity for 5 sec. While the shield is active, Dakaris cannot recover Mana.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 90,
    "name": "Dark Lord Kasel",
    "description": "The new Dark Lord that was born when the seed of the Dark Lord concealed within the Holy Sword finally corrupted Kasel. His actions have an almost mechanic feel to them as if he is repressing the newly crowned Dark Lord Kasel's will. As the Dark Lord had the power to multiply his vessel's potential explosively, he used Kasel's remarkable power that exceeded Kyle's to fully embrace the purpose of destroying Lua's artifacts that protects the world, which was planted within the Dark Lord's instinct by the goddess Lea. He soon grew to be a formidable enemy, firmly establishing his position as a new Dark Lord.",
    "type_dmg": "Physical",
    "slug": "dark-lord-kasel",
    "role_id": "warrior",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1449520,
        "ATK": 22488,
        "P.DEF": 7328,
        "M.DEF": 8792
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Penetration": 150,
        "ACC": 100,
        "P.Dodge": 100,
        "M.Dodge": 100,
        "CC Resist": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Judgement Blade",
        "description": "Attacks frontal enemies in a straight line 2 times, dealing a total of 238440 P.DMG and preventing enemies from recovering Mana for 2 sec. [Dark Lord] Additionally attacks enemies in wide range 1 time, dealing 210711 P.DMG and knocking them down for 3 sec. Requires 5 or more stacks of [Dark Energy] for use.",
        "mana": 0,
        "cooldown": 11,
        "order": 1
      },
      {
        "name": "Doom",
        "description": "Explodes darkess and attacks frontal enemies in a straight line 3 times, dealing a total of 353940 P.DMG and knocking them away for 3 sec. [Dark Lord] Deals 192720 P.DMG to 1 enemy furthest away and pulls it in front of self, exploding Darkness afterward. Requires 15 or more stacks of [Dark Energy] for use.",
        "mana": 0,
        "cooldown": 15,
        "order": 2
      },
      {
        "name": "Advent of the Dark Lord",
        "description": "Dispels negative effects from self and enter into an irremovable [Dark Lord] state for 20 sec, dealing 192720 P.DMG to nearby enemies in circular range of self. During [Dark Lord] state, all skills are enhanced, gains immunity to CC, and normal attacks deal 23013 additional P.DMG each hit. Requires 25 or more stacks of [Dark Energy] for use. Upon use, consume all stacks to increase own ATK by 2000 and DEF Penetration by 10 per stack.",
        "mana": 0,
        "cooldown": 25,
        "order": 3
      },
      {
        "name": "One Fallen to Darkness",
        "description": "Although Dark Lord Kasel cannot recover Mana since he is granted with the power of Darkness, his ATK increases by 39655, deals attacks that always hit, and requires [Dark Energy] stacks to use Skills. Normal attacks grant [Dark Energy] stacks. [Dark Energy] can be stacked up to max 40 times and is irremovable.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 17,
    "name": "Demia",
    "description": "Ziltrion Si Demia. The commander of the Guardian Knights of Orvel. She is a mighty and dignified knight who wields a lance and a giant shield. It is said that penetrating her shield is next to impossible. As a knight commander, she cherishes her subordinates, and is prepared to perform any task in service of her land. Having felt the recent change of the atmosphere within the royal palace, she hopes to quickly appoint Clause as the next commander so that she may protect Scarlet from the aggression of the nobles.",
    "type_dmg": "Physical",
    "slug": "demia",
    "role_id": "knight",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1706672,
        "ATK": 19792,
        "P.DEF": 8792,
        "M.DEF": 6840
      }
    ],
    "add_stats": [
      {
        "Crit": 50,
        "P.Block": 100,
        "M.Block": 100,
        "P.Tough": 250,
        "M.Tough": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Penetration",
        "description": "Throws a spear at the furthest enemy, dealing 61272 P.DMG and drawing the enemy in front of the hero. Then deals 40920 P.DMG to enemies in range, stunning them for 3 sec.",
        "mana": 3,
        "cooldown": 11,
        "order": 1
      },
      {
        "name": "Will to Win",
        "description": "Upon blocking enemy attack for 15 sec, triggers a shockwave that deals 36927 P.DMG to enemies in range, reducing their ATK by 20%.",
        "mana": 2,
        "cooldown": 15,
        "order": 2
      },
      {
        "name": "Steel Fortress",
        "description": "Upon DMG block during casting, jump attack DMG is increased by 7%. Also, deals 49076 P.DMG to enemy and inflicts stun. After casting, jumps and attacks the enemy, dealing 181181 P.DMG and stunning them for 4 sec. Gains immunity to CC while the skill is in use.",
        "mana": 4,
        "cooldown": 22,
        "order": 3
      },
      {
        "name": "Spearhead",
        "description": "All allies' P.DEF is increased by 7118 and P.Block chance is increased by 250.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 18,
    "name": "Dimael",
    "description": "This lonely Dark Elf swore vengeance against his own race for the death of his sister. Having barely survived his deployment to the Aegina Desert, the only thing waiting for him back home was the dreadful news that his sister had been killed as an Elven sacrifice. As he cried out her name in the darkness, he began succumbing to madness. Eventually, he swore an oath of hatred and vengeance against his own kind, the murderers of his sister.",
    "type_dmg": "Magic",
    "slug": "dimael",
    "role_id": "archer",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 1066728,
        "ATK": 27864,
        "P.DEF": 5376,
        "M.DEF": 4392
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Penetration": 250,
        "ACC": 100,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Dark Rampage",
        "description": "Deals 535290 M.DMG to an enemy.",
        "mana": 1,
        "cooldown": 8,
        "order": 1
      },
      {
        "name": "Black Shackle",
        "description": "Deals 333668 M.DMG to enemies in range and shackles them for 6 sec.",
        "mana": 3,
        "cooldown": 15,
        "order": 2
      },
      {
        "name": "Shadow Wave",
        "description": "Deals 393125 M.DMG to enemies in a straight line and inflicts Blind for 6 sec.",
        "mana": 3,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Black Stain",
        "description": "Each auto attack deals extra 41573 M.DMG that ignores target's M.DEF.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 19,
    "name": "Dosarta",
    "description": "A sentinel of Elidora Kingdom guarding the Tower of Challenge. According to the rules, those from a royal family in the position of guardian almost never get released from their duty before their service ends, but desperate times call for all sorts of exceptions. Dosarta was allowed to leave the Tower of Challenge to carry out missions if need be, and now she's determined to use the opportunity to make a lot of friends. How many friends could this Elven guardian make?",
    "type_dmg": "Magic",
    "slug": "dosarta",
    "role_id": "knight",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1706672,
        "ATK": 19792,
        "P.DEF": 8792,
        "M.DEF": 6840
      }
    ],
    "add_stats": [
      {
        "Crit": 50,
        "P.Block": 100,
        "M.Block": 100,
        "P.Tough": 250,
        "M.Tough": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "This Will Hurt!",
        "description": "After increasing CC Resist of allies within self's range by 200 for 10 sec, attacks enemies to deal 268437 M.DMG and causes them to take 30% increased M.DMG for 10 sec. Hit enemies become unable to recover Mana for 3 sec.",
        "mana": 3,
        "cooldown": 14,
        "order": 1
      },
      {
        "name": "On Guard!",
        "description": "Dispels negative effects from all allies and increases P.DEF by 15674 + 4% of Dosarta's ATK for 10 sec.",
        "mana": 2,
        "cooldown": 16,
        "order": 2
      },
      {
        "name": "Hya! Kya! Take this!",
        "description": "Attacks a target 4 times, dealing a total of 868500 M.DMG and stunning it for 4 sec. Afterward, launches a final attack on frontal enemies within range, dealing 293159 M.DMG and pulling them to the center. Against Non-Hero enemies, each attack deals additional 150072 M.DMG that ignores DEF.",
        "mana": 4,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Let Us Challenge Together!",
        "description": "Upon blocking, reduces Cooldown of self's active Skills by 1 sec and increases P.DEF of self by 8781 + 1% of Dosarta's ATK for 4 sec. A 6 -sec Cooldown will be applied.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 20,
    "name": "Epis",
    "description": "This playful and bewitching succubus acts on her own whims. As expected of her Demon lineage, she is a hedonist driven by what she finds fun and enjoyable. Even during the Demon War, she chose traveling around on her own over joining the invasion. In her eyes, fighting alongside Kyle was interesting enough for her to even betray her own kind. When she later met Kasel, she gladly joined his party, knowing that she found another fun adventure for herself. When she finds attractive men, she sometimes visits them in their dreams.",
    "type_dmg": "Magic",
    "slug": "epis",
    "role_id": "assassin",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1384992,
        "ATK": 24688,
        "P.DEF": 7816,
        "M.DEF": 6840
      }
    ],
    "add_stats": [
      {
        "Crit": 200,
        "Crit DMG": 30,
        "ACC": 100,
        "P.Dodge": 200,
        "M.Dodge": 200,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Absorbing Blow",
        "description": "Deals 330336 M.DMG that ignores enemy DEF, and heals 25% of DMG as HP.",
        "mana": 2,
        "cooldown": 12,
        "order": 1
      },
      {
        "name": "Nightmare",
        "description": "Moves behind the furthest enemy and deals 183572 M.DMG. Hit enemies take 30% increased M.DMG for 10 sec.",
        "mana": 2,
        "cooldown": 8,
        "order": 2
      },
      {
        "name": "Devil's Prom",
        "description": "Deals 695356 M.DMG to all enemies in range. Gains CC immunity while using this skill.",
        "mana": 4,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Harvest",
        "description": "When an enemy is killed by this hero, ATK is increased by 16381 for 12 sec, and all skill cooldown is reduced by 30%.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 21,
    "name": "Erze",
    "description": "Born the second daughter of the ShadowHilt family, Erze also chose to become a vampire hunter after her beloved sister Seria. Erze's feeble frame kept her from learning how to fight with swords, but she managed to become known as a hunter with her talents in magic. One day she fell into a trap during an operation and was bitten by a mysterious vampire on the shoulder. Her weak constitution grew worse, and she suffered from frequent headaches and thirst every night. Erze knew what this meant and what would end up happening to her. She hid the bite and tried to find a cure on her own, distancing herself from her comrades in her efforts. Meanwhile, Seria was dispatched to Windland Snow Mountain to investigate the Vampire Princess that went missing 100 years ago. On the day her sister left... - Ahh, Seria... I cannot control it anymore... Erze quietly and secretly started slitting the throats of her comrades.",
    "type_dmg": "Physical",
    "slug": "erze",
    "role_id": "assassin",
    "position": "Middle",
    "base_stats": [
      {
        "Max HP": 1384992,
        "ATK": 24688,
        "P.DEF": 7816,
        "M.DEF": 6840
      }
    ],
    "add_stats": [
      {
        "Crit": 200,
        "Crit DMG": 30,
        "ACC": 100,
        "P.Dodge": 200,
        "M.Dodge": 200,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Sweet Blood",
        "description": "Deals 117655 P.DMG to all enemies and Lifesteals HP equal to 10% of DMG dealt. Each hit reduces Cooldown of [Sweet Blood] by 0.5 sec and grants 1 irremovable stack of [Sweet Blood]. [Sweet Blood] can be stacked up to max 5 times, and using the Skill with 5 stacks of [Sweet Blood] grants 1 additional hit and removes [Sweet Blood] stacks.",
        "mana": 2,
        "cooldown": 5,
        "order": 1
      },
      {
        "name": "Soaking Blood",
        "description": "Dispels all negative effects and gains immunity to all CCs, P.DMG, and M.DMG for 5 sec. Inflicts 1 stack of [Soaking Blood] on all enemies, and additional 1 stack upon attacking a target with [Soaking Blood]. [Soaking Blood] can be stacked up to 6 times. Deals 86617 P.DMG to enemies with [Soaking Blood] stacks after 5 sec, and steals HP equal to 25% of the DMG dealt. For every 3 stack(s) of [Soaking Blood], hit count increases by 1 and removes [Soaking Blood] stacks upon attacking.",
        "mana": 2,
        "cooldown": 35,
        "order": 2
      },
      {
        "name": "Blood Liberation",
        "description": "Deals 45471 P.DMG to all enemies every 1 sec for 10 sec. Each hit of [Blood Liberation] causes an additional hit on 1 random enemy.",
        "mana": 3,
        "cooldown": 14,
        "order": 3
      },
      {
        "name": "Life Drinker",
        "description": "Increases ATK by 4748 and Max HP by 23748 upon killing an enemy. Stacks up to max 50. Upon taking fatal DMG, casts [Soaking Blood], and decreases Max HP by 40%. This effect is not applied when [Soaking Blood] is in cooldown. This skill consumes all Mana upon activation.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 22,
    "name": "Esker",
    "description": "Born with the spirit of a wandering artist, Esker was a star magician of the Stardust, a wandering theater troupe, until he was framed by Prime Minister El Moriham of Orvelia and disappeared. Just when everyone started forgetting about him, he came out to the world as one of the most dangerous gamblers in the secret gambling world. 'The Illusion Gambler.' That was what his challengers called him, trembling in fear. The gamblers that played with him all described him in a similar manner. As soon as they faced Esker's unique laughter, his soft voice, and his empty eyes, they all felt nauseated by the suspicion that the man in the front was reading their every move.",
    "type_dmg": "Magic",
    "slug": "esker",
    "role_id": "wizard",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 985328,
        "ATK": 29328,
        "P.DEF": 3904,
        "M.DEF": 5864
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "Penetration": 150,
        "ACC": 100,
        "M.Dodge": 200,
        "M.Block": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "This Is My Game",
        "description": "Attacks a random enemy 3 times, dealing 122090 M.DMG and stunning it for 3 sec. If the 3 attacks land on the same enemy, deals additional 256654 M.DMG that ignores DEF.",
        "mana": 2,
        "cooldown": 14,
        "order": 1
      },
      {
        "name": "My Turn",
        "description": "Rolls the dice and increases ATK and Crit DMG of 2 random allies by 4748 and 7% respectively for 60 sec. This effect can be stacked up to max 10 times, and the number of targets increases by 1 per 1 pip on the rolled dice.",
        "mana": 2,
        "cooldown": 18,
        "order": 2
      },
      {
        "name": "Shall I Try My Luck?",
        "description": "Attacks all enemies and deals 377720 M.DMG, permanently reducing Cooldown of this skill by 2 sec or increasing its DMG by 30%, each with a 50% chance. This effect can be stacked up to max 10 times.",
        "mana": 4,
        "cooldown": 22,
        "order": 3
      },
      {
        "name": "This Is Not a Trick",
        "description": "Every 10 sec, increases own ATK by 4274 and DEF by 2611. This effect can be stacked up to max 10 times.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 82,
    "name": "Evan",
    "description": "The Gretchen family is a high-ranking vampire family that is called as the guardian of wisdom and the pursuer of knowledge. They have poured their efforts into the study and knowledge of magic for centuries. While they were the distant relatives of the princess Lewisia, they always have upheld the rule of not interfering with the humans, as they believed humans were fools who were swayed by greed. But when the current head of the family, Vilhelmina La Gretchen, married a human, their immense knowledge that was concealed for centuries finally became accessible to humans. Barsi, the human who married Vilhelmina and took on her surname, was an alchemist of the Tower of Sage. He had been studying the beings of darkness which the vampires commanded and the darkness that had spread in the world. When he first heard rumors of the Gretchen family, he went to them and asked to become their student. After many incidents, Vilhelmina and Barsi soon became fast friends and came to love each other deeply. That is how Evan La Gretchen, one of the most brilliant minds among the Tower of Sage alchemists as well as the half-blood child of Vilhelmina and the human alchemist Barsi, was born. Unfortunately, Evan was weak from birth. Although he had inherited his mother's great darkness, his body was the same as a human, and therefore couldn't bear the dark power. He was always on the verge of death, and he couldn't even walk properly. In addition, since one of the properties of darkness was absorption, he was in constant danger of being devoured by his mother's power. After thinking about it for some time, Barsi took Evan and returned to the Tower of Sage, while Vilhelmina remained in her castle and continued to seek a way that her son could live more safely. Thankfully, Evan grew to be optimistic and positive, just like his father and showed interest in researching darkness. As he grew older, he tried to control the darkness within him. He acquired extensive knowledge of runes, alchemy, and elemental magic, becoming the greatest alchemist of the Tower of Sage at the age of 15. The only thing that he couldn't use was the magic that controls blood. Although the blood of a high-ranking vampire flowed through his veins, his body was too weak to hold up against the use of such magic. Despite this fact, he has achieved countless accomplishments, such as creating his own homunculus Naav Gehen as well as studying and observing the darkness that effects the world with Lewisia. To commend his talent and accomplishments, the Tower of Sage granted him the title of 'Green', meaning 'Researcher' - an honorable title given only to those who have attained incredible success with their research. While he still sometimes experiences slight pains and aches due to his inherently weak body when the power of darkness becomes stronger, nonetheless he has learned to survive without the help of his parents. Now, he is able to use his power of darkness freely and shows interest in the demonic energy of demons and the power of dragons as well. He also discovered a new type of darkness that is completely different from the currently existing darkness and named it 'Tidhar'. Until recently, Evan had been staying at the Tower of Sage, continuing his research on darkness, and keeping a close eye on the 'Eclipse phenomenon' discovered in the Aegina Desert. When he received a letter from Lewisia asking him for help on the darkness that appeared in the desert, he left for the sandy lands with Naav Gehen by his side.",
    "type_dmg": "Physical",
    "slug": "evan",
    "role_id": "priest",
    "position": "Middle",
    "base_stats": [
      {
        "Max HP": 1104864,
        "ATK": 23216,
        "P.DEF": 4888,
        "M.DEF": 6104
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "ACC": 100,
        "M.Block": 500,
        "M.Block DEF": 250,
        "M.Tough": 150,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Purification of Life",
        "description": "Heals HP of all allies by 10122 and increases Heal Rate of healed allies by 25% for 15 sec.",
        "mana": 2,
        "cooldown": 12,
        "order": 1
      },
      {
        "name": "Uproar of Naav Gehen",
        "description": "Deals 103357 P.DMG to all enemies and increases P.DMG the hit enemies take by 25% for 10 sec.",
        "mana": 2,
        "cooldown": 12,
        "order": "1_2"
      },
      {
        "name": "Magic Circle of Life",
        "description": "Places a magic circle in a wide range of self for 12 sec, healing HP of all allies within range by 42890 every sec and increasing their ATK Spd by 500.",
        "mana": 3,
        "cooldown": 19,
        "order": 2
      },
      {
        "name": "Naav Gehen of Gluttony",
        "description": "Deals 51983 P.DMG to the enemy and enemies within a wide range of the target, dispelling positiv effects from hit enemies and places a magic circle for 12 sec. The magic circle deals 48431 P.DMG to enemies within range and reduces ATK by 20% every sec.",
        "mana": 3,
        "cooldown": 19,
        "order": "2_2"
      },
      {
        "name": "Origin of Life",
        "description": "Creates a shield that absorbs 318005 DMG and recovers 100 mana every sec for 15 sec on all allies. For the duration of the Shield, gains immmunity to CC.",
        "mana": 4,
        "cooldown": 25,
        "order": 3
      },
      {
        "name": "Rampage of Naav Gehen",
        "description": "Deals a total of 333474 P.DMG over 6 times to enemies within a wide range of the target and inflicts Stun for 2 sec. The last hit deals 166993 P.DMG and inflicts Stun for 5 sec.",
        "mana": 3,
        "cooldown": 19,
        "order": "3_2"
      },
      {
        "name": "Alchemy of Green",
        "description": "At the beginning of each battle, heals HP of all allies by 215154 and reduces P.DMG they take by 15% for 20 sec. [Alchemist of the Green Evan] Purification of Life, Magic Circle of Life, and Origin of Life become available for use. After Skill use, Evan turns into 'Alchemist of the Dark Evan.' [Alchemist of the Dark Evan] Uproar of Naav Gehen, Naav Gehen of Gluttony, and Rampage of Naav Gehen become available for use. After skill use, Evan turns into 'Alchemist of the Green Evan.'",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 83,
    "name": "Ezekiel",
    "description": "The son of Lucikiel is a powerful Demon officer who brought down the Republic of Gray. Usually considerate and careful, he is actually half Human. In battle, his Demon blood takes over, turning him arrogant and violent. He inherited this power from his father, whom he never even knew. However, he takes pride in his power and does not try to hide it. Since he is only partly Demon, only a single arm undergoes the transformation. However, even just this single arm contains immense power, and it's certainly not easy for him to fully control it yet. If he loses the control of the arm, the only wise decision is to immediately get as far away from him as possible.",
    "type_dmg": "Magic",
    "slug": "ezekiel",
    "role_id": "assassin",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1384992,
        "ATK": 24688,
        "P.DEF": 7816,
        "M.DEF": 6840
      }
    ],
    "add_stats": [
      {
        "Crit": 200,
        "Crit DMG": 30,
        "ACC": 100,
        "P.Dodge": 200,
        "M.Dodge": 200,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Destructive Instinct",
        "description": "Swipes nearby enemies in a circular range and deals 146299 M.DMG. Then strikes the ground, dealing 190017 M.DMG and knocking down enemies for 3 sec. [Fury] - Consumes 15% of current HP to activate. Effect range increases and swipe attack draws in enemies.",
        "mana": 2,
        "cooldown": 8,
        "order": 1
      },
      {
        "name": "Dawning Despair",
        "description": "Dashes to an enemy with the highest ATK and deals 304072 M.DMG to enemies in range, reducing their ATK Spd by 300. [Fury] - Consumes 10% of current HP to activate. Effect range increases, Stuns target for 3 sec, and increases own ATK Spd by 300 for 10 sec.",
        "mana": 2,
        "cooldown": 10,
        "order": 2
      },
      {
        "name": "Strike of Doom",
        "description": "Charges energy and attacks the enemy, dealing 331722 M.DMG and inflicting Stun for 3 sec. This DMG ignores the target's DMG Reduction effect. [Fury] - Consumes 20% of current HP to activate. Attacks enemies in range of target and DMG is tripled.",
        "mana": 2,
        "cooldown": 7,
        "order": 3
      },
      {
        "name": "Cursed Blood",
        "description": "Ezekiel gains 1 stack of 'Cursed Blood' at the end of Skill. At 3 stacks, consumes Cursed Blood to reset Cooldown of all Skills, dealing 247808 M.DMG to nearby enemies, knocking them down for 3 sec, and activating Fury for 10 sec. Fury is irremovable. While in Fury state, Ezekiel goes into auto-battle mdoe that cannot be controlled, increasing ATK by 126581, DMG of normal attacks by x2, and enhancing all Skill effects. During Fury state, Skill use does not grant a stack of Cursed Blood, but killing an enemy will grant a stack.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 91,
    "name": "Fallen Frey",
    "description": "A being that always remains by the Dark Lord's side, and would follow him through anything. Although she was an exceptional priestess and was expected to do great things, she fell into despair and rage when the goddess Lua abandoned Kasel. She corrupted herself by unleashing the darkness that she had bound deep within her soul. At the same time, all the memories of her past life came back to her, and she realized why she had such a strong divine power, but she could no longer go back to the days when she blindly followed the goddess. The divine power within her turned into demonic energy fueled with rage and hatred, and her once-devout faith became shattered by sadness and confusion. The corruption that was foretold the moment Frey descended to the World Tree...Frey turned her back to Lua's will that commanded her to protect the Warrior of the Holy Sword, and instead, accompanies the Dark Lord on his path, for that is what her heart desires. All while keeping the unwavering vow that she will walk the same path Kasel walks, forever.",
    "type_dmg": "Magic",
    "slug": "fallen-frey",
    "role_id": "priest",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 1104864,
        "ATK": 23216,
        "P.DEF": 4888,
        "M.DEF": 6104
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "ACC": 100,
        "M.Block": 500,
        "M.Block DEF": 250,
        "M.Tough": 150,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Light of Doom",
        "description": "Heals HP of the ally with the lowest HP and nearby allies by 402686 and increases Heal Rate by 20% for 10 sec. Afterward, explodes the area around the target and deals 194058 M.DMG to enemies in range, reducing their Heal Rate by 20% for sec. If this Skill is used with 1 or more stacks of [Darkened Power], consumes 1 stack and dispels positive effects of all enemies within range.",
        "mana": 2,
        "cooldown": 9,
        "order": 1
      },
      {
        "name": "Blessing of Doom",
        "description": "Grants [Blessing of Doom] to 4 allies with the lowest HP, absorbing 428716 DMG for 10 sec. The shield grants immunity to CC and increases ATK Spd by 500 for the duration. If this Skill is used with 1 or more stacks of [Darkened Power], consumes 1 stack to dispel negative effects from self and additionally dispels negative effects from targets.",
        "mana": 3,
        "cooldown": 17,
        "order": 2
      },
      {
        "name": "Heaven's Vengeance",
        "description": "Brings Heaven's Vengeance upon a random enemy and nearby enemies over 20 hits, dealing 67184 M.DMG each hit and increases All DMG the target takes by 10% for 20 sec. 500 additional DEF Penetration applies to this Skill. If this skill is used with 1 or more stacks of [Darkened Power], consumes 1 stack and inflicts Stun on the hit enemies for 0.5 sec each hit. The DMG Boost effect can be stacked up to max 5 times.",
        "mana": 5,
        "cooldown": 22,
        "order": 3
      },
      {
        "name": "Tainted Angel",
        "description": "As Fallen Frey has been corrupted by the darkness, she takes 15% increased DMG, but she recovers 400 Mana every sec, and when her Mana is at 100%, she gains [Darkened Power] every sec. [Darkened Power] can be stacked up to max 2 times and is irremovable.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 84,
    "name": "Fluss",
    "description": "As the son of the commander of the Imperial Knights, he has received rigorous training since early childhood to become a proper swordsman. No one can question his title as the fastest swordsman in the imperial palace. The number of enemy knights he felled in the fields of battle is a testament to his skills. He quickly rose to the rank as the vice-captain of the Imperial Guard and is the subject of everyone's admiration. Although he is aware of his beautiful appearance, he detests those who approach him for his outer beauty. He considers inner beauty more important than what is visible. However, he's slightly hypocritical in that he occasionally falls for his own beauty.",
    "type_dmg": "Physical",
    "slug": "fluss",
    "role_id": "assassin",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1384992,
        "ATK": 24688,
        "P.DEF": 7816,
        "M.DEF": 6840
      }
    ],
    "add_stats": [
      {
        "Crit": 200,
        "Crit DMG": 30,
        "ACC": 100,
        "P.Dodge": 200,
        "M.Dodge": 200,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Tempest Blade",
        "description": "Attacks the target and the enemies near it 3 times, dealing a total of 320892 P.DMG. If the target is not a Hero, inflicts a total of 445640 additional P.DMG over 5 sec.",
        "mana": 2,
        "cooldown": 6,
        "order": 1
      },
      {
        "name": "Flashstep",
        "description": "Moves to the enemy with the highest ATK, dispels positive effects from the target, inflicts Silence for 2 sec, and leaves a Mark for 10 sec. Afterwar, Fluss' all attacks prioritize the Marked target and deal 20598 P.DMG per attack. When the Marked target dies, resets Cooldown of this Skill and recovers 2000 Mana.",
        "mana": 2,
        "cooldown": 10,
        "order": 2
      },
      {
        "name": "Bloody Petals",
        "description": "Deals a total of 742653 P.DMG to an enemy over 16 hits, and suppresses the target while casting. This DMG ignores the target's Block effects.",
        "mana": 2,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Spell Cutter",
        "description": "Increases own M.DEF by 11874. Upon taking M.DMG, deals 118767 P.DMG to the attacker, reduces its ATK by 30% for 5 sec, and dodges All M.DMG for 3 sec. This effect activates only once every 10 sec.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 85,
    "name": "Frey",
    "description": "An apprentice priestess serving the Goddess Lua, the church has high expectations of her as a future priestess. From the early years of her training, she has amazed even the high priests with her strong faith and natural talent for channeling Lua's power. She herself considers priesthood her destined path, and her kind heart reflects her resolve. However, she shows no mercy toward evildoers.",
    "type_dmg": "Magic",
    "slug": "frey",
    "role_id": "priest",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 1104864,
        "ATK": 23216,
        "P.DEF": 4888,
        "M.DEF": 6104
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "ACC": 100,
        "M.Block": 500,
        "M.Block DEF": 250,
        "M.Tough": 150,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Miraculous Light",
        "description": "Dispels negative effects from the ally with the lowest HP, healing HP of the target by 607131 and HP of allies nearby equal to 40% of Heal Rate.",
        "mana": 2,
        "cooldown": 8,
        "order": 1
      },
      {
        "name": "Blessings of Light",
        "description": "Casts a shield that absorbs 318005 DMG for 12 sec on all allies. While the shield is active, the target increases its ATK by 20%, Heal Rate by 50%, and gains immunity to CC.",
        "mana": 2,
        "cooldown": 15,
        "order": 2
      },
      {
        "name": "Heaven's Vengeance",
        "description": "Attacks the target and its nearby enemies 6 times, dealing up to 67756 M.DMG. 500 additional Crit Chance applies to this Skill. Hit targets are blinded for 6 sec and take 25% increased All DMG for 10 sec.",
        "mana": 3,
        "cooldown": 22,
        "order": 3
      },
      {
        "name": "Goddess Grace",
        "description": "Reduces All DMG taken by 15%. At the beginning of each battle, and every 15 sec, increases M.DEF of 1 ally with the lowest HP by 10918 for 10 sec and heals HP of the target by 15% for the duration on Skill.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 86,
    "name": "Gau",
    "description": "Gau is a powerful warrior from the Barbarian Kingdom. Whenever he swung his twin axes, a bloodbath would follow. As a warrior, he was feared for his peerless ferocity. However, he suddenly disappeared for 10 years. When he returned, he was a completely changed man. His violent Barbarian tendencies were all gone, even when others criticized him. Instead, he now faces them with smiles and jolly laughter. The kind, warm gaze he now shows to children and animals is especially surprising.",
    "type_dmg": "Physical",
    "slug": "gau",
    "role_id": "warrior",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1449520,
        "ATK": 22488,
        "P.DEF": 7328,
        "M.DEF": 8792
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Penetration": 150,
        "ACC": 100,
        "P.Dodge": 100,
        "M.Dodge": 100,
        "CC Resist": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Smash",
        "description": "Deals 230826 P.DMG to enemies within range, and the first attack knocks them down for 3 sec and reduces DEF Penetration by 250 for 10 sec.",
        "mana": 2,
        "cooldown": 8,
        "order": 1
      },
      {
        "name": "Battle Roar",
        "description": "Dispels negative effects from all allies, increases their ATK by 49866, ATK Spd by 300, and P.DEF by 16622 for 15 sec.",
        "mana": 2,
        "cooldown": 12,
        "order": 2
      },
      {
        "name": "Vortex",
        "description": "Charges to the front, dealing 606876 P.DMG over 12 times to nearby enemies within circular range of self and draws them in during casting. While using this Skill, gains immunity to CC, and the last attack freezes the enemy for 4 sec.",
        "mana": 3,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Enrage",
        "description": "Increases own ATK by 3792, CC Resist by 30, and DMG dealt to Non-Hero enemies by 1.5% every sec. This effect can be stacked up to max 20 times. At 20 stacks or more, increases DMG of normal attacks by 100%.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 87,
    "name": "Gladi",
    "description": "The man who conquered the Orvel Arena. Sitting on the throne of the champion, he is often feared by others. People refer to him as Beast Fist. However, he is actually a cheerful man with a positive and straightforward personality. As reflected by his fighting style, he is a bold man who does not hesitate to act upon his will. After his conquest, Gladi requested the right to run an Arena Shop. Supposedly, his real goal was to gain a monopoly on silvervines. It still remains a mystery as to who will actually buy these plants, but he seems happy enough. Curiously enough, he's currently not even selling any silvervines.",
    "type_dmg": "Physical",
    "slug": "gladi",
    "role_id": "assassin",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1384992,
        "ATK": 24688,
        "P.DEF": 7816,
        "M.DEF": 6840
      }
    ],
    "add_stats": [
      {
        "Crit": 200,
        "Crit DMG": 30,
        "ACC": 100,
        "P.Dodge": 200,
        "M.Dodge": 200,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Quick Strikes",
        "description": "Strikes the target 7 times, dealing a total of 522900 P.DMG. The last hit increases the target's P.DMG taken by 25% for 10 sec.",
        "mana": 2,
        "cooldown": 9,
        "order": 1
      },
      {
        "name": "Advent of the War God",
        "description": "Dispel all negative effects on self and deal 235546 P.DMG to nearby enemies within a small radius, gaining the Status 'War God' for 10 sec. While in War God mode, ATK is boosted by 36329 and all auto attacks have a 30% chance to consume 5% mana to deal an extra attack of 129987 extra P.DMG. Upon taking M.DMG, dodge all M.DMG for 1 sec. Dodge effect only activates 1 time in every 2 sec.",
        "mana": 1,
        "cooldown": 15,
        "order": 2
      },
      {
        "name": "Ultimate Punch!",
        "description": "Charges energy and sprints toward frontal enemies, dealing 544060 P.DMG to enemies in range and inflicting stun for 3 sec. If the target is a boss, attack ignores target DEF.",
        "mana": 4,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "This will hurt!",
        "description": "Upon hitting a single target with 5 auto attacks, deals 65548 extra DMG that ignores DEF.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 88,
    "name": "Glenwys",
    "description": "If you ask the citizens of the Empire to pick a knight that they love the most, Glenwys's name will be on the top of the list. She is a Vice Captain in Empire Capital Guard Knights, the highest post taken by a knight with a background as a commoner. With her fierce combat skills along with her modesty and strong sense of responsibility, being a knight is her calling of life. There's no doubt that Glenwys is the hope for all commoners of the Empire, considering that she earned her way to the position of Vice Captain and that she won the 3 fighting tournaments that the Emperor held himself. As a symbol of the belief that anyone with skills can achieve success in the Empire, she is receiving a lot of attention from many.",
    "type_dmg": "Physical",
    "slug": "glenwys",
    "role_id": "knight",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1706672,
        "ATK": 19792,
        "P.DEF": 8792,
        "M.DEF": 6840
      }
    ],
    "add_stats": [
      {
        "Crit": 50,
        "P.Block": 100,
        "M.Block": 100,
        "P.Tough": 250,
        "M.Tough": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "That Is It",
        "description": "Deals a total of 118440 P.DMG over 7 attacks to frontal enemies. Each attack increases P.DMG the enemies take by 4% for 10 sec. This effect stacks up to max 7 times. Deals additional 256249 P.DMG to Non-Hero target.",
        "mana": 2,
        "cooldown": 9,
        "order": 1
      },
      {
        "name": "I Will Not Stay My Hand",
        "description": "Deals 278980 P.DMG over 10 attacks to nearby enemies in a circular range of self and stuns them for 1 sec. The final attack deals 87473 P.DMG to frontal enemies and stuns them for 3 sec.",
        "mana": 3,
        "cooldown": 15,
        "order": 2
      },
      {
        "name": "Time For Counterattack",
        "description": "Calling upon the strength of the Imperial Shield, deals 269079 P.DMG to nearby enemies in a large circular range of self and knocks them down for 3 sec. Dispels negative effects from all allies, increases ATK by 22559 for 20 sec, and increases DEF by 10211.",
        "mana": 4,
        "cooldown": 17,
        "order": 3
      },
      {
        "name": "Pride of Imperial Knights",
        "description": "Increases ATK of all allies by 8307. At the beginning of each battle, increases DMG to Non-Hero enemies by 10% for 20 sec, reducing DMG received by 10%.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 95,
    "name": "Gremory",
    "description": "The goddess of destruction and chaos, Lea, took a portion of herself aside and shaped it into the beings called the Primal Demons to bring an everlasting end to the cycle. Gremory was the very first fragment to be born as the incarnation of disaster. She has been an unintentional contributor to keeping the peace of the Material World to this day. It was a great stroke of luck for all living creatures that this great Demon, who could create terrible calamities with a single gesture, was so lazy - for she took a completely different course of action from what Lea, who wished to bring an end to the cycle, had originally planned. Gremory wasn't interested in ending some cycle. There was no reason for her to become embedded in the cogwheels of the cycle, not when she had finally obtained a brand-new consciousness and life. Besides, the Material World contained many attractions, like fluffy blankets, exciting snacks and endless amounts of delightfully creative works. These irresistible temptations made Gremory, who was a slacker to her bones, become even lazier. To this day, she puts her small body, formed in a way to make moving around easier, on a comfy sofa and mumbles to herself. 'Work...? Sure, I'll do it... Right after the sequel of Deadly Sweet Laughning Strike Force comes out...'",
    "type_dmg": "Magic",
    "slug": "gremory",
    "role_id": "assassin",
    "position": "Middle",
    "base_stats": [
      {
        "Max HP": 1384992,
        "ATK": 24688,
        "P.DEF": 7816,
        "M.DEF": 6840
      }
    ],
    "add_stats": [
      {
        "Crit": 200,
        "Crit DMG": 30,
        "ACC": 100,
        "P.Dodge": 200,
        "M.Dodge": 200,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Pochi, bite them!",
        "description": "Attacks an enemy 5 times, dealing 88995 M.DMG and inflicting [Pochi's Mark] each hit. The M.DMG of each hit increases by 15% per every stack of [Mana Charge]. [Pochi's Mark] reduces target's ATK by 6% for 15 sec, and it can be stacked up to max 5 times. If the target is a Boss, each hit deals 115492 additional M.DMG. The additional M.DMG increases by 30% per every stack of [Mana Charge]. This skill is sealed after use.",
        "mana": 3,
        "cooldown": 999,
        "order": 1
      },
      {
        "name": "Puchi, knock them away!",
        "description": "Attacks the farthest enemy from behind, dealing 225218 M.DMG. Afterward, inflicts Stun for 5 sec and [Puchi's Mark] on the target. [Puchi's Mark] reduces the target's M.Block Chance by 500 for 12 sec. This skill is sealed after use.",
        "mana": 3,
        "cooldown": 999,
        "order": 2
      },
      {
        "name": "Pippi, wrap them!",
        "description": "Deals a total of 560040 M.DMG over 10 times to the target and the enemies within a large are around the target, inflicting [Pippi's Mark] on hit target each hit. If this Skill deals DMG to a target inflicted with 10 stacks of [Pippi's Mark], each hit deals 39795 additional M.DMG that ignores DEF. [Pipi's Mark] increases M.DMG the target takes by 5% for 12 sec, and it can be stacked up to max 10 times. This Skill is sealed after use.",
        "mana": 4,
        "cooldown": 999,
        "order": 3
      },
      {
        "name": "Eh, wahtever. I'm gonna sleep.",
        "description": "Available once all Skills are sealed. Upon use, dispels CC effects from self. While in use, Gremory gains immunity to CC, takes 40% reduced All DMG, and unlocks all of her sealed Skills. Every time she uses [Eh, whatever. I'm going to sleep.], she gains a [Mana Charge] stack. Each [Mana Charge] stack increases Gremory's DMG dealt to enemies by 2%. [Mana Charge] can be stacked up to max 5 times and is irremovable.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 89,
    "name": "Hanus",
    "description": "Hanus was only 13 when the Guild Allied Forces recruited her. She is known as the legendary girl who was also called as the little giantess of the battlefield. As the daughter of the guild master of a weapon guild, Hanus used to play with discarded firearms and blades when she was young. This is when the others discovered her ingenuity in arms. The Guild Alliance decided that they cannot allow such profound talent to go to waste. The Alliance, after barely managing to convince Hanus' father who fiercely disagreed with the Alliance's decision, recruited her. Hanus was trained along with other soldiers, and just as the Guild had expected, she displaced her talent on battlefield. Hanus' revolutionary weapons were ridiculously strong enough to shift the paradigm of warfare. Her craftmanship, combined with her masterful tactics, marked the birth of an ultimate soldier of the Allied Forces. Moreover, Hanus herself vastly enjoyed her life in the army, as she could utilize her handcrafted weapons to their fullest. However, great talent meant more demands and battles to fight. During an operation, Hanus ended up being wounded. Upon hearing this news about her daughter's injury, Hanus' father who detested seeing his daughter in the army ever since the early days, raised his voice against the Alliance, and strongly demanded her daughter to be discharged from service at once. However, as people say, no parents are strong enough to bend their child's will. Hanus, who would rather die than be discharged from service, persistently persuaded her father. In the end, she managed to get her father's approval, under the condition that she stays in the military only as an instructor that doesn't participate in battles. Currently, Hanus thinks that her life as an instructor is not too bad at all, but deep inside, she still yearns to return to battlefields. Inside the Command Center, she silently awaits for the day when she will finally stand on the battlefield with comrades whom she taught.",
    "type_dmg": "Physical",
    "slug": "hanus",
    "role_id": "mechanic",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 1157176,
        "ATK": 25416,
        "P.DEF": 5376,
        "M.DEF": 4392
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Crit DMG": 50,
        "Penetration": 100,
        "ACC": 200,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "I See Through Your Every Move!",
        "description": "Throws a grenade, and fires a submachine gun, dealing 235543 P.DMG to the target and the enemies nearby. Hanus gains 20 Ammo afterward. Hit enemies take 25% increased P.DMG for 10 sec, and are blinded for 4 sec. Ammo can be stacked up to max 300 times.",
        "mana": 2,
        "cooldown": 12,
        "order": 1
      },
      {
        "name": "Shoot You Full of Holes!",
        "description": "Shoots a machine gun 10 times to frontal enemies in a wide area, dealing a total of 194520 P.DMG. Afterwards, if Hanus is possessing Ammo, she consumes 2 Ammo per shot to attack enemies until she runs out of Ammo. While in this state, Hanus takes 25% additional DMG. Every 1 st shot increases DMG of this Skill by 8%. The DMG Boost effect can be stacked up to max 50 times.",
        "mana": 3,
        "cooldown": 14,
        "order": 2
      },
      {
        "name": "Hide If You Can!",
        "description": "Fires a mortar at a frontal area, dealing 363918 P.DMG in a wide area. Hanus gains 50 Ammo afterwards. Hit enemies are stunned for 5 sec. This Skill ignores target's P.Block and M.Block.",
        "mana": 4,
        "cooldown": 27,
        "order": 3
      },
      {
        "name": "I Shall Train You Hard!",
        "description": "Hanus is not affected by ATK Spd effects, and increases ATK of all allies by 17811 + 5% of Hanus' ATK. If activated during Guild battles, this effect is amplified by 2 times. [Guild Battle] - Guild Raid, Guild Conquest, Guild War",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 92,
    "name": "Hilda",
    "description": "Project: Brunhild started long ago in the early ages of the Technomagic Kingdom by the royal family, who feared the coming of the cycle's end. The first step of the project was to make a vessel that could contain the authority of god so that they could create 'an imitation god would do the bidding of the humans.'\nThough they created various synthetic Demon Beasts, Golems, and even humans, every one of their subjects failed to retain their form and ended up falling to pieces. The scientists of the research facility turned their attention to the powerful beings called 'Transcendants,' who were already close to the source. With the data of the Transcendants gathered by the kingdom, the scientists created Hilda, an artifical Transcendant.\nHilda was simply a tool to create a new world; her purpose was to escapoe the cycle and destroy the current rules. She existed only as a 'weapon' to oppose the current goddess and therefore was not granted a personality or a will of her own. She spend her entire life in a deep slumber, except when she was undergoing adjustment to prepare her for the title of god or when she was being brainwashed to think a certain way, starting from a cold test tube and later locked up in the research facility.\nTrapped in an endless cycle of sleeping and waking up, Hilda chose to accept her identity as aweapon to protect her sanity instead of trying to learn names of her emotions. Project: Brynhild was shut down right before the completion of the new god. Itwas none other by command of the new ruler of the kingdom, Siegfried Felix Liesnel...",
    "type_dmg": "Magic",
    "slug": "hilda",
    "role_id": "warrior",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1449520,
        "ATK": 22488,
        "P.DEF": 7328,
        "M.DEF": 8792
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Penetration": 150,
        "ACC": 100,
        "P.Dodge": 100,
        "M.Dodge": 100,
        "CC Resist": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Void Whirlwind",
        "description": "Deals a total of 302832 M.DMG over 12 hits to frontal enemies. Each hit reduces the targets Mana by 150.",
        "mana": 3,
        "cooldown": 18,
        "order": 1
      },
      {
        "name": "Transcendant",
        "description": "Dispels negative effects from self and deals 93166 M.DMG to all enemies, entering [Transcendant] state and enhancing normal attacks. During [Transcendant] state, Hilda cannot use Skills, gains immunity to CC, and her normal attacks inflict [Void] stacks that can be stacks up to max 20 times on the target. Hilda also reduces Heal Rate of nearby enemies within circular range by 30%, and consumes own mana by 100 every sec. The mana consumption gradually increases over time, and [Transcendant] state deactivates upon consuming all Mana or using a Skill.",
        "mana": 3,
        "cooldown": 8,
        "order": 2
      },
      {
        "name": "Deactivate Transcendant",
        "description": "Deactivates [Transcendant] and applies 8 sec Cooldown to the [Transcendant] Skill. This skill activates automatically upon consuming all Mana.",
        "mana": 0,
        "cooldown": 0,
        "order": "2_2"
      },
      {
        "name": "Void Strike",
        "description": "Deals 332668 M.DMG to frontal enemies within circular range of self and knocks them down for 3 sec. Upon hitting an enemy inflicted with [Void], consumes all Void stacks from the target and deals 13762 additional M.DMG per stack",
        "mana": 4,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Void Frenzy",
        "description": "Increases ATK by 42740, applies all Mana recovery at 50% higher, and increases DEF Penetration by 100 per orb of Mana Hilda has. At max Mana, Hilda enters [Void Frenzy] state for 10 sec. For the duration, self's all attacks ignore Block effects of enemies and fixes the DEF Penetration boost per Mana orb to 1000. [Void Frenzy] state has a Cooldown of 15 sec.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 93,
    "name": "Isolet",
    "description": "A witch who's associated with Pandora. Scarred by the dark side of the Empire that encourages scrificing small for the greater good, Isolet's mind delved deeper into the abyss as she directly faced the ambivalenve of the Empire. Isolet is equipped with great knowledge which she gained from being a witch, truths of the world she found out in secret, and the great power granted to her by Pandora. Carrying a deep feeling of loss in her heart, Isolet wields her weapon and proceeds to the execution site to punish the hypocrites who oppress the weak. Her elemental spells have become more powerful through the mechines Pnadora gave her. She is also among the few people who can provide a large amount of Mana to the hearts of Pandora's automata to make them do her bidding. Both the Empire and Pandora desire Isolet for her invaluable knowledge and power. Whenever she reminisces about the Witch Association, which is her family and her hime, her eyes tend to soften. But the bloody path she has walked as the executioner of Pandora binds her with its cold chains.",
    "type_dmg": "Physical",
    "slug": "isolet",
    "role_id": "wizard",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 985328,
        "ATK": 29328,
        "P.DEF": 3904,
        "M.DEF": 5864
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "Penetration": 150,
        "ACC": 100,
        "M.Dodge": 200,
        "M.Block": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Devouring Flame - Caienne",
        "description": "Deals 171674 P.DMG to frontal enemies and inflicts them with [Ignite]. Enemies inflicted with [Ignite] have their Heal Rate reduced by 25% for 7s.",
        "mana": 2,
        "cooldown": 7,
        "order": 1
      },
      {
        "name": "Frost of Absolute Zero - Devion",
        "description": "Deals a total of 340735 P.DMG to frontal enemies over 5 times, freezing the targets for 3 sec each hit. Dealing DMG to an enemy inflicted by [Ignite] creates [Explosive Reaction] that deals 57430 additional DMG that ignores DEF.",
        "mana": 3,
        "cooldown": 15,
        "order": 2
      },
      {
        "name": "Raging Storm - Icarus",
        "description": "Deals 40422 P.DMG each hit over 20 times to frontal enemies for 10 sec, reducing ATK of targets by 15% for 10s. Upon dealing DMG to an enemy inflicted with [Ignite], the Skill changes to [Blazing Storm], dealing 80853 P.DMG and reducing enemy’s Heal Rate by 1.5% for 60 sec each hit. This effect can be stacked up to max 30 times.",
        "mana": 4,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Quintessence of Technomagic",
        "description": "Isolet’s ATK Spd is fixed to 1000 and she is not affected by Skill Cooldown Reduction effects, by she recovers 1500 Mana and increases her Crit DMG by 100% every time she uses a Skill. When she creates [Explosive Reaction], her ATK increases by 4%. This effect can be stacked up to max 15 times and is irremovable. When she creates [Blazing Storm], M.DMG all allies take is reduced by 7%. This effect can be stacked up to max 3 times and is irremovable.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 23,
    "name": "Jane",
    "description": "She was once the princess of the fallen Republic of Gray. The Republic of Gray, wiped off the map by the Demon invaders during the Demon War, was the protector of countless secrets, including the ruins and technologies of an ancient civilization. Jane, too, lost her life to protect those secrets. Later, she was brought back to the world as an undead by Malduk, a high-ranking officer and a strategist of the Demon Army. She was given a new consciousness by a strange, dark magic. Now, she seeks to go on a journey to find her past self and her lost memories.",
    "type_dmg": "Magic",
    "slug": "jane",
    "role_id": "knight",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1706672,
        "ATK": 19792,
        "P.DEF": 8792,
        "M.DEF": 6840
      }
    ],
    "add_stats": [
      {
        "Crit": 50,
        "P.Block": 100,
        "M.Block": 100,
        "P.Tough": 250,
        "M.Tough": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Funeral Rites",
        "description": "Deals 140671 M.DMG to enemies in range, stunning them for 3 sec.",
        "mana": 2,
        "cooldown": 8,
        "order": 1
      },
      {
        "name": "Mark of Death",
        "description": "Engraves a Mark on all enemies for 30 sec and deals 105060 M.DMG over time. Enemies engraved with Mark takes 25% more M.DMG.",
        "mana": 1,
        "cooldown": 6,
        "order": 2
      },
      {
        "name": "Day of Ruin",
        "description": "For 15 sec, deals a total of 41280 M.DMG to all enemies and recovers 100% of DMG as own HP. Gains immunity to CC. Marked enemies take increased DMG.",
        "mana": 3,
        "cooldown": 12,
        "order": 3
      },
      {
        "name": "Rest in Peace",
        "description": "Upon taking a deathblow, enters a coffin for 5 sec and heals 463206 + 6% of Max HP. Gains immunity to all DMG while inside the coffin.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 24,
    "name": "Juno",
    "description": "She's an ordinary young lady from the town, but her culinary skills are Orvel's finest. From the plain, wholesome food of the common people to the luxurious delicacies of the nobility, there isn't a dish she cannot cook. She once received an offer to work as the Royal Chef, but she refused it and opened an inn to let everyone enjoy her dishes. Her inn soon became one of the most famous attractions in Orvel, visited by countless adventurers. Now people call her inn 'the Hero's Inn,' and she's enjoying her life among the 'heroes.'",
    "type_dmg": "Physical",
    "slug": "juno",
    "role_id": "priest",
    "position": "Middle",
    "base_stats": [
      {
        "Max HP": 1104864,
        "ATK": 23216,
        "P.DEF": 4888,
        "M.DEF": 6104
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "ACC": 100,
        "M.Block": 500,
        "M.Block DEF": 250,
        "M.Tough": 150,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Best Dish",
        "description": "Removes negative effects from all allies, heals a total of 461902 HP over 7 second(s), and increases DEF by 9022. When there are 2 stacks or more [Excellent Ingredient], consumes 2 stacks to double the DEF Boost.",
        "mana": 2,
        "cooldown": 12,
        "order": 1
      },
      {
        "name": "Juno's Spicy Special",
        "description": "Removes positive effects from all enemies, deals a total of 764220 P.DMG over 10 second(s), and enemies take 20% increased P.DMG. When there are 2 stacks or more [Excellent Ingredient], consumes 2 stacks to double the P.DMG that enemies take.",
        "mana": 2,
        "cooldown": 9,
        "order": "1_2"
      },
      {
        "name": "Power-up",
        "description": "Casts a shield on the ally with the lowest HP that absorbs 672692 DMG and grants Immunity to CC along with 1 orb of Mana. When there are 2 stacks or more [Excellent Ingredient], consumes 2 stacks to double the Mana Recovery.",
        "mana": 3,
        "cooldown": 15,
        "order": 2
      },
      {
        "name": "Help Yourself, Then Get Lost!",
        "description": "Attacks the target and nearby enemies around it, dealing 278279 P.DMG and reducing their Mana by 1 orb. If the target is not a Hero, inflicts 367178 additional P.DMG that ignores DEF. When there are 2 stacks or more [Excellent Ingredient], consumes 2 stacks to double the Mana Reduction.",
        "mana": 2,
        "cooldown": 8,
        "order": "2_2"
      },
      {
        "name": "Cook from Hell",
        "description": "Removes all negative effects from self, heals 81783 HP, and transforms into a Cook from Hell. [Best Dish] and [Power-up] are changed to [Juno's Spicy Special] and [Help Yourself, Then Get Lost!] respectively. Gains 1 stack of irremovable [Excellent Ingredient]. When the skill is used again, transforms into a Cook from Heaven.",
        "mana": 1,
        "cooldown": 6,
        "order": 3
      },
      {
        "name": "Open for Business!",
        "description": "While transformed into a Cook from Heaven, increases DEF of all allies by 6644 and their heal rate by 15%. While transformed into a Cook from Hell, reduces DEF of all enemies by 10% and their heal rate by 20%.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 25,
    "name": "Kara",
    "description": "A human-type Golem that was made with ancient technomagic, but her appearance is just like that of a human girl. But she's an ancient weapon that has no feelings and was just made to be a tool. She was asleep in the ruins of an ancient civilization, deep underground in Galluah Plains. She was excavated by Annette, a technomagi in the Kingdom of Orvel, during her research and awakened in a new era with a new civilization...",
    "type_dmg": "Magic",
    "slug": "kara",
    "role_id": "mechanic",
    "position": "Middle",
    "base_stats": [
      {
        "Max HP": 1157176,
        "ATK": 25416,
        "P.DEF": 5376,
        "M.DEF": 4392
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Crit DMG": 50,
        "Penetration": 100,
        "ACC": 200,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Anti-personnel Laser",
        "description": "Attacks the target 4 times, dealing a total of 302976 M.DMG and inflicting knockback. Attacks all enemies with the last blow, dealing 151496 M.DMG and blowing them away for 3 seconds.",
        "mana": 2,
        "cooldown": 8,
        "order": 1
      },
      {
        "name": "Siege Laser",
        "description": "Attacks the target inflicting 483353 M.DMG. Crit DMG is applied 200% higher.",
        "mana": 3,
        "cooldown": 11,
        "order": "1_2"
      },
      {
        "name": "Wide-area Cannon",
        "description": "Attacks a random target and nearby enemies in range 4 times, inflicting a total of 345276 M.DMG and stunning them for 4 seconds.",
        "mana": 4,
        "cooldown": 14,
        "order": 2
      },
      {
        "name": "Focused Fire",
        "description": "Attacks a random target 15 times, inflicting a total of 331920 M.DMG, and inflicts Focused Fire for 20 seconds. Inflicts 737 extra M.DMG with each stack of Focused Fire on the enemy. Focused Fire can be stacked up to 30 times.",
        "mana": 4,
        "cooldown": 22,
        "order": "2_2"
      },
      {
        "name": "Release Siege Weapon",
        "description": "Kara turns into Siege Weapon mode and attacks the enemy, inflicting 35517 M.DMG with each hit. When in Siege Weapon mode, changes Anti-personnel Laser and Wide-area Cannon skills to Siege Laser and Focused Fire skills. When the skill is used again, returns to Anti-personnel Weapon mode.",
        "mana": 2,
        "cooldown": 0,
        "order": 3
      },
      {
        "name": "Essence of Technomagic",
        "description": "While in [Anti-personnel Weapon] mode, increases All DEF by 28729, and while in [Siege Weapon] mode, increases DMG against bosses by 25%, takes 30% increased DMG from enemies, and gains immunity to CC. Dealing DMG to an enemy recovers 70 Mana each hit.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 26,
    "name": "Kasel",
    "description": "A squire of the Kingdom of Orvelia. Traumatized by witnessing the deaths of his parents at the hands of the Demons invading the village, and later, the assassination of his sword teacher, he fears the idea of anyone around him dying. His past has driven him to seek out his sworn brother from his early years in the orphanage, Clause, who joined an expedition, but never returned.",
    "type_dmg": "Physical",
    "slug": "kasel",
    "role_id": "warrior",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1449520,
        "ATK": 22488,
        "P.DEF": 7328,
        "M.DEF": 8792
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Penetration": 150,
        "ACC": 100,
        "P.Dodge": 100,
        "M.Dodge": 100,
        "CC Resist": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Judgment Blade",
        "description": "Deals 202500 P.DMG 2 times to frontal enemies in a circle and knocks them down for 2.5 sec.",
        "mana": 3,
        "cooldown": 12,
        "order": 1
      },
      {
        "name": "Valiant Dash",
        "description": "Attacks the target 3 times, and then charges behind them to deal 265089 P.DMG.",
        "mana": 2,
        "cooldown": 8,
        "order": 2
      },
      {
        "name": "Proxy of God",
        "description": "Deals 75830 P.DMG to nearby enemies and inflicts Stun for 3 sec. Additionally, for 20 sec, ATK is increased by 52244 and Dodge Rate is increased by 250 , while gaining immunity to CC. This status cannot be dispelled.",
        "mana": 4,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Goddess Strike",
        "description": "Increases own All DEF by 9737 , and Dodge Chance by 200. A successful dodge increases DMG of normal attacks by 50% for 5 sec.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 27,
    "name": "Kaulah",
    "description": "This great Orc shaman wields the power of lightning. He is the chieftain of the Skywind Tribe and a respected elder of the Orc Alliance. He has trained countless Orc shamans and is considered their spiritual leader. He is also one of the few shamans who has clairvoyant dreams, and he is wise enough to properly interpret them.",
    "type_dmg": "Magic",
    "slug": "kaulah",
    "role_id": "priest",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 1104864,
        "ATK": 23216,
        "P.DEF": 4888,
        "M.DEF": 6104
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "ACC": 100,
        "M.Block": 500,
        "M.Block DEF": 250,
        "M.Tough": 150,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Thunderbolt",
        "description": "Attacks a random enemy 5 times, dealing 284155 M.DMG each hit and inflicting Electric Shock. If the target is already inflicted with Electric Shock, inflicts Stun for 3 sec.",
        "mana": 3,
        "cooldown": 10,
        "order": 1
      },
      {
        "name": "Healing Rain",
        "description": "Heals 734550 HP of all allies over 5 times. For the duration of Skill, Kaulah gains immunity to CC and takes 50% reduced All DMG.",
        "mana": 2,
        "cooldown": 11,
        "order": 2
      },
      {
        "name": "Swift Wind",
        "description": "For 15 sec, increases all allies' ATK by 40844, ATK Spd by 350, and Crit Chance by 350.",
        "mana": 4,
        "cooldown": 15,
        "order": 3
      },
      {
        "name": "Chain Lightning",
        "description": "Deals 66669 M.DMG to 4 enemies every 15 sec, inflicts Electric Shock for 20 sec, and stuns them for 1 sec upon a Critical Hit. Enemies under Electric Shock take a total of 116080 M.DMG over 20 sec. For every enemy under Electric Shock, Kaulah takes 15% reduced DMG. This effect can be stacked up to max 3 times and is irremovable.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 28,
    "name": "Kibera",
    "description": "Kibera is a cheerful wielder of demonic swords who hails from the East. Other than the fact that he's from the East, the only other thing known about Kibera is that he likes cheap food despite his noble and dashing appearance, he's a skilled swordsman, and that he is abnormally obsessed with demonic swords. Anyone with common sense would stay away from demonic swords as they are afraid of the curse and tragedies the 'evil power within these swords could bring upon. However, unphased by this so-called evil power, Kibera rather casually picks up these cursed demonic swords with no hesitation. Whenever Kibera comes across a fine demonic sword, his eyes blaze with desire as if he's declaring that he will seize the sword no matter what, This abnormal possession of trying to acquire a sword, even risking his very own life with no regard to gains or loss, has made people avoid him altogether because it feels like he's a possessed spirit of a sword.",
    "type_dmg": "Magic",
    "slug": "kibera",
    "role_id": "assassin",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1384992,
        "ATK": 24688,
        "P.DEF": 7816,
        "M.DEF": 6840
      }
    ],
    "add_stats": [
      {
        "Crit": 200,
        "Crit DMG": 30,
        "ACC": 100,
        "P.Dodge": 200,
        "M.Dodge": 200,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Mm, You Better Pay Attention!",
        "description": "Attacks an enemy 11 times, dealing a total of 143787 M.DMG. Afterward, summons a [Dark Whirlpool] for 4 sec that attack the target and nearby enemies 8 times, dealing a total of 166384 M.DMG. If Nocturnal Demonic Sword, [Night Sky] is selected, DMG of self's normal attacks increases by 50% and each normal attack reduces Cooldown of this Skill by 0.5 sec.",
        "mana": 2,
        "cooldown": 10,
        "order": 1
      },
      {
        "name": "Heh, Let's Have Some Fun!",
        "description": "Dispels all negative effects from self and turns into [Show Dominion] state for 5 sec. While in [Shadow Dominion] state, ATK is increased by 75992 and HP does not fall below 10%. After Skill use, [Ha! Full of Openings!] can be used within 5 sec. If Umbral Demonic Sword, [Dark Shadow] is selected, the Mana Cost of this Skill is reduced by 1.",
        "mana": 2,
        "cooldown": 15,
        "order": 2
      },
      {
        "name": "Ha! Full of Openings",
        "description": "Moves to the back of the enemy with the highest ATK, marking the target with [Dark Corrosion] and reducing the ATK Spd of the marked target by 400 for 10 sec. Kibera's attacks will prioritize the marked target. If [Umbral Demonic Sword, Dark Shadow] is selected, enemies inflicted with [Dark Corrosion] cannot receive positive effects, and have their Mana reduced by 250 every 1 sec.",
        "mana": 0,
        "cooldown": 0,
        "order": "2_2"
      },
      {
        "name": "Say Hello to Death!!",
        "description": "Sticks [Darkslayer Demonic Sword, Veil] into the ground, creating a shockwave that deals 332027 M.DMG to nearby enemies in a circular range of self and inflicts Stun for 5 sec. Afterward, for 10 sec, unloads [Dark Thunder] to a random enemy every 2 sec, dealing 58827 M.DMG and inflicting Stun for 0.5 sec. If Darkslayer Demonic Sword, [Veil] is selected, the Mana Cost of all Skills increases by 1, but DMG inflicted by this Skill will ignore DEF and the Heal Rate of enemies hit by [Dark Thunder] will be reduced by 50% for 5 sec.",
        "mana": 3,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Three Demonic Swords",
        "description": "At the beginning of the first Battle, Kibera can select a demonic sword. He gains immunity to CC until he selects his sword, but he cannot recover mana during that period. Once he selects a sword, his stats and the effect of a skill will be enhanced depending on the selected sword. Nocturnal Demonic Sword, [Night Sky] - Increases ATK Spd by 300 and enhances the effect of [Mm, You Better Pay Attention]. Umbral Demonic Blade, [Dark Shadow] - Increases DEF by 18992 and enhances the effect of [Heh, Let's Have Some Fun!] and [Ha! Full of Openings]. Darkslayer Demonic Sword, [Veil] - Increases ATK by 28496 and enhances the effect of [Say Hello to Death!!].",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 29,
    "name": "Kirze",
    "description": "Few years ago, small towns all over Orbis were attacked by the undead army of Malduk. They were seeking out albino kids, ones who were born with unique and powerful magic. Malduk's subordinates captured these children, and injected them with crimson arcane crystals, a powerful energy source for Demons. The goal of this experiment was to transform them into crimson arcane crystal living mines - that would mass produce crimson arcane crystals until the moment they die. Pain from the inhumane experiment took its toll on the children and one by one, losing their lives. Children who weren't compatible with the crimson arcane crystal were petrified and crumbled into dust. The remaining children who witnessed this horror were shaking with fear, and hopelessly awaited their death. But the experiment finally came to a success. Crimson arcane crystals resonated with Kirze, and she absorbed all the crystals in the area. As a result, she gained vast amount of mana and gained ability to manipulate crimson arcane crystals at her will. With her new found power, Kirze defeated Malduk's subordinates and fled from the lab with the surviving children. In the hopes of preventing further casualties like herself, Kirze took off and began to hunt rouge demons that crossed her path...",
    "type_dmg": "Magic",
    "slug": "kirze",
    "role_id": "warrior",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1449520,
        "ATK": 22488,
        "P.DEF": 7328,
        "M.DEF": 8792
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Penetration": 150,
        "ACC": 100,
        "P.Dodge": 100,
        "M.Dodge": 100,
        "CC Resist": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Slash, Blade of Judgment!",
        "description": "Deals a total of 127673 M.DMG over 7 attacks to nearby enemies in a circular range of self. Then, attacks frontal enemies in range, dealing 189305 M.DMG and knocking them down for 3 sec.",
        "mana": 2,
        "cooldown": 9,
        "order": 1
      },
      {
        "name": "Disperse, Crystal Haze!",
        "description": "Unleashes the power of Arcane Crystals within to deal 93166 M.DMG to all enemies and stun them for 2 sec. Upon casting, activates [Arcane Crystal Awakening] for 15 sec, which increases ATK Spd of all allies by 300 and releases a shockwave every 2 sec to enemies in range of self, dealing 102251 M.DMG and stunning them for 1 sec.",
        "mana": 3,
        "cooldown": 17,
        "order": 2
      },
      {
        "name": "Bloom, Crimson Flower!",
        "description": "Summons Arcane Crystals and deals 172779 M.DMG to frontal enemies in a straight line. Shortly afterward, causes an explosion that deals 276243 additional M.DMG and inflicts [Arcane Crystal Curse] upon enemies for 5 sec, reducing their ATK Spd by 200. Attacking enemies under [Arcane Crystal Curse] inflicts a stack of [Arcane Crystal Energy]. [Arcane Crystal Curse] explodes after 5 sec, dealing M.DMG equal to 113842 + 9669 per stack of [Arcane Crystal Energy].",
        "mana": 4,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "End to Evil Deeds!",
        "description": "Increases own ATK by 75992 and Crit Chance by 200, while increasing the duration of CCs that all allies inflict to Bosses by 30%.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 30,
    "name": "Laias",
    "description": "This beautiful and gentle priestess of water is actually a morphed blue dragon. In the distant past, she was worshipped by certain desert tribes. However, she has been sleeping for ages for some unknown reason. She can command water to turn lands fertile, and she always used her powers to help her people. In return, the humans built the golden Shrine of Flow in her honor under the lake in the oasis. A flow of evil energy in the desert has awakened her from her sleep, and she has once again begun using her powers to help those around her.",
    "type_dmg": "Magic",
    "slug": "laias",
    "role_id": "priest",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 1104864,
        "ATK": 23216,
        "P.DEF": 4888,
        "M.DEF": 6104
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "ACC": 100,
        "M.Block": 500,
        "M.Block DEF": 250,
        "M.Tough": 150,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Healing Droplets",
        "description": "Heals HP of all allies by 275339 and reduces M.DMG they take by 15% for 5 sec. If the target's HP is below 50%, Heal Rate and the amount of reduced M.DMG the target takes increases by x 1.5.",
        "mana": 2,
        "cooldown": 8,
        "order": 1
      },
      {
        "name": "Bubble Shield",
        "description": "For 15 sec, casts a shield that blocks 989666 DMG on the ally with the lowest HP. While the shield is in effect, it grants Immunity to CC, increases the ATK by 35622 , and heals 39592 HP every sec for the ally.",
        "mana": 3,
        "cooldown": 15,
        "order": 2
      },
      {
        "name": "Festival of the Flow",
        "description": "Deals 236352 M.DMG to nearby enemies and knocks them down. All allies, excluding self, recovers 2 orbs of mana. Afterwards, for 12 sec, creates a whirlpool that deals 157578 M.DMG to random enemies and knocks them down for 2 sec.",
        "mana": 4,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Blessing of the Water Dragon",
        "description": "All allies' M.DEF is increased by 4748 , and M.Crit Hit Resistance is increased by 250.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 31,
    "name": "Lakrak",
    "description": "This eccentric albino Goblin enjoys developing powerful weapons more than anything else. Having been harassed and ostracized by other Goblins due to his skin color, he feels no compassion toward his kind. He would gladly shoot, blow up, and smash even a fellow Goblin to test his weapons. However, he also expresses his gratitude to those who help him, and this is how he became Roi's friend. Unfortunately, he is terrible at remembering faces, so he often tries to shoot Roi before he recalls who he is.",
    "type_dmg": "Physical",
    "slug": "lakrak",
    "role_id": "mechanic",
    "position": "Middle",
    "base_stats": [
      {
        "Max HP": 1157176,
        "ATK": 25416,
        "P.DEF": 5376,
        "M.DEF": 4392
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Crit DMG": 50,
        "Penetration": 100,
        "ACC": 200,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Rapid Fire",
        "description": "Attacks all frontal enemies in a straight line, dealing 265827 P.DMG and inflicting Stun for 3 sec. If the target is not a Hero, deals 127628 additional P.DMG. [Experiment Success!] Removes Cooldown.",
        "mana": 2,
        "cooldown": 8,
        "order": 1
      },
      {
        "name": "Smoke Bomb",
        "description": "Deals 159466 P.DMG to target and nearby enemies within range and inflicts them with [Explosive Material] for 10 sec, causing them to take 20% increased P.DMG and additionally inflicting Blind for 4 sec. [Experiment Success!] Dispels positive effects from enemies within range.",
        "mana": 2,
        "cooldown": 15,
        "order": 2
      },
      {
        "name": "Glue Bomb",
        "description": "Attaches a Glue Bomb to a random enemy that explodes in 3 sec to a random enemy, dealing 548169 P.DMG to the target and nearby enemies and inflicting Stun for 3 sec. If the target is inflicted with [Explosive Material], deals 359082 additional P.DMG. [Experiment Success!] Glue Bomb explodes immediately after attachment.",
        "mana": 2,
        "cooldown": 12,
        "order": 3
      },
      {
        "name": "Load Cannon",
        "description": "Normal attacks have a 15% chance of firing a bomb that deals 124195 P.DMG to enemies within range and inflicting Stun for 2 sec. After each Skill use, Lakrak conducts and experiment. The experiment has a 50% success rate. Upon success, enhances the effects of the next skill use. Experiment does not occur when Lakrak uses the enhanced Skill.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 32,
    "name": "Laudia",
    "description": "Trovatias are a nomadic tribe of Aegina Desert who inherited the tradition and religion of the ancient desert kingdom. Laudia is the daughter of the tribe leader and serves the Priestess of Water, Laias. She also looks after the tribe on behalf of her old father. When she prayed for help, God Dragon Laias and her sister Lilia woke up from their long sleep and led her and her tribe into the shrine, protecting them. Ever since, Laudia has been defeating demons in the desert with Zafir, the leader of the Mauhata tribe of Desert Warriors.",
    "type_dmg": "Magic",
    "slug": "laudia",
    "role_id": "assassin",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1384992,
        "ATK": 24688,
        "P.DEF": 7816,
        "M.DEF": 6840
      }
    ],
    "add_stats": [
      {
        "Crit": 200,
        "Crit DMG": 30,
        "ACC": 100,
        "P.Dodge": 200,
        "M.Dodge": 200,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Whisper of Sand",
        "description": "Attacks target enemy and deals 95775 M.DMG to enemies in close range, decreasing enemy block chance by 500 and Crit resistance by 500 for 8 sec. Additionally, attacks and deals 124518 M.DMG and stuns them for 3 sec.",
        "mana": 2,
        "cooldown": 11,
        "order": 1
      },
      {
        "name": "Enchanting Flow",
        "description": "Increases own ATK by 28496 and Crit DMG by 70% for 10 sec. Then moves a short distance forward, dealing 898838 M.DMG to enemies in movement range and Charms them for 5 sec if the skill was used in the Arena. Can activate [Alluring Ambush] once within 5 sec after use.",
        "mana": 2,
        "cooldown": 20,
        "order": 2
      },
      {
        "name": "Alluring Ambush",
        "description": "Attacks target enemy 3 times, dealing a total of 282705 M.DMG. Deals extra 133038 M.DMG ignoring the target's DEF to Boss enemies and enemies inflicted by Charm.",
        "mana": 1,
        "cooldown": 0,
        "order": "2_2"
      },
      {
        "name": "Dance of the Desert",
        "description": "Attacks enemies in range 30 times, dealing a total of 634410 M.DMG. Additionally throws the 'Blades of Arlaq' at random enemies 30 times, dealing a total of 427500 M.DMG. Extra 1900 DMG is stacked every time the blade hits the same enemy. [Blinding Acceleration] can be used once during skill activation, and the 'Blades of Arlaq' prioritize targets inflicted by Charm.",
        "mana": 2,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Blinding Acceleration",
        "description": "Gains immunity to CC for 3 sec and ATK Spd is increased by 800.",
        "mana": 1,
        "cooldown": 0,
        "order": "3_2"
      },
      {
        "name": "Blessing of Oasis",
        "description": "Decreases CC duration inflicted on self by 30%. Upon using a skill, gains [Blessing of Oasis] for 20 sec, increasing own Penetration by 30 and DEF by 1896. [Blessing of Oasis] can be stacked up to max 10 times and cannot be dispelled.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 33,
    "name": "Lavril",
    "description": "A very unconventional ghost. Those who see her may think of her as a ghost of an ordinary girl, but she's not a single spectral entity. Rather, she's an amalgamation of countless souls. Filled with tremendous spectral energy, she is powerful enough to make souls tremble and cast curses at her will....That is, if she was an ordinary ghost. Although she's a ghost born from an amalgamation of young souls that died in the Demon War 100 years ago, the souls of children are too pure and innocent to bear any grudge. Lavril, having been born from them, came into being with a pure and kind mind. Nonetheless, she's still a ghost. Her nature won't change. Even though she's currently a kind and poor girl, a child is like a piece of blank paper, in which a single drop of ink can easily change its color. Without any proper guidance, she can be a threat.",
    "type_dmg": "Magic",
    "slug": "lavril",
    "role_id": "priest",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 1104864,
        "ATK": 23216,
        "P.DEF": 4888,
        "M.DEF": 6104
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "ACC": 100,
        "M.Block": 500,
        "M.Block DEF": 250,
        "M.Tough": 150,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "G-go Away!",
        "description": "Deals 196114 M.DMG to the enemy and reduces its Crit Resistance by 300 for 10 sec. Hit enemies become affected by Lavril's Ectoplasm for 5 sec, taking 34728 M.DMG every 0.5 sec. Every time an enemy takes DMG from this skill, HP of all allies is healed by 5% of the DMG dealt.",
        "mana": 2,
        "cooldown": 10,
        "order": 1
      },
      {
        "name": "Bear Up...!",
        "description": "Heals the HP of an ally with the highest ATK by 318500 and heals additional 34194 HP every 1 sec for 15 sec. Increases Crit DMG of the ally by 50% + 15% of Lavril's Crit DMG for 15 sec. [You Scare Me...!] becomes available for 5 sec after casting this skill.",
        "mana": 4,
        "cooldown": 24,
        "order": 2
      },
      {
        "name": "You Scare Me...!",
        "description": "Deals 296540 M.DMG to the enemy and reduces its ATK Spd by 250 for 15 sec while increasing M.DMG it takes by 25%.",
        "mana": 1,
        "cooldown": 0,
        "order": "2_2"
      },
      {
        "name": "Leave Me Alone...!",
        "description": "Swirls a Spectral Tornado in a wide range to the front, dealing 73723 M.DMG every 0.5 sec for 5 sec. Each hit reduces ATK of hit enemies by 3% for 5 sec, and increases M.DMG they take by 3%. This effect can be stacked up to max 15 times.",
        "mana": 4,
        "cooldown": 25,
        "order": 3
      },
      {
        "name": "Together Forever...",
        "description": "At the beginning of the first battle, forms a Soul Link with an ally with the highest ATK. This effect cannot be dispelled. The ally bound by Soul Link has their ATK increased by 32055 and recovers 100 Mana every second.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 34,
    "name": "Leo",
    "description": "In the royal palace of Orvel, there exists a library that is said to be infinite in space. Leo is a Gnome who has been protecting this library for a very long time. Having memorized every book in the library, he is the most knowledgeable person in the entire palace, and many visit the library, seeking his wisdom. However, he still seems to have difficulty interacting with others.",
    "type_dmg": "Physical",
    "slug": "leo",
    "role_id": "priest",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 1104864,
        "ATK": 23216,
        "P.DEF": 4888,
        "M.DEF": 6104
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "ACC": 100,
        "M.Block": 500,
        "M.Block DEF": 250,
        "M.Tough": 150,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Rune of Frailty",
        "description": "Engraves a rune on the target, dealing up to 203012 P.DMG that ignores DEF based on missing HP and reducing their P.DEF by 50% for 8 sec.",
        "mana": 2,
        "cooldown": 10,
        "order": 1
      },
      {
        "name": "Rune of Healing",
        "description": "Heals 236468 HP of all allies.",
        "mana": 2,
        "cooldown": 7,
        "order": 2
      },
      {
        "name": "Rune of Silence",
        "description": "Deals 88006 P.DMG to all enemies, and dispels all positive effects. Inflicts Silences on target for 3 sec.",
        "mana": 1,
        "cooldown": 40,
        "order": 3
      },
      {
        "name": "Rune of Protection",
        "description": "Every 10 sec, engraves a rune upon the ally with the lowest HP and recovers a total of 312440 HP for 10 sec.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 35,
    "name": "Lewisia",
    "description": "A Vampire princess who joined Kyle in his war against the Demons 100 years ago. She is a pure-blood Vampire who has lived for over 500 years. Often considered the Queen of Vampires, she is nigh immortal. The tremendous expenditure of her power during the war against the Demons has taken its toll, and the immortal princess now assumes a child-like form. After the war, she blended into Human society and watched the world change over the next 100 years while slowly restoring her power. When the Demons reappeared and the Holy Sword awoke, Lewisia sensed the sudden shifts of energy. Soon after, she left on a journey to find and observe the newly chosen warrior.",
    "type_dmg": "Magic",
    "slug": "lewisia",
    "role_id": "wizard",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 985328,
        "ATK": 29328,
        "P.DEF": 3904,
        "M.DEF": 5864
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "Penetration": 150,
        "ACC": 100,
        "M.Dodge": 200,
        "M.Block": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Blood Orb",
        "description": "Deals 293762 M.DMG to target, increasing M.DMG the target takes 25% for 10 sec. Each stacks of Blood Curse, inflicted upon target increases DMG dealt by 1%. Upon use, consumes 10% of current HP.",
        "mana": 1,
        "cooldown": 8,
        "order": 1
      },
      {
        "name": "Blood Zone",
        "description": "Deals 352394 M.DMG to the target and creates a Blood Zone that lasts for 10 sec around the target. Enemies within the Blood Zone take 25205 M.DMG every 0.5 sec, and have their M.DEF is reduced by 30%. Each stack of Blood Curse inflicted upon target increases DMG dealt by 1%. Upon use, consumes 20% of current HP.",
        "mana": 3,
        "cooldown": 17,
        "order": 2
      },
      {
        "name": "Blood Banquet",
        "description": "Attacks frontal enemies in a straight line 3 times, dealing a total of 308775 M.DMG and inflicting Stun for 3 sec. Each stack of Blood Curse inflicted upon target increases DMG dealt by 1% Upon use, consumes 10% of current HP.",
        "mana": 3,
        "cooldown": 12,
        "order": 3
      },
      {
        "name": "Blood Dominator",
        "description": "When HP is 50% or above, ATK is increased by 35148 and DEF Penetration  by 250. Upon attack, inflicts target with Blood Curse, dealing a total of 12900 continuous M.DMG over time for 20 sec and recovering HP equal to 10% of DMG dealt by Blood Curse. Blood Curse can be stacked up to max 60 times, and it is irremovable.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 36,
    "name": "Lilia",
    "description": "A God Dragon of the Oasis and a sister of the Priestess of Water. Laias. She is still a young Blue Dragon who loves her sister who is much older than her. When Laias fell into a deep sleep after exhausting her powers in the battle 100 years ago, Lilia defended the Shrine of Flow on her own. It was when she heard the children of the desert making desperate prayers that she finally woke up the Priestess of Water to protect them. Unlike her mild and thoughtful sister, she is somewhat strict, and the way she controls the power of flow and water is more aggressive, too. She feels the need to protect her beautiful sister against flirting, unworthy men.",
    "type_dmg": "Physical",
    "slug": "lilia",
    "role_id": "wizard",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 985328,
        "ATK": 29328,
        "P.DEF": 3904,
        "M.DEF": 5864
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "Penetration": 150,
        "ACC": 100,
        "M.Dodge": 200,
        "M.Block": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Aqua Tempest",
        "description": "For 8 sec, summons Aqua Tempest to a random target and enemies in target's range and deals 19217 P.DMG every 0.5 sec. If the target is killed, Aqua Tempest is summoned to attack another random target for the remaining time.",
        "mana": 3,
        "cooldown": 8,
        "order": 1
      },
      {
        "name": "Everlasting Oasis",
        "description": "When activated, turns into the Everlasting Oasis state for 15 sec. During the Everlasting Oasis state, mana recovery rate per sec is increased by 150% and ATK is increased by 79077. Additionally, all DEF is increased by 9737.",
        "mana": 3,
        "cooldown": 20,
        "order": 2
      },
      {
        "name": "Celestial Cataract",
        "description": "Throws water drops 15 times to random enemies, dealing a total of 343290 P.DMG. Additionally, throws big water drops 5 times to target and other enemies in target's range, dealing 559125 P.DMG. Enemies hit by the big water drop are inflicted by Stun for 2 sec. Per each water drop thrown, 25 mana is consumed, and mana consumption rate is increased by 13. Stops use when mana becomes 0.",
        "mana": 3,
        "cooldown": 12,
        "order": 3
      },
      {
        "name": "Aqua Purification",
        "description": "Mana Recovery upon attack is fixed, but increaeses own ATK by 41559, Crit Chance by 300, and Mana Recovery per sec to 120. Per 6 Mana Recovery per sec, ATK is increased by 1%.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 37,
    "name": "Loman",
    "description": "If one were to choose the most trustworthy among the Guardian Knights, Loman's name would be one of the first to come to mind. The royal family trusts him so much that they appointed Loman as the Gatekeeper of the Orvel Monarchy. He is usually a gentle and friendly man, but becomes uncompromising when anyone tries to approach his king without royal permission. No one who has seen his halberd, the one bestowed by Scarlet, split the air has ever returned alive. While off duty, however, he is a sensitive man who enjoys wood carving as a hobby.",
    "type_dmg": "Physical",
    "slug": "loman",
    "role_id": "knight",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1706672,
        "ATK": 19792,
        "P.DEF": 8792,
        "M.DEF": 6840
      }
    ],
    "add_stats": [
      {
        "Crit": 50,
        "P.Block": 100,
        "M.Block": 100,
        "P.Tough": 250,
        "M.Tough": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Cut Ground",
        "description": "Deals 138175 P.DMG to frontal enemies within range and knocks them down for 4 sec, increasing P.Weakness of the affected targets by 25% for 10 sec.",
        "mana": 2,
        "cooldown": 8,
        "order": 1
      },
      {
        "name": "Shrouding Creed",
        "description": "Removes negative effects from all allies. Casts a shield upon all allies that absorbs 354966 DMG for 5 second(s) and reduces all DMG to allies by 20% for 10 second(s). The shield grants immunity to CC while it lasts.",
        "mana": 3,
        "cooldown": 23,
        "order": 2
      },
      {
        "name": "Knight's Creed",
        "description": "Hits frontal enemies within range 3 times. First 2 hits deal 115539 P.DMG and stun enemies for 1.5 second(s) while the last hit attacks enemies in wider range 2 times, dealing 273022 P.DMG in total. The last hit stuns enemies for 5 seconds and leaves [Mark of Creed] on the enemies, damaging them for 15 second(s). Targets with [Mark of Creed] take additional 107504 P.DMG from allies excluding caster. Additional DMG effect is activated only once every 0.5 second(s).",
        "mana": 3,
        "cooldown": 24,
        "order": 3
      },
      {
        "name": "The Last Gatekeeper",
        "description": "Stacks [Endurance] every second. [Endurance] cannot be dispelled, and when stacked 20 times, deals 7900 P.DMG, ignoring DEF on nearby enemies and reduces ATK of affected enemies by 20% for 10 second(s). A successful block grants 1 additional [Endurance] stack. This effect is activated only once every 0.2 second(s).",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 38,
    "name": "Lorraine",
    "description": "The Great Sage of Elidora is the wisest of the Druids. As one of the heroes who fought against the Demon invaders 100 years ago, she is often considered the wisest person on the entire Orbis Continent. She has taught and trained countless Elves, and possesses keen insight and mystic powers befitting her age. It is said that even the current king of Elidora as well as his children were all once her students. Having recently sensed a strange disturbance from the Elidora Forest, she is preparing the path for the wielder of the Holy Sword.",
    "type_dmg": "Magic",
    "slug": "lorraine",
    "role_id": "wizard",
    "position": "Middle",
    "base_stats": [
      {
        "Max HP": 985328,
        "ATK": 29328,
        "P.DEF": 3904,
        "M.DEF": 5864
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "Penetration": 150,
        "ACC": 100,
        "M.Dodge": 200,
        "M.Block": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Thornbush Forest",
        "description": "Attacks a random enemy and its nearby enemies 3 times, dealing a total of 372021 M.DMG and inflicting Stun for 3 sec.",
        "mana": 2,
        "cooldown": 7,
        "order": 1
      },
      {
        "name": "Seed of Belladonna",
        "description": "Creates a Seed of Belladonna around the target for 10 sec. The seed deals 138584 M.DMG to nearby enemies every 2 sec, increasing M.DMG the target takes by 30% and reducing Heal Rate by 30% for 5 sec.",
        "mana": 3,
        "cooldown": 15,
        "order": 2
      },
      {
        "name": "Wrath of the Forest",
        "description": "Attacks enemies within a wide frontal range of self 6 times, dealign a total of 630588 M.DMG and knocking them down for 3 sec.",
        "mana": 3,
        "cooldown": 18,
        "order": 3
      },
      {
        "name": "Poison",
        "description": "Normal and Skill attacks inflict Poison on a target, dealing a total of 410580 continuous M.DMG and reducing Heal Rate by 5% over 20 sec. Poison can be stacked up to max 5 times.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 39,
    "name": "Lucias",
    "description": "Lucias was a member of Lua's Holy Knights before awakening as the Saint of Blessings. Under the command of the Living Legend, Ricardo, he protected Orvel and neighboring towns from Demons. However, stigmata started to appear on his body when he was 19, and by the call of Lua, the holy knight became the Saint of Blessings. His mission is to travel around the world and bring the light of Lua to those in need. He stayed true to his duties, wandering the world to share blessings. Now, he holds a weapon in his hand again to defeat the power of darkness that has been growing in strength over the past 100 years.",
    "type_dmg": "Physical",
    "slug": "lucias",
    "role_id": "priest",
    "position": "Middle",
    "base_stats": [
      {
        "Max HP": 1104864,
        "ATK": 23216,
        "P.DEF": 4888,
        "M.DEF": 6104
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "ACC": 100,
        "M.Block": 500,
        "M.Block DEF": 250,
        "M.Tough": 150,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Path of Blessings",
        "description": "Heals 4 allies with the lowest HP by 350151 and targets take 20% reduced P.DMG for 7 sec.",
        "mana": 2,
        "cooldown": 10,
        "order": 1
      },
      {
        "name": "Zone of Faith",
        "description": "Sets up the [Zone of Faith] at the own location for 6 sec. Increases ATK of allies in [Zone of Faith] by 64833 and dispels negative effects on them continuously. Heals allies in area by 61303 every second. Deals P.DMG of 102501 on enemies within [Zone of Faith] every second, and stuns them for 0.7 sec.",
        "mana": 5,
        "cooldown": 15,
        "order": 2
      },
      {
        "name": "Stigmata",
        "description": "Increases P.Dodge of all allies by 250 and their ATK by 36803 for 15 sec. Effects will be dispelled when the self dies. Normal attacks deal additional P.DMG of 208424 to targets for 15 sec, and increases the P.DMG taken by target by 25% for 5 sec.",
        "mana": 3,
        "cooldown": 25,
        "order": 3
      },
      {
        "name": "Holy Sacrifice",
        "description": "Casting Path of Blessings and Zone of Faith consumes 20% of self's current HP. Upon healing an ally with these spells, the amount of healing is increased by 48947 and the target gains 4507 additional DEF for 10 sec.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 98,
    "name": "Lucikiel",
    "description": "One of the Five Primal Demons whom Lea bestowed her power upon. Bestowed with the pwoer of 'Destruction,' Lucikiel is gifted with powerful strength, even among the Primal Demons. The 'Power of Destruction,' however, gives much more than just supremacy in battle strength. Its reach is not limited to only object that can be seen or touched. It can even affect the worlds themselves, and one of its usages is temporarily 'destroying' the rift between the Pandemonium and the Material World to travel between the worlds. Using this, Lucikiel has been traveling between the two worlds even before the Demons invaded the Material World, observing the world that he will destroy one day. During all these times, nothing really piqued Lucikiel's interest in the Material World - until certain individuals attracted his attention. How these individuals will affect Lucikiel's course of action is yet to unfold.",
    "type_dmg": "Magic",
    "slug": "lucikiel",
    "role_id": "wizard",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 985328,
        "ATK": 29328,
        "P.DEF": 3904,
        "M.DEF": 5864
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "Penetration": 150,
        "ACC": 100,
        "M.Dodge": 200,
        "M.Block": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Death Storm",
        "description": "Attack the target and nerby 3 times, dealing a total of 650775 M.DMG and leaving a [Shadow of Death]. [Shadow of Death] deals 193560 M.DMG and reduces the target's Heal Rate by 30% over 10 sec.",
        "mana": 2,
        "cooldown": 13,
        "order": 1
      },
      {
        "name": "Annihilation Wave",
        "description": "Attacks frontal enemies within range 2 times. The first attack deals 189270 M.DMG and inflicts Stun for 3 sec. The second attack deals 309262 M.DMG and draws in hit targets in front of self. Affter use, the Skill changes to [Annihilation Surge].",
        "mana": 3,
        "cooldown": 13,
        "order": 2
      },
      {
        "name": "Annihilation Surge",
        "description": "Attacks frontal enemies within a wide range 2 times. The first attack deals 277968 M.DMG and inflicts Stun for 5 sec. The second attack deals 369464 M.DMG and draws in hit targets in front of self. Affter use, the Skill changes to [Annihilation Wave].",
        "mana": 3,
        "cooldown": 13,
        "order": "2_2"
      },
      {
        "name": "Doomsday",
        "description": "Attacks nearby enemies 9 times, dealing a total of 518562 M.DMG, and draws them in front of self. The last hit deals 384128 M.DMG, knocks down hit targets for 5 sec, and leaves [Pain of Doom] that lasts for 10 sec. Each time Lucikiel attacks targets inflicted with [Pain of Doom] with a normal or Skill attack, he deals 49374 additional M.DMG.",
        "mana": 4,
        "cooldown": 23,
        "order": 3
      },
      {
        "name": "Armor of the Demon God",
        "description": "Reduces All DMG taken by 25% and the duration of CC by 50%. Upon every Skill use, creates [Authority of the Demon God] that absorbs 197926 DMG for 6 sec. Gains immunity to CC for the duration of [Authority of the Demon God].",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 40,
    "name": "Luna",
    "description": "Lulus, very rarely sighted and often considered mythical, are a race of animal hybrids. They live in an extremely cold region, and are very fearful of contacting the outside world. One day, a Lulu child was born with the exact opposite personality that is typical her race. That child is Luna. It's not that she was unhappy with the ways of her people. Nor did she have any grand purpose of experiencing the world outside. She was simply picking flowers, one step at a time. Another step to pick up some frozen branches for her slingshot. And another step to follow the scent of some sweet, red fruit. Before she knew it, she was outside, running toward a carrot field away from the mountain.",
    "type_dmg": "Magic",
    "slug": "luna",
    "role_id": "archer",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 1066728,
        "ATK": 27864,
        "P.DEF": 5376,
        "M.DEF": 4392
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Penetration": 250,
        "ACC": 100,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Pew!",
        "description": "Deals 163643 M.DMG by shooting a bouncing projectile which bounces 3 times starting from the nearest enemy. The further the enemy, the more DMG inflicted.",
        "mana": 2,
        "cooldown": 8,
        "order": 1
      },
      {
        "name": "Look out above!",
        "description": "Deals 284915 M.DMG to enemies furthest away in a small range, and stuns them for 3 sec. The further the enemy, the more DMG they will take.",
        "mana": 2,
        "cooldown": 12,
        "order": 2
      },
      {
        "name": "Twinkle Twinkle",
        "description": "Deals 118336 M.DMG to target enemies in range, and reduces target's Crit Chance by 100% for 7 sec.",
        "mana": 1,
        "cooldown": 15,
        "order": 3
      },
      {
        "name": "Gotcha!",
        "description": "When inflicted by CC, dispels negative effects from self and attacks the farthest enemy, dealing 38284 M.DMG and knocking it away for 2 sec. Affterward, recovers 1 orb of Mana.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 41,
    "name": "Maria",
    "description": "Although she was a Holy Maiden of Lua in the past, she eventually fell into corruption. Now, this cynical, crow-commanding witch curses her former Goddess from the darkness. There was a time when she was a friend of Kyle and a heroine of the people. However, when Kyle disappeared, she hid herself from the world as well. She eventually came back as a fallen witch, threatening mankind as the spearhead of the Demon Army. These days, however, she appears to be plotting some scheme, not as a Demon commander, but completely on her own.",
    "type_dmg": "Magic",
    "slug": "maria",
    "role_id": "wizard",
    "position": "Middle",
    "base_stats": [
      {
        "Max HP": 985328,
        "ATK": 29328,
        "P.DEF": 3904,
        "M.DEF": 5864
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "Penetration": 150,
        "ACC": 100,
        "M.Dodge": 200,
        "M.Block": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Raven Storm",
        "description": "Deals a total of 481491 M.DMG over 3 times to enemies in frontal range and knocks them back, reducing hit enemies' ATK Spd by 250 and M.DEF by 30% for 15 sec. If the target is not a Hero, each hit deals 160497 additional M.DMG.",
        "mana": 3,
        "cooldown": 9,
        "order": 1
      },
      {
        "name": "Claw of Restriction",
        "description": "Deals 218709 M.DMG to 2 enemies and shackles them for 6 sec. Hit targets take 63348 continuous M.DMG over 6 sec and take 30% increased M.DMG for the duration of Skill.",
        "mana": 2,
        "cooldown": 13,
        "order": 2
      },
      {
        "name": "Area of Darkness",
        "description": "Draws in nearby enemies towards the center 5 times and deals a total of 607795 M.DMG. The last attack stuns enemies for 3 sec. Deals additional 121559 M.DMG to Non-Hero enemies.",
        "mana": 4,
        "cooldown": 25,
        "order": 3
      },
      {
        "name": "Black Wind",
        "description": "Increases Crit Chance by 150 and each hit inflicts [Curse of Lea] on the target for 10 sec. Targets inflictes with [Curse of Lea] have theirCrit Chance reduced by 250 and ATK by 25% for the duration of Skill.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 42,
    "name": "May",
    "description": "A girl who runs her own General Shop at the Orvel Castle. She is highly likable, and treats everyone with brightness and enthusiasm. Dreaming of one day she'll become the wealthiest merchant in Orvel, May usually hunts and gathers her own merchandise. Because of the effort she puts into acquiring her goods, her prices aren't exactly cheap, and people often criticize her for this. Currently, she is preparing to travel to Aegina Desert after hearing that someone recently discovered a treasure there.",
    "type_dmg": "Magic",
    "slug": "may",
    "role_id": "priest",
    "position": "Middle",
    "base_stats": [
      {
        "Max HP": 1104864,
        "ATK": 23216,
        "P.DEF": 4888,
        "M.DEF": 6104
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "ACC": 100,
        "M.Block": 500,
        "M.Block DEF": 250,
        "M.Tough": 150,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Take anything!",
        "description": "All allies' ATK is increased by 5222 for 120 sec, and randomly grants one of the following effects: 1. DEF Penetration 70 up, 2. Atk Spd 100 up, 3. Instant Mana recovery by 500. All effects other than Mana Recovery can be stacked up to 5 times max.",
        "mana": 1,
        "cooldown": 8,
        "order": 1
      },
      {
        "name": "Cheer up!",
        "description": "All allies' HP is healed by 330736 , and per each sec, each ally recovers 1% of their max HP for 10 sec. There is a 10% chance the heal rate doubles.",
        "mana": 2,
        "cooldown": 11,
        "order": 2
      },
      {
        "name": "Not for sale!",
        "description": "Attacks a random target and other enemies in range 3 times, dealing a total of 465795 M.DMG and inflicting Stun for 4 sec. There is a 10% chance that the skill range, DMG, and Stun duration are doubled.",
        "mana": 4,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Take this!",
        "description": "Every 15 sec, deals 154304 M.DMG to 4 random enemies, and randomly inflicts one of the following: 1. 185720 M.DMG over time for 10 sec, 2. Stun for 2 sec, 3. Freeze for 5 sec",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 43,
    "name": "Mediana",
    "description": "A practitioner of the medical arts developed when priests were short in supply. She inherited her natural medical talent from her father, but her thirst for knowledge crossed the line when she began researching poison. As a result, she was excommunicated from medical society, but her enthusiasm for research was seemingly unaffected. However, her basic respect for life kept her from achieving any experimental results for her poison research. When the Demons appeared, she became overjoyed at finding rare and precious test subjects.",
    "type_dmg": "Physical",
    "slug": "mediana",
    "role_id": "priest",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 1104864,
        "ATK": 23216,
        "P.DEF": 4888,
        "M.DEF": 6104
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "ACC": 100,
        "M.Block": 500,
        "M.Block DEF": 250,
        "M.Tough": 150,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Healing Salve",
        "description": "Heals all allies by 283695 and makes them immune to the next single hit of DMG.",
        "mana": 2,
        "cooldown": 15,
        "order": 1
      },
      {
        "name": "Special Water Cannon",
        "description": "Fires a water cannon in a frontal direction, healing allies in range of 33943 HP every 0.5 sec, and dealing 50768 P.DMG to the enemy.",
        "mana": 3,
        "cooldown": 20,
        "order": 2
      },
      {
        "name": "Strengthening Potion",
        "description": "Injects the ally with the highest ATK with a strengthening potion, increasing their ATK by 20%+ 42740 of Mediana's ATK and keeping their HP from falling below 5%.",
        "mana": 4,
        "cooldown": 23,
        "order": 3
      },
      {
        "name": "Mediana's Special Poison",
        "description": "Increases all allies' ATK by 5937 and P.Crit Resistance by 200. Upon attack, injects the enemy with a Special Poison that deals a total of 116080 P.DMG over 5 sec and reduces P.Crit Resistance by 200. If there are 2 or more allies including herself, Mediana will be counted as the ally with the highest ATK.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 44,
    "name": "Mirianne",
    "description": "She is Sonia's maid and sister-like friend from the orphanage. When her village of Humans and Elves was attacked by the Demons, she was the only survivor. Ricardo found her and took her into his orphanage. For some unknown reason, she experienced explosive growth phase at the age of 6. Her body now resembles that of an 18-year-old, but she still has the mind of a child. She is pure and devotional to a fault. Perhaps these traits are related to the loss of her childhood memories.",
    "type_dmg": "Magic",
    "slug": "mirianne",
    "role_id": "assassin",
    "position": "Middle",
    "base_stats": [
      {
        "Max HP": 1384992,
        "ATK": 24688,
        "P.DEF": 7816,
        "M.DEF": 6840
      }
    ],
    "add_stats": [
      {
        "Crit": 200,
        "Crit DMG": 30,
        "ACC": 100,
        "P.Dodge": 200,
        "M.Dodge": 200,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Target Lock On",
        "description": "Attacks the enemy with the lowest M.DEF 3 times, dealing a total of 21489 M.DMG and inflicting stun for 1 sec, and if the target is under 'Target Lock On', target takes additional 89961 M.DMG. The last attack inflicts 'Target Lock On' on the enemy for 10 sec. Lock On cannot be dispelled, and the target's M.Block rate has decreased by 500.",
        "mana": 1,
        "cooldown": 6,
        "order": 1
      },
      {
        "name": "Restrain and Protect",
        "description": "Deals 223314 M.DMG to target enemy and other enemies in range, and Stuns them for 2 sec. Then moves to an ally with the lowest P.DEF, excluding self, and creates Shield for two that can block 188684 DMG for 10 sec. Shield will be ineffective when there is no ally. Gains immunity to CC while the Shield lasts.",
        "mana": 3,
        "cooldown": 12,
        "order": 2
      },
      {
        "name": "Assassination",
        "description": "Moves to an enemy with the lowest HP, deals 356664 M.DMG then returns to the furthest ally. If the enemy is not a hero, deals 534872 additional M.DMG that ignores DEF. Defeating a target with this skill instantly triggers 'Restrain and Protect'.",
        "mana": 2,
        "cooldown": 14,
        "order": 3
      },
      {
        "name": "Target Eliminated",
        "description": "If an enemy is inflicted by 'Target Lock On', ATK increases by 89055 and all attacks skills prioritize Locked On enemies. When the Locked On enemies dies, 'Target Lock On' is inflicted on another enemy for 10 sec.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 45,
    "name": "Miruru",
    "description": "She once roamed the seas as the pirate empress, instilling fear in sailors' hearts. However, a cursed item has turned her into a child, and all her loyal allies and crew members soon left her. Not one to give up, she started again from the scratch, and now dreams of returning to her former glory. Unfortunately, the curse of childhood has made her way of thinking immature as well. Even so, she continues to chase her dream. Currently, she commands the second Miruru Pirates consisting of Goblins and Gnolls.",
    "type_dmg": "Physical",
    "slug": "miruru",
    "role_id": "mechanic",
    "position": "Middle",
    "base_stats": [
      {
        "Max HP": 1157176,
        "ATK": 25416,
        "P.DEF": 5376,
        "M.DEF": 4392
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Crit DMG": 50,
        "Penetration": 100,
        "ACC": 200,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Baaaam!",
        "description": "Deals 298774 P.DMG to all enemies and pushes them back.",
        "mana": 2,
        "cooldown": 7,
        "order": 1
      },
      {
        "name": "Roll Over",
        "description": "Deals 86817 P.DMG 3 times to frontal enemies, and each attack has a 100% chance of knocking them down for 2 sec.",
        "mana": 2,
        "cooldown": 13,
        "order": 2
      },
      {
        "name": "Miruru Pirates!",
        "description": "Attacks a random target and the enemies near it 5 times, dealing a total of 455420 P.DMG and reducing their ATK Spd by 400. If the target is not a Hero, deals 110806 additional P.DMG.",
        "mana": 4,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Boooooom!",
        "description": "When dealing a normal attack, shoots additional bullet with a 60% chance of dealing 42039 P.DMG to all enemies.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 46,
    "name": "Mitra",
    "description": "Known to some as the Song of the Silver Madness, he is incredibly insincere in everything he does. He shows absolutely no sense of responsibility in regard to those around him. Once he engages in a combat, though, he turns into an untouchable silver wolf that storms across the battlefield. Nothing is known about his past. One thing is certain: he does not distinguish between friend and foe once the madness of battle takes over him. Staying near him when he's in this state may be far more dangerous than holding onto a ticking time bomb.",
    "type_dmg": "Physical",
    "slug": "mitra",
    "role_id": "mechanic",
    "position": "Middle",
    "base_stats": [
      {
        "Max HP": 1157176,
        "ATK": 25416,
        "P.DEF": 5376,
        "M.DEF": 4392
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Crit DMG": 50,
        "Penetration": 100,
        "ACC": 200,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Bang! Bang!!",
        "description": "Attacks an enemy 2 times, dealing 100816 P.DMG each. Upon Crit Hit, an explosion occurs, dealing 49221 extra P.DMG to enemies in range.",
        "mana": 1,
        "cooldown": 6,
        "order": 1
      },
      {
        "name": "Time to Die!!",
        "description": "For 20 sec, ATK is increased by 63877 , and ACC is increased by 300. Each auto attack has a 15% chance of activating 'Bang! Bang!!'.",
        "mana": 2,
        "cooldown": 15,
        "order": 2
      },
      {
        "name": "Dance with me!!",
        "description": "Rapidly shoots a random enemy 12 times, dealing a total of 641388 P.DMG, and additional 381 P.DMG per Mark of Death stack. Each hit with this Skill inflicts an irremovable stack of Mark of Death on the enemy.",
        "mana": 4,
        "cooldown": 25,
        "order": 3
      },
      {
        "name": "You're Next!!",
        "description": "Normal attacks inflict an irremovable stack of Mark of Death on the enemy. Whenever a normal attack or Bang! Bang! hits the target, deals 13732 additional P.DMG. Each stack of Mark of Death deals 203 additional P.DMG. Mark of Death can be stacked up to max 200 times.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 47,
    "name": "Morrah",
    "description": "The former commander of the Dark Dragon Knights, she's the most gallant demon knight of the Demon Army. Currently, for some unknown reason, she is following the witch Maria and assisting her work. Many find it strange that the former champion of the Demon Army, who slaughtered countless enemies and even devoured dragons, now works for a mere witch as her servant. Nevertheless, she continues to faithfully serve her master.",
    "type_dmg": "Magic",
    "slug": "morrah",
    "role_id": "knight",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1706672,
        "ATK": 19792,
        "P.DEF": 8792,
        "M.DEF": 6840
      }
    ],
    "add_stats": [
      {
        "Crit": 50,
        "P.Block": 100,
        "M.Block": 100,
        "P.Tough": 250,
        "M.Tough": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Burning Power",
        "description": "Deals 65655 M.DMG to enemies in range and knocks them down, inflicting 3 stacks of Flame. Then for 15 sec, each auto attack deals 13239 M.DMG and inflicts 1 stack of Flame on enemy. Per each stacked Flame, DMG is increased by 2%. Each Flame stack deals separate M.DMG and reduces Heal rate by 1%.",
        "mana": 2,
        "cooldown": 6,
        "order": 1
      },
      {
        "name": "Hellfire",
        "description": "For 20 sec, all allies' M.DEF is increased by 7833 and M.Block Chance is increased by 250. Additionally, every 1 sec, inflicts 1 stack of Flame on nearby enemies.",
        "mana": 3,
        "cooldown": 12,
        "order": 2
      },
      {
        "name": "Lava Eruption",
        "description": "Deals 296427 M.DMG to enemies in range and inflict knock down. Per every stacked Flame, DMG is increased by 2%.",
        "mana": 3,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Fire Smash",
        "description": "Upon Block, deals 40133 M.DMG to enemies in range, and inflicts 3 stack of Flame.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 48,
    "name": "Naila",
    "description": "A stout and honorable warrior of the Harpies, the wielders of the power of wind. Her dignity as a Harpy warrior is more important to her than anything else in the world. She draws upon her willpower and desire to uphold her warrior's honor to bring down any enemy. Her skills are exceptional, even among her peers, and she is the ideal role model for younger Harpy warriors.",
    "type_dmg": "Physical",
    "slug": "naila",
    "role_id": "warrior",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1449520,
        "ATK": 22488,
        "P.DEF": 7328,
        "M.DEF": 8792
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Penetration": 150,
        "ACC": 100,
        "P.Dodge": 100,
        "M.Dodge": 100,
        "CC Resist": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Fierce Winds",
        "description": "Naila dashes toward the enemy 2 times. For her first attack, she moves behind the target, dealing 338643 P.DMG and knocking it down for 3 sec. For her second attack, she moves behind the enemy with the highest ATK, dealing 223436 P.DMG, knocking it down for 3 sec, and increasing the P.DMG it takes by 25% for 10 sec.",
        "mana": 3,
        "cooldown": 8,
        "order": 1
      },
      {
        "name": "Wind Reading",
        "description": "Dispels negative effects from self, and casts [Wind Reading] to all allies for 20 sec, increasing their ATK by 66014 and P.Dodge by 250. If an ally under [Wind Reading] successfully dodges an attack, their Crit DMG increases by 5% for 10 sec. The Crit DMG Boost effect can be stacked up to max 10 times.",
        "mana": 1,
        "cooldown": 20,
        "order": 2
      },
      {
        "name": "Dive Bomb",
        "description": "Attacks nearby enemies in a circular range of self, dealing 433347 P.DMG and inflicting Stun for 3 sec. 500 DEF Penetration applies to this Skill.",
        "mana": 3,
        "cooldown": 12,
        "order": 3
      },
      {
        "name": "Tornado Strike",
        "description": "Increases Naila's DEF Penetration by 150 and DEF by 15433. Naila's normal attacks and Skill attacks ignore target's DMG Reduction effect. Also, her normal attacks have a 15% chance to deal 179843 additional P.DMG and inflict Stun for 1 sec.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 49,
    "name": "Neraxis",
    "description": "Black dragons are notorious for being the most arrogant and ill-tempered out of all dragons. They suffered greatly from the Demon War 100 years ago. Armarta went mad, Ashen Nox robbed them, and Draconics started hunting down dragons. Neraxis was one of the few black dragon that survived that day, and he has been working and plotting to realize his revenge.",
    "type_dmg": "Magic",
    "slug": "neraxis",
    "role_id": "knight",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1706672,
        "ATK": 19792,
        "P.DEF": 8792,
        "M.DEF": 6840
      }
    ],
    "add_stats": [
      {
        "Crit": 50,
        "P.Block": 100,
        "M.Block": 100,
        "P.Tough": 250,
        "M.Tough": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Black Lightning Claw",
        "description": "Draws enemies towards the target and deals 96559 M.DMG. Deals 138175 M.DMG around the target after 1 sec and stuns them for 3 sec. Reduces ATK Spd of hit enemies by 300 for 10 sec.",
        "mana": 2,
        "cooldown": 8,
        "order": 1
      },
      {
        "name": "Obsidian Roar",
        "description": "Increases ATK, P.DEF, and M.DEF of all allies by 15192 for 15 sec. Deals 207384 M.DMG to all enemies and reduces their ATK by 30% for 15 sec.",
        "mana": 3,
        "cooldown": 15,
        "order": 2
      },
      {
        "name": "Breath of Destruction",
        "description": "Deals a total of 325818 M.DMG to enemies within a large area around the target over 6 times and reduces their M.DEF by 20% for 15 sec. Each hit stuns the enemy for 1 sec.",
        "mana": 4,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Black Dragon Hide",
        "description": "Increases P.DEF and M.DEF by 21370 and takes reduced P.DMG and M.DMG by 15%.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 50,
    "name": "Nia",
    "description": "An old legend has it that there was a demon that used humans as its test subjects for body modification. He cloned, fused, and modified numerous beast and human bodies with his magic. It was said that one of the test subjects that came to possess great power escaped the laboratory and created a tribe among humans. The leader of the tribe is known to have developed a mysterious ability called Demonic Eyes of Petrification. The demonic eyes, very similar to the cursed eyes of a rare beast Basilisk, are known to have the curse to turn everything they stared at into stones. Nia, the young leader of Krakashu Tribe, currently possesses these demonic eyes. This young beast, as swift as a leopard, is hunting down demons and demonic beasts to avenge her forefathers.",
    "type_dmg": "Physical",
    "slug": "nia",
    "role_id": "assassin",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1384992,
        "ATK": 24688,
        "P.DEF": 7816,
        "M.DEF": 6840
      }
    ],
    "add_stats": [
      {
        "Crit": 200,
        "Crit DMG": 30,
        "ACC": 100,
        "P.Dodge": 200,
        "M.Dodge": 200,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Scar of Barbarism",
        "description": "Deals 62283 P.DMG to 1 enemy. Then, moves forward while continuously attacking the nearby area and knocking back hit enemies to deal a total of 166088 P.DMG. The last strike deals 169482 P.DMG to frontal enemies and knocks them down for 2 sec.",
        "mana": 3,
        "cooldown": 15,
        "order": 1
      },
      {
        "name": "Enhanced Scar of Barbarism",
        "description": "Deals 125268 P.DMG to 1 enemy. Then, moves to random enemies while continuously attacking the nearby area and knocking back hit enemies to deal a total of 1336192 P.DMG. The last strike deals 336814 P.DMG to frontal enemies and knocks them down for 4 sec.",
        "mana": 1,
        "cooldown": 0,
        "order": "1_2"
      },
      {
        "name": "On the Hunt",
        "description": "Moves behind the farthest enemy to deal 82621 P.DMG, and inflicts [Hunt Mark] to all enemies for 12 sec. Enemies under [Hunt Mark] take 20% increased P.DMG and have their Heal Rate reduced by 25%. Dispels all positive effects from enemies with [Enhanced Hunt Mark].",
        "mana": 3,
        "cooldown": 15,
        "order": 2
      },
      {
        "name": "Enhanced On the Hunt",
        "description": "Moves behind the farthest enemy to deal 332076 P.DMG that ignores DEF, and inflicts [Enhanced Hunt Mark] to all enemies for 12 sec. Enemies under [Enhanced Hunt Mark] take 40% increased P.DMG, have their Heal Rate reduced by 50%, and their ATK Spd by 25%. Dispels all positive effects from enemies with [Hunt Mark].",
        "mana": 1,
        "cooldown": 0,
        "order": "2_2"
      },
      {
        "name": "Demonic Eyes of Petrification",
        "description": "Deals 170693 P.DMG to frontal enemies within range 3 times and petrifies them for 3 sec, reducing their All Dodge Chance by 200 for 10 sec.",
        "mana": 3,
        "cooldown": 30,
        "order": 3
      },
      {
        "name": "Enhanced Demonic Eyes of Petrification",
        "description": "Deals 185055 P.DMG that ignores DEF to enemies in a wide frontal range 3 times and petrifies them for 5 sec, reducing their All Dodge Chance by 200 for 10 sec.",
        "mana": 1,
        "cooldown": 0,
        "order": "3_2"
      },
      {
        "name": "Demonic Blood",
        "description": "Gains 1 stack of [Demonic Blood] upon using a skill. It can be stacked up to max 4 times, and upon gaining 4 stacks, reset Cooldown of all Skills and [Enhanced Skill] becomes available. Using [Enhanced Skill] removes [Demonic Blood] stacks. Upon gaining each stack of [Demonic Blood], increases own ATK by 9496 and All Dodge chance by 40 for 20 sec. This effect can be stacked up to max 5 times.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 51,
    "name": "Nicky",
    "description": "Chief Guard who manages the Orvel Stockade. In the past, she was once a warrior at the Orvel Arena, and a rival to Gladi. When Gladi began to spend more time running a shop than conquering the Arena, Nicky lost interest too and found another job. Somewhat skilled in training monsters, she applied to be the Stockade's Chief Guard, which is a dangerous yet well-paid job. While the inmates usually refrain from doing anything out of their fear for her, from time to time, they would lose all sense of reason and cause a scene. With each incident like that, her mace drew blood, leaving the inmates to cower in fear again.",
    "type_dmg": "Physical",
    "slug": "nicky",
    "role_id": "warrior",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1449520,
        "ATK": 22488,
        "P.DEF": 7328,
        "M.DEF": 8792
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Penetration": 150,
        "ACC": 100,
        "P.Dodge": 100,
        "M.Dodge": 100,
        "CC Resist": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Mace of Rehabilitation",
        "description": "Deals P.DMG of 203086 to enemy target and nearby enemies within narrow range, and stuns them for 1 sec. Hit enemies are inflicted with Disarmament for 7 sec. Enemies in Disarmament will have their P.Block changed to 0. This effect cannot be removed.",
        "mana": 2,
        "cooldown": 10,
        "order": 1
      },
      {
        "name": "Merciless Gale",
        "description": "Swings the weapon to attack enemies in a circular range of self 7 times. Each hit deals 59037 P.DMG and stuns for 1.5 sec. If the target is a Hero, reduces P.DEF by 30%, and if the target is not a Hero, causes it to take 30% increased P.DMG for 5 sec.",
        "mana": 3,
        "cooldown": 14,
        "order": 2
      },
      {
        "name": "Last Execution",
        "description": "Sets in position, focuses, then attacks enemies in a wide frontal range to deal 477170 P.DMG, dispel positive effects, and knock them down for 6 sec. Deals 620257 additional P.DMG to Non-Hero enemies. For this Skill, ACC and CC Accuracy will be increased by 500.",
        "mana": 4,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Massacre Instinct",
        "description": "Increases ATK by 21370 and Crit Chance by 300. When HP falls below 35%, Cruel Madness effect will be activated. For 8 sec, Cruel Madness effect removes all negative effects from self, increases ATK by 142488 and ATK Spd by 500, reduces DMG received by 50%, and grants immunity to CC. This effect only activates once during the battle.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 52,
    "name": "Nyx",
    "description": "A mysterious dimension-crossing wizard with distinctly recognizable heterochromia. The perpetual smile on his face seems to come from the wisdom of someone who sees through the entire universe. He shows great interest in those with special abilities and enjoys testing them. His space teleportation ability seems to surpass the realm of mortals, and he can even travel across dimensions. It is unsure what his true motivation is, but it seems certain enough that he always intends to help others.",
    "type_dmg": "Physical",
    "slug": "nyx",
    "role_id": "wizard",
    "position": "Nyx",
    "base_stats": [
      {
        "Max HP": 985328,
        "ATK": 29328,
        "P.DEF": 3904,
        "M.DEF": 5864
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "Penetration": 150,
        "ACC": 100,
        "M.Dodge": 200,
        "M.Block": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Dimension Blade",
        "description": "Deals 283417 P.DMG to target enemies and gains 1 stack of Blade per each hit enemy. The number of target increases depending on the number of Blade stacks. Blade can be stacked up to max 5 times, and lasts for 20 sec.",
        "mana": 1,
        "cooldown": 10,
        "order": 1
      },
      {
        "name": "Dimension Cleaver",
        "description": "Dispels all positive effects of target enemy and deals 263732 P.DMG. Hit enemies take 300930 P.DMG for 10 sec, and are knocked down for 3 sec. The number of target increases depending on the number of Blade stacks.",
        "mana": 3,
        "cooldown": 14,
        "order": 2
      },
      {
        "name": "Infinity Blades",
        "description": "Deals 582910 P.DMG to frontal enemies in range, and the final attack deals 312095 P.DMG to one enemy, inflicting knockdown for 3 sec. The number of target for the last attack increases depending on the number of Blade stacks.",
        "mana": 4,
        "cooldown": 25,
        "order": 3
      },
      {
        "name": "Hidden Blade",
        "description": "Each normal attack fires an additional blade that deals 46993 P.DMG, and there is a 10% chance of gaining 1 Blade stack. Increases the number of targets and Nyx's ATK by 10% for each Blade stack.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 53,
    "name": "Oddy",
    "description": "He was a mechanic of the royal palace of Orvelia in the distant past. However, he was cursed by the mythical creature Redpur and turned into a Redpur himself. Ever since the transformation, he has been living for so long that he forgot his own age. When he was Human, he invented the first portable watch, but no one in Orvelia saw its true value. To give his invention the recognition it deserved, he set out to the empire. On his way, he was cursed by a group of Redpurs who mistook him for a poacher. The curse also affected his watch, giving it a magical power to control the time flow within a living body. Oddy's own time stopped as well.",
    "type_dmg": "Magic",
    "slug": "oddy",
    "role_id": "mechanic",
    "position": "Middle",
    "base_stats": [
      {
        "Max HP": 1157176,
        "ATK": 25416,
        "P.DEF": 5376,
        "M.DEF": 4392
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Crit DMG": 50,
        "Penetration": 100,
        "ACC": 200,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Time Fracture",
        "description": "Deals 85958 M.DMG to enemies in a straight line, and inflicts Petrify for 3 sec.",
        "mana": 2,
        "cooldown": 7,
        "order": 1
      },
      {
        "name": "Time Fragments",
        "description": "Attacks random enemies 6 times, dealing a total of 485202 M.DMG. With 50% chance, 'Time Fragments' cooldown resets and consumes no mana for the next single activation.",
        "mana": 3,
        "cooldown": 12,
        "order": 2
      },
      {
        "name": "Time Distortion",
        "description": "Deals 357475 M.DMG to all enemies and increases all allies' ATK Spd by 250 for 15 sec. All allies' skill cooldown is reduced by 50%. 'Time Distortion' is not affected by skill cooldown reduction.",
        "mana": 4,
        "cooldown": 35,
        "order": 3
      },
      {
        "name": "Clock Magic",
        "description": "Upon using the skill, next 2 attacks deal 196653 additional M.DMG with a 30% chance to petrify the target for 3 sec. This effect activates every 1 sec.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 54,
    "name": "Ophelia",
    "description": "An astrologer traveling with a wandering troupe called 'Stardust.' As a member of the Witch Association, she is supposed to reside in a designated location and read the flow of fate as part of her practice. However, she is currently traveling in search of a man with a particular destiny she met in a dream. She believes that the man from her clairvoyant dream is destined to become the savior of the world. Her current priority is to find the man, and then stay at his side. If asked about her second goal... She blushes and loses all traces of her usual calmness telling about her future with the man of destiny.",
    "type_dmg": "Magic",
    "slug": "ophelia",
    "role_id": "wizard",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 985328,
        "ATK": 29328,
        "P.DEF": 3904,
        "M.DEF": 5864
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "Penetration": 150,
        "ACC": 100,
        "M.Dodge": 200,
        "M.Block": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Card of Death - Carta",
        "description": "Attacks enemy target, dealing 479151 M.DMG and inflicting Stun for 3 sec. Consumes the card in possession to inflict additional effects. Upon using the skill, gains the card of [Death]. [Death] - DMG ignores target's DEF and Stun duration increases by 5 sec. [Love] - Deals a total of 703860 M.DMG over time for 10 sec and reduces heal rate by 100%. [Fortune] - Skill Cooldown does not take effect.",
        "mana": 3,
        "cooldown": 15,
        "order": 1
      },
      {
        "name": "Card of Love - Elliciad",
        "description": "Increases ATK by 74096 for 12 sec and Mana Recovery/Sec by 100%. Consumes a card in possession to gain an additional effect according to the card type. Gains [Love] card upon use. [Death] - DEF Penetration increases by 600 for the duration of skill and gains immunity to CC for 6 sec. [Love] - The effect applies to all allies. [Luck] - Cooldown does not apply.",
        "mana": 2,
        "cooldown": 15,
        "order": 2
      },
      {
        "name": "Card of Fortune - Vellekia",
        "description": "Attacks the target and the enemies near it to deal 362810 M.DMG. This attack cannot miss and deals 100% increased Crit DMG. Gains [Luck] card upon use. [Death] - Crit DMG increases by 120%. [Love] - Removes all positive effects from enemies in range and silences them for 2 sec. [Luck] - Cooldown does not apply. Recovers 1 orb of Mana.effect according to the card type. Gains [Love] card upon use. [Death] - DEF Penetration increases by 600 for the duration of skill and gains immunity to CC for 6 sec. [Love] - The effect applies to all allies. [Luck] - Cooldown does not apply.",
        "mana": 3,
        "cooldown": 2,
        "order": 3
      },
      {
        "name": "Pathfinder of Fate",
        "description": "All allies' ATK is increased by 5696, and Crit Chance is increased by 100. Ophelia gains additional effect according to the card in possession. [Death] - ATK is increased by 30%. [Love] - Per each sec, heals 7% of max HP. [Fortune] - M.Dodge Chance is increased by 200.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 55,
    "name": "Pansirone",
    "description": "A girl that used to be a member of the Hound Unit. She shows no mercy even to those who surrendered and abandoned their weapons. She displays madness and wishes to burn everything in sight. As of right now, only Crow can control her madness. After the disbandment of the Hound Unit, she was reinstated as an officer at the Machine Division of the Empire and had been wandering from ruin to ruin, completing her assignments. She is infamous for not listening to her superiors or the system, making her known as a troublesome superior to other soldiers. The higher-ups regard her as a threat that may explode anytime. When it comes to her past endeavors, she becomes very protective. Thankfully, her colleagues from the Hound Unit do not try to pry into her past.",
    "type_dmg": "Physical",
    "slug": "pansirone",
    "role_id": "mechanic",
    "position": "Middle",
    "base_stats": [
      {
        "Max HP": 1157176,
        "ATK": 25416,
        "P.DEF": 5376,
        "M.DEF": 4392
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Crit DMG": 50,
        "Penetration": 100,
        "ACC": 200,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "A Present For You!",
        "description": "Attacks the enemy and enemies neraby within a wide range, dealing 141224 P.DMG and inflicting them with 'Eternal Blaze'. Enemies inflicted with 'Eternal Blaze' take a total of 526140 P.DMG over 10 sec and their Heal Rate reduced by 25%. after use of this skill, [Now D.I.E!] can be used within 10 sec.",
        "mana": 2,
        "cooldown": 22,
        "order": 1
      },
      {
        "name": "Now D.I.E!",
        "description": "Attacks enemies in a wide frontal range 7 times, dealing 72912 P.DMG each hit. If the target is not a Hero, deals 174990 additional P.DMG. Enemies inflicted with 'Eternal Blaze' take 23382 additional P.DMG each hit.",
        "mana": 2,
        "cooldown": 0,
        "order": "1_2"
      },
      {
        "name": "The Thrill! How Exciting!!",
        "description": "Hit enemies within range of self 12 times, dealing a total of 407556 P.DMG, and increasing own ATK by 64118 and DEF Penetration by 500 for 15 sec.",
        "mana": 2,
        "cooldown": 20,
        "order": 2
      },
      {
        "name": "Don't You Dare Run!",
        "description": "Attacks a random enemy 10 times, dealing a total of 950700 P.DMG. Attack the same target icnreases DMG by 7624 each hit.",
        "mana": 3,
        "cooldown": 21,
        "order": 3
      },
      {
        "name": "Cruel Delight",
        "description": "Increawses ATK by 28496, and DMG dealt to Non-Hero enemies by 30%. Attacking enemies inflicted with 'Eternal Blaze' reignites 'Eternal Blaze'.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 56,
    "name": "Pavel",
    "description": "A curious case of a human wizard possessed by the soul of an ice dragon. Having fought alongside Kyle 100 years ago, this ancient ice wizard has actually existed far before even then. The dragon's soul is usually asleep, but wakes up occasionally to speak to him in the voice of a lover. The empire considers him a key figure, and has dispatched Rodina to monitor and protect him. He himself, however, only wishes to live in peace and quiet, away from the concerns of the world.",
    "type_dmg": "Magic",
    "slug": "pavel",
    "role_id": "wizard",
    "position": "Middle",
    "base_stats": [
      {
        "Max HP": 985328,
        "ATK": 29328,
        "P.DEF": 3904,
        "M.DEF": 5864
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "Penetration": 150,
        "ACC": 100,
        "M.Dodge": 200,
        "M.Block": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Wedge of Cold Snap",
        "description": "Deal 291899 M.DMG to the targeted enemy and inflict Freeze for 5 sec. If any enemies are inflicted with Frost, deal DMG and inflict Freeze to them as well.",
        "mana": 2,
        "cooldown": 12,
        "order": 1
      },
      {
        "name": "Ice Spear",
        "description": "Attacks random enemies 5 times, dealing 651850 M.DMG and inflicting Frost. When attacking enemies inflicted with Frost, creates an additional spear that deals extra half DMG. Additional spears do not inflict Frost. Enemies inflicted with Freeze take 50% increased DMG.",
        "mana": 2,
        "cooldown": 8,
        "order": 2
      },
      {
        "name": "Icy Conquest",
        "description": "Deals 561405 M.DMG to all enemies. Enemies inflicted with Frost becomes inflicted with Freeze for 3 sec. Enemies inflicted with Freeze take 100% increased DMG.",
        "mana": 4,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Chill of Early Dawn",
        "description": "Deals 121859 M.DMG to 3 enemies every 15 sec and inflicts Frost on them to reduce their ATK Spd by 100 for 8 sec.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 57,
    "name": "Phillop",
    "description": "He is the stout and upright king of the Dwarves. He fought alongside the Warrior of the Holy Sword against the Demon Army 100 years ago. His heroism in defeating the Dark Dragon Legion, the core division of the Demon Army, is well known throughout the land. In reality, he only sits on the throne out of a sense of obligation. Even as he complains about the boredom of his royal duties, he continues to work diligently.",
    "type_dmg": "Physical",
    "slug": "phillop",
    "role_id": "knight",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1706672,
        "ATK": 19792,
        "P.DEF": 8792,
        "M.DEF": 6840
      }
    ],
    "add_stats": [
      {
        "Crit": 50,
        "P.Block": 100,
        "M.Block": 100,
        "P.Tough": 250,
        "M.Tough": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Collision",
        "description": "Deals 98390 P.DMG and knocks the enemy down for 3 sec. Reduces hit enemy's P.DEF by 50% for 10 sec.",
        "mana": 3,
        "cooldown": 12,
        "order": 1
      },
      {
        "name": "Headbutt",
        "description": "Dashes toward the enemy and deals 81138 P.DMG, knocking them back. Reduces hit enemies' ATK by 25% and  ATK Spd by 200 for 10 sec.",
        "mana": 2,
        "cooldown": 8,
        "order": 2
      },
      {
        "name": "Earth Incarnate",
        "description": "Increases own All DEF by 29918 and All DMG Reduction by 250, heals 15% of own HP, and gains immunity to CC for 15 sec. This effect is irremovable.",
        "mana": 3,
        "cooldown": 22,
        "order": 3
      },
      {
        "name": "Destroy Armor",
        "description": "Upon attacking, weakens enemy P.DEF by 3559 for 15 sec. Can be stacked up to 5 times max.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 58,
    "name": "Priscilla",
    "description": "A former officer of Orvelia's armed forces. After a failed attempt to reveal the corruption of military leaders, she was driven out from her position. Wanting to conceal their corruption, the military leaders constantly sent out assassins to eliminate her. The long and lonely fight was beginning to take its toll on her, physically and mentally. One day, the aristocratic von Daphnel family offered her protection in exchange for her service. She accepted, and has been working as Aisha's maid in the Tower of Sage ever since. To this day, she faithfully carries out her duties as a maid bodyguard. However, she sends all her payments to an undisclosed recipient.",
    "type_dmg": "Physical",
    "slug": "priscilla",
    "role_id": "warrior",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1449520,
        "ATK": 22488,
        "P.DEF": 7328,
        "M.DEF": 8792
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Penetration": 150,
        "ACC": 100,
        "P.Dodge": 100,
        "M.Dodge": 100,
        "CC Resist": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Vital Strike",
        "description": "Deals 311082 P.DMG to frontal enemies in range and stuns them for 1 sec. This attack always inflicts a Crit Hit.",
        "mana": 2,
        "cooldown": 8,
        "order": 1
      },
      {
        "name": "Coordination",
        "description": "For 20 sec, places Priscilla and an ally with the highest ATK in 'Coordination' state, and dispels Negative Effects. Priscilla and the ally in Coordination State get an ATK boost equal to 15% of Priscilla's ATK + 18518.",
        "mana": 3,
        "cooldown": 15,
        "order": 2
      },
      {
        "name": "Turbulent Dance",
        "description": "Deals 445692 P.DMG to nearby enemies in a circular range and draws them towards herself. If activated while in the 'Coordination' state, hit enemies take 30% extra P.DMG and M. DMG for 10 sec.",
        "mana": 3,
        "cooldown": 22,
        "order": 3
      },
      {
        "name": "Weapon Mastery",
        "description": "Own ATK is increased by 26359 , and Penetration is increased by 100.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 94,
    "name": "Rebel Clause",
    "description": "He had no special past, no superhuman strength, or no exceptional intellect. In a time when many orphans streamed out into the streets for countless reasons, Clause was just another ordinary, forgettable boy at the orphanage. He couldn't even remember who named him or whether his birthday was really his birthday. Ricardo was strict yet kind. but he could never stay at the orphanage for long. So the younger kids turned to Clause, who was only a couple of years older than them, for support and affection. Though Clause himself was just a small child, he quickly became used to taking care of and protecting someone. As a boy who took on this kind of responsibility without a doubt, it was only natural that Clause wanted to become a knight that protects others. Then he met Frey and Kasel. Among all the children at the orphanage, they were the most special. Their conversations, how they looked at him, and the time they spent toghether - all of them turned CLause from an ordinary boy into an extraordinary young man. Clause started calling Kasel and Frey his family. When other kids tried to tease the two, Clause would always up and take their side.There was a time when he believed that the threee of them would always remain a family, even if he became a knight and even if they all grew up and left the orphanage. He who abandoned the shield that failed to protect kept on reminding himself that the pain he felt every time he raised his sword was a punishment for his failure. But he knew he couldn't just stop and beat himself up forever. his family was waiting for him. They are waiting for him to rescue them, just like he always did in their childhood days. To end the long wait, to keep his dearest promise, Clause takes another step today. Even when the darkness covers your eyes, and the night is so long that you feel as if it will never end, do not worry. Don't be scared. The morning sun will rise. And I'll be right by your side, holding your hands.",
    "type_dmg": "Physical",
    "slug": "rebel-clause",
    "role_id": "warrior",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1449520,
        "ATK": 22488,
        "P.DEF": 7328,
        "M.DEF": 8792
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Penetration": 150,
        "ACC": 100,
        "P.Dodge": 100,
        "M.Dodge": 100,
        "CC Resist": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Determined Strike",
        "description": "Deals 131671 P.DMG to frontal enmemies within range and inflicts Stun for 2 sec. If the target is a boss, deals 305302 additional P.DMG.",
        "mana": 3,
        "cooldown": 7,
        "order": 1
      },
      {
        "name": "Indomitable Will",
        "description": "Deals 49114 P.DMG to nearby enemies, entering into the irremoveable state [Indomitable Will] for 10 sec. While in [Indomitable Will] state, ATK Spd is increased by 500 and the duration of CC inflicted upon self is reduced by 50%.",
        "mana": 2,
        "cooldown": 18,
        "order": 2
      },
      {
        "name": "Perish",
        "description": "Attacks a random enemy 6 times, dealing 75310 P.DMG each hit. Afterward, delivers an additional attack that deals 338895 P.DMG to nearby enemies and knocks them down for 3 sec.",
        "mana": 4,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Power of Galicta",
        "description": "Rebel Clause is not affected by Block stats, but his Crit Chance increases by 200, and when his DEF Penetration reaches 1000 or above, all of his attacks ignore the target's DEF. Additionally, his normal attack deal 92895 additional P.DMG to all enemies and inflict [Curse of Galicta] upon them for 6 sec. If the target is already inflicted with [Curse of Galicta], the target won't take additional DMG.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 59,
    "name": "Rehartna",
    "description": "The owner and artisan of 'Aselerando', an instrument atelier located at the Empire's capital. Her cheerful personality, along with her gentle tone and diligence, is well-received by the customers. With her excellent customer service towards her regulars along with her great crafting skills, Rehartna is known as an accomplished entrepreneur even at a young age. She appears to be just an ordinary artisan, but in reality, she is actually a member of the Resistance. She works as an intel collector who also arranges contacts, and she mostly performs her duty while traveling around the Empire, disguised as a trader Rehartna is very punctual and heavy-mouthed individual who has earned great trust from her fellow Resistance comrades. Moreover, her atelier's backroom serves as one of the hideouts of the Resistance, providing space for Resistance members from different places to exchange information.",
    "type_dmg": "Physical",
    "slug": "rehartna",
    "role_id": "priest",
    "position": "Middle",
    "base_stats": [
      {
        "Max HP": 1104864,
        "ATK": 23216,
        "P.DEF": 4888,
        "M.DEF": 6104
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "ACC": 100,
        "M.Block": 500,
        "M.Block DEF": 250,
        "M.Tough": 150,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Release! Ultrasonic Wave!",
        "description": "Attacks frontal enemies in a straight line, dealing a total of 263148 P.DMG over 4 times. Each hit inflicts stun for 3 sec, and reduces enemies atk by 25% for 10 sec.",
        "mana": 2,
        "cooldown": 13,
        "order": 1
      },
      {
        "name": "Crystal Clear, Matimaruma!",
        "description": "Immediately heals HP of the ally with the lowest HP by 307825, creating a shield that absorbs 558136 DMG and grants immunity to CC for 10 sec. While the shield is active, heals HP of all allies near the target by 81144 every sec, and increases All DEF by 26118. Enemies take 81144 DMG and have their ATK Spd reduced by 250.",
        "mana": 2,
        "cooldown": 17,
        "order": 2
      },
      {
        "name": "You've Never Seen a Weapon Like This!",
        "description": "Reduces 4 random allies' Cooldown of all skills by 4 sec. For 15 sec, recovers allies Mana by 150 every sec and increases ATK by 94992. Upon every use, ATK Boost effect is increased by 9499.",
        "mana": 3,
        "cooldown": 25,
        "order": 3
      },
      {
        "name": "Battle March Melody",
        "description": "At the beginning of each battle, heals HP of all allies by 188475, and increases Heal Rate by 10%. Heal Boost effect can be stacked up to max 3 times, and is irremovable.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 60,
    "name": "Reina",
    "description": "Reina von Stein was born the daughter of a noble family of the empire. Her free spirit and energetic personality seem to brighten up even those around her. She prefers a life of freedom as a mercenary over the suffocating life of an aristocrat. After working as a mercenary for a long time, and she's already lost all traces of her noble upbringing in her manners. Even as a child, she showed a natural talent with swords. Over the years, she developed her skills with a rapier, using a style that best suited her lithe physique. Recently, she turned down a strange contract. Ever since then, she has been feeling as if someone has been following and watching her.",
    "type_dmg": "Physical",
    "slug": "reina",
    "role_id": "assassin",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1384992,
        "ATK": 24688,
        "P.DEF": 7816,
        "M.DEF": 6840
      }
    ],
    "add_stats": [
      {
        "Crit": 200,
        "Crit DMG": 30,
        "ACC": 100,
        "P.Dodge": 200,
        "M.Dodge": 200,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Float Like a Butterfly",
        "description": "Rapidly stabs the enemy, dealing 105405 P.DMG. Upon a Crit Hit, stacks 1 Wound and resets cooldown. Per every stacked Wound, DMG dealt by Float Like a Butterfly is increased by 20%. Gains immunity to all DMG while the skill is in use.",
        "mana": 1,
        "cooldown": 3,
        "order": 1
      },
      {
        "name": "Sharp End",
        "description": "Displels negative effects from self and increases ATK by 40603 for 20 sec and increases Crit Chance by 500. This effect cannot be dispelled.",
        "mana": 2,
        "cooldown": 20,
        "order": 2
      },
      {
        "name": "Shooting Star",
        "description": "Inflicts 859581 P.DMG upon enemy with a continuous attack. The last hit blows the enemy away.",
        "mana": 3,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Lucky Child",
        "description": "Upon a Crit Hit, ATK is increased by 9496 for 10 sec. Can be stacked up to 8 times max.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 61,
    "name": "Rephy",
    "description": "This pure and kindhearted Tamian soul guide can communicate with the dead. The Tamian race lives in harmony with nature, and they have the ability to read its flow and guide the souls of the dead. Rephy's ability as a soul guide is exceptional, even for a Tamian. He uses it to guide the souls of those who died in the forest and help them pass on, preventing them from turning evil. He is the most capable among the Tamians in discerning the paths of the stars, pacifying the souls of the dead, and properly guiding them to the afterlife.",
    "type_dmg": "Magic",
    "slug": "rephy",
    "role_id": "priest",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 1104864,
        "ATK": 23216,
        "P.DEF": 4888,
        "M.DEF": 6104
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "ACC": 100,
        "M.Block": 500,
        "M.Block DEF": 250,
        "M.Tough": 150,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Healing Soul",
        "description": "Heals 4 allies with lowest HP 10% of Max HP, and heals extra 516968 HP over 8 sec. This effect cannot be dispelled.",
        "mana": 2,
        "cooldown": 10,
        "order": 1
      },
      {
        "name": "Salvation",
        "description": "Dispels all negative effects. M.DEF is increased by 9255 for 20 sec.",
        "mana": 1,
        "cooldown": 12,
        "order": 2
      },
      {
        "name": "Soulrush",
        "description": "Deals a total of 338500 M.DMG over 10 attacks to enemies within range. Hit enemies' ATK Spd is reduced by 25%.",
        "mana": 3,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Spiritual Tuning",
        "description": "Every 7 sec, an ally with the lowest Hp recovers 1 orb of mana and 101072 HP.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 62,
    "name": "Requina",
    "description": "A curious merchant who deals every kind of poison known to mankind. She is a daughter of two wandering alchemists who traveled over from a distant nation. Other merchants call her 'the Merchant of Death,' but she has a different opinion. She claims that no poison is inherently evil, and that how one is used determines its nature. Like a true merchant, she believes that any tool is as good or evil as the one who uses it. Since the reappearance of the Demons, she has been traveling around, searching for the right poison to battle against the invaders.",
    "type_dmg": "Physical",
    "slug": "requina",
    "role_id": "archer",
    "position": "Middle",
    "base_stats": [
      {
        "Max HP": 1066728,
        "ATK": 27864,
        "P.DEF": 5376,
        "M.DEF": 4392
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Penetration": 250,
        "ACC": 100,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Tears of Mr. Python!",
        "description": "Attacks 2 enemies and deals 247200 P.DMG, while poisoning them with Tears of Mr. Python that cannot be dispelled for 4.5 sec. Enemies inflicted with Tears of Mr. Python cannot recover mana, takes 30% increased DMG, and their Block chance is reduced by 500.",
        "mana": 2,
        "cooldown": 10,
        "order": 1
      },
      {
        "name": "Screechy Grass Extract!",
        "description": "Attacks a random enemy 3 times and deals a total of 471381 DMG, while poisoning them with Screechy Grass Extract for 6 sec. Enemies inflicted with Screechy Grass Extract have their ATK reduced by 30%, and Crit Chance by 500.",
        "mana": 3,
        "cooldown": 10,
        "order": 2
      },
      {
        "name": "More! Stronger!",
        "description": "Own ATK is increased by 44885 for 20 sec and the effect of [Tears of Mr. Python], [Screechy Grass Extract], [Tickle Tickle Potion] is doubled. Also, target of [Tears of Mr. Python], [Screechy Grass Extract!], [Tickle Tickle Potion] is increased by 1.",
        "mana": 3,
        "cooldown": 25,
        "order": 3
      },
      {
        "name": "Tickle Tickle Potion!",
        "description": "Upon attack, poisons target enemy with Tickle Tickle Potion for 10 sec which deals a total of 57420 P.DMG over time, and cannot be dispelled. Tickle Tickle Potion can be stacked max 50 times.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 63,
    "name": "Ricardo",
    "description": "A hero who saved countless lives from the Demons, and the current commander of the Holy Knights of the Church of Lua. This brave and seasoned knight has been hunting down Demons all across Orvelia since his younger days. He is also the headmaster of the orphanage where Kasel, Frey, and Clause grew up. He trained countless warriors in Orvelia and is considered their spiritual leader. He is preparing to step down from the position due to his age, but his age-defying strength has always led to the denial of his retirement request.",
    "type_dmg": "Physical",
    "slug": "ricardo",
    "role_id": "knight",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1706672,
        "ATK": 19792,
        "P.DEF": 8792,
        "M.DEF": 6840
      }
    ],
    "add_stats": [
      {
        "Crit": 50,
        "P.Block": 100,
        "M.Block": 100,
        "P.Tough": 250,
        "M.Tough": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Destruction",
        "description": "Deals 162581 P.DMG to frontal enemies in range and knocks them down for 3 sec.",
        "mana": 2,
        "cooldown": 8,
        "order": 1
      },
      {
        "name": "Divine Protection",
        "description": "Deals 228955 P.DMG to enemies in range and inflicts Stun for 1 sec. Additionally, own M.DEF is increased by 7592 for 10 sec, and takes 80% of M.DMG instead of allies.",
        "mana": 1,
        "cooldown": 30,
        "order": 2
      },
      {
        "name": "Divine Judgment",
        "description": "Attacks frontal enemies in a straight line 3 times. The first 2 attacks deal 98809 P.DMG to enemies and stun them for 4 sec, and the last attack deals 118422 P.DMG to enemies in a 20% wider range, while stunning them for 4 sec. Each attack has a 50% chance of dispelling positive effects from the enemy.",
        "mana": 4,
        "cooldown": 23,
        "order": 3
      },
      {
        "name": "Divine Blessing",
        "description": "When allies excluding self take M.DMG, increases their M.DEF by 6644 for 5 sec. Can be stacked up to 5 times max.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 96,
    "name": "Riheet",
    "description": "An outlander who hails from an Orvel of another world that is similar, yet different. As inhabitants from a world where Dark Elves are oppressed by humans, the siblings Riheet and Ripine were quite confused with Orvel of this world, where racial discrimination isn't as prevalent. After seeing different races working together to build a better world, Riheet couldn't help but feel perplexed: he didn't know if he was angry or simply amused. In the world he came from, humans are but a sworn enemy to the Dark Elves, but it seems that such is not the case with the humans of this world...",
    "type_dmg": "Magic",
    "slug": "riheet",
    "role_id": "warrior",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1449520,
        "ATK": 22488,
        "P.DEF": 7328,
        "M.DEF": 8792
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Penetration": 150,
        "ACC": 100,
        "P.Dodge": 100,
        "M.Dodge": 100,
        "CC Resist": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Black Moon Brand",
        "description": "Deals 238448 M.DMG to frontal enemies within range, inflicting [Black Moon Brand] for 3 sec on hit targets and knocking them down for 3 sec. Upon hit, deals 3373 additional M.DMG that ignores Block per stack of [Otherworldly Curse]. Targets inflicted with [Black Moon Brand] cannot recover Mana for the duration.",
        "mana": 2,
        "cooldown": 7,
        "order": 1
      },
      {
        "name": "Black Moon Mark",
        "description": "Dispels CC effects from self and leaves an irremovable [Black Moon Mark] on the target for 15 sec, dealinhg 128724 M.DMG. If there is an enemy inflicted with [Silver Moon Mark], Riheet attacks the target inflicted with [Silver Moon Mark] and changes the mark to [Full Moon Mark]. If the target is inflicted with [Full Moon Mark], [Full Moon Execution] becomes activated for 10 sec.",
        "mana": 3,
        "cooldown": 15,
        "order": 2
      },
      {
        "name": "Black Moon Strike",
        "description": "Attacks the frontal area 10 times, dealing a total of 444880 M.DMG and inflicting Stun for 2 sec. Afterward, delivers a final blow that deals 261945 M.DMG and 5622 additional M.DMG that ignores Block per stack [Otherworldly Curse]. While in use, gains immunity to all CC effects.",
        "mana": 3,
        "cooldown": 23,
        "order": 3
      },
      {
        "name": "Otherworldly Mana",
        "description": "Uses Otherworldly Mana to increase own DMG dealt to enemies by 35% and inflict 1 stack of [Otherworldly Curse] on the target each hit, [Otherworldly Curse] can be stacked up to max 30 times.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      },
      {
        "name": "Full Moon Execution",
        "description": "Dispels CC effects from self and attacks an enemy inflicted with [Full Moon Mark] 2 times, dealind 232440 M.DMG. The last hit explodes [Full Moon Mark], dealing 128094 M.DMG that ignores Block. If the targets is not a Hero, deals 442400 additional M.DMG that ignores Block. Upon exploding [Full Moon Mark], deals 11244 additional M.DMG that ignores Block per stack of [Otherworldly Curse]. This skill is used together with [Ripine]. If this Skill kills an enemy, Cooldown of [Black Moon Mark] and Ripine's [Silver Moon Mark] will be reset.",
        "mana": "NULL",
        "cooldown": 1,
        "order": "4_2"
      }
    ]
  },
  {
    "id": 97,
    "name": "Ripine",
    "description": "An outlander who hails from an Orvel of another world that is similar, yet different. As inhabitants from a world where Dark Elves are oppressed by humans, the siblings Riheet and Ripine were quite confused with Orvel of this world, where racial discrimination isn't as prevalent. After seeing different races working together to build a better world, Ripine hoped that her world will someday also strive to become the ideal world... However, she was well aware that there are things that needed to be taken care of in her world and wished to return to her world to finish the deed.",
    "type_dmg": "Magic",
    "slug": "ripine",
    "role_id": "assassin",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1384992,
        "ATK": 24688,
        "P.DEF": 7816,
        "M.DEF": 6840
      }
    ],
    "add_stats": [
      {
        "Crit": 200,
        "Crit DMG": 30,
        "ACC": 100,
        "P.Dodge": 200,
        "M.Dodge": 200,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Silver Moon Gust",
        "description": "Deals a total of 336232 M.DMG to the target over 4 times and delivers an additional attack that deals 240300 M.DMG and inflicts Stun on the target for 2 sec. The last hit deals 3703 additional M.DMG that ignores DEF per stack of [Otherworldly Curse].",
        "mana": 2,
        "cooldown": 12,
        "order": 1
      },
      {
        "name": "Silver Moon Mark",
        "description": "Dispels CC effects from self and moves to the farthest enemy to inflict an irremovable [Silver Moon Mark] for 15 sec, dealing 132024 M.DMG. If there is an enemy inflicted with [Black Moon Mark], Ripine attacks the target inflicted with [Black Moon Mark] and changes the mark to [Full Moon Mark]. If target is inflicted with [Full Moon Mark], [Full Moon Execution] becomes activated for 10 sec. Ripine prioritizes the target inflicted with [Silver Moon Mark] or [Full Moon Mark].",
        "mana": 3,
        "cooldown": 15,
        "order": 2
      },
      {
        "name": "Silver Moon Bladestorm",
        "description": "Attacks the target 5 times, dealing a total of 348575 M.DMG and delivers an additional attack that deals 264048 M.DMG. The last hit deals 6172 additional M.DMG that ignores DEF per stack of [Otherworldly Curse].",
        "mana": 3,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Otherworldly Mana",
        "description": "Uses Otherworldly Mana to increase own DMG dealt to enemies by 35% and inflict 1 stack of [Otherworldly Curse] on the target each hit, [Otherworldly Curse] can be stacked up to max 30 times.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      },
      {
        "name": "Full Moon Execution",
        "description": "Dispels CC effects from self and attacks an enemy inflicted with [Full Moon Mark] 2 times, dealind 241240 M.DMG. The last hit explodes [Full Moon Mark], dealing 204678 M.DMG that ignores DEF. If the target is not a Hero, deals 503577 additional M.DMG that ignores DEF. Upon exploding [Full Moon Mark], deals 13578 additional M.DMG that ignores DEF per stack of [Otherworldly Curse]. This skill is used together with [Riheet]. If this Skill kills an enemy, Cooldown of [Silver Moon Mark] and Riheet's [Black Moon Mark] will be reset.",
        "mana": "NULL",
        "cooldown": 1,
        "order": "4_2"
      }
    ]
  },
  {
    "id": 64,
    "name": "Rodina",
    "description": "The empire's top ranking sniper, and a lover of bears. She likes them so much that she always wears accessories resembling a bear's ears on her hat. So, she'll sometimes hunts tigers, but she'll never shoot a bear. Although her shooting skills are most suitable for assassination, she swore to never use them for unjust reasons. Instead, she uses them to protect others. Currently, she lives with Pavel in the Windland Snow Mountain as his personal guard delegated by the empire.",
    "type_dmg": "Physical",
    "slug": "rodina",
    "role_id": "mechanic",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 1157176,
        "ATK": 25416,
        "P.DEF": 5376,
        "M.DEF": 4392
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Crit DMG": 50,
        "Penetration": 100,
        "ACC": 200,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Penetration Shot",
        "description": "Upon activation, takes up a stance and starts casting. After casting ends, deals 217946 P.DMG upon enemies in a straight line. DMG is increased by 150% in proportion to the total casting time. If casting progresses beyond the 3rd stage, knock over enemies.",
        "mana": 2,
        "cooldown": 11,
        "order": 1
      },
      {
        "name": "Target Aim",
        "description": "Target receives 50% increased damage from this hero. In addition, own ATK is increased by 26833.",
        "mana": 2,
        "cooldown": 15,
        "order": 2
      },
      {
        "name": "Focused Fire",
        "description": "Fires 10 shots at random. Deals 175615 DMG upon attack, and per each attack, DMG is increased by 10%.",
        "mana": 3,
        "cooldown": 25,
        "order": 3
      },
      {
        "name": "Rapid Shot",
        "description": "Every 10 sec, attacks the target 2 times, dealing a total of 492616 P.DMG.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 65,
    "name": "Roi",
    "description": "He is Cleo's escort and is protecting her at Dominiks's request. A former member of a group of assassins, he risked his life and went rogue for some unknown reason. Having lived as an assassin, he rarely shows much respect toward others, but his hardships have made him an experienced and shrewd man who treats those who help him with fairness.",
    "type_dmg": "Physical",
    "slug": "roi",
    "role_id": "assassin",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1384992,
        "ATK": 24688,
        "P.DEF": 7816,
        "M.DEF": 6840
      }
    ],
    "add_stats": [
      {
        "Crit": 200,
        "Crit DMG": 30,
        "ACC": 100,
        "P.Dodge": 200,
        "M.Dodge": 200,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Merciless",
        "description": "Attacks an enemy 3 times, dealing a total of 369080 P.DMG and increasing P.DMG the target takes 25% for 10 sec. Affterward, each hit inflicts 1 stack of [Mortal Wound] that deals 59248 P.DMG over 16 sec. [Mortal Wound] can be stacked up to max 5 times.",
        "mana": 2,
        "cooldown": 8,
        "order": 1
      },
      {
        "name": "Curtain of Darkness",
        "description": "Increases all allies' ATK by 81214 and, P.Dodge by 250 for 10 sec. Affterward, Roi grants [Specter's Breath] upon self for 10 sec. For the duration of [Specter's Breath]. increases own ATK Spd by 250, DMG dealt to enemies by 20%, and evades all P.DMG attacks.",
        "mana": 2,
        "cooldown": 15,
        "order": 2
      },
      {
        "name": "Blade Claw",
        "description": "Moves behind the enemy deals 303167 P.DMG. Consumes stack of [Mortal Wound] from the target, adding 34020 P.DMG for every 1 stack. Upon a Crit Hit, recovers 2 orbs of Mana and resets Cooldown of [Hack].",
        "mana": 3,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Hack",
        "description": "Increases Crit Chance by 300. If a normal attack is landed as a Crit Hit, attacks the target 6 times, dealing a total of 218070 additional P.DMG and inflicting a stack of [Mortal Wound] with a 50% chance.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 66,
    "name": "Scarlet",
    "description": "King Veroglance the Second of Orvelia grew weaker by the day. He was once a stout monarch whom no one dared to cross. However, he, too, began to show weakness with age. When he finally fell ill, those with aspirations of power began gathering around him like flies. Scarlet tried her hardest to protect her father in this chaos. But the man being swayed by the flatterers around him was no longer the respected king she once knew. The king turned his back on his daughter's pleas. The nobles were unhappy to accept her, the king's only child, as the next queen, to say the least. The atmosphere of the royal palace darkened quickly. She knows. The nobles would pressure her incessantly. But she would never yield. She is prepared to fight to protect her kingdom, to protect her people. She would never let those who are greedy for power to take control of the kingdom. No matter what...",
    "type_dmg": "Physical",
    "slug": "scarlet",
    "role_id": "warrior",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1449520,
        "ATK": 22488,
        "P.DEF": 7328,
        "M.DEF": 8792
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Penetration": 150,
        "ACC": 100,
        "P.Dodge": 100,
        "M.Dodge": 100,
        "CC Resist": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Halt!",
        "description": "Attacks all frontal enemies, dealing 219087 P.DMG and knocking them down for 3 sec. If the target is not a Hero, deals 219087 additional P.DMG. Heals HP equal to 30% of DMG dealt.",
        "mana": 3,
        "cooldown": 8,
        "order": 1
      },
      {
        "name": "Justice Served!",
        "description": "Dispels negative effects of all allies and dispels positive effects of all enemies, while dealing 162091 P.DMG.",
        "mana": 2,
        "cooldown": 18,
        "order": 2
      },
      {
        "name": "Sword of Honor!!",
        "description": "Attacks an enemy 3 times, dealing a total of 273993 P.DMG. Fires an energy blast from the sword, dealing 249231 P.DMG to enemies in a straight line, blinding them for 5 sec.",
        "mana": 4,
        "cooldown": 22,
        "order": 3
      },
      {
        "name": "Goddess of War",
        "description": "Increases own All Crit Resistance increases by 150. Normal attacks have a 10% chance of dealing 101513 additional P.DMG and inflicting Stun on the target for 1 sec. Each hit increases P.DMG the target takes by 3%. This effect can be stacked up to max 10 times.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 67,
    "name": "Selene",
    "description": "This noble Elven princess admires the Holy Sword and its chosen warrior. She strives as much as she can to do what's right, and wants others to do the same. This is why she offers genuine criticism to anyone who strays from the path of righteousness, even if it's the Warrior of the Holy Sword. Unfortunately, her stout resolve is sometimes taken the wrong way by others. She often visits her younger sister Dosarta at her tower to keep her company.",
    "type_dmg": "Physical",
    "slug": "selene",
    "role_id": "archer",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 1066728,
        "ATK": 27864,
        "P.DEF": 5376,
        "M.DEF": 4392
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Penetration": 250,
        "ACC": 100,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Arrow Rain",
        "description": "Shoots 12 arrows to random enemies and deals a total of 695184 P.DMG.",
        "mana": 3,
        "cooldown": 8,
        "order": 1
      },
      {
        "name": "Rush",
        "description": "Upon attacking, summons 5 arrows that launch towards the enemy. Each arrow deals 126345 P.DMG.",
        "mana": 1,
        "cooldown": 6,
        "order": 2
      },
      {
        "name": "Moonlight Flash",
        "description": "Fires an arrow in a straight line, dealing P.DMG to all enemies in range based on the target's remaining HP. Deals a maximum of 738818 P.DMG and knocks down the target. Against Bosses, deals additional 275160 P.DMG that ignores DEF.",
        "mana": 4,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Moonlight Arrow",
        "description": "Upon attacking, increases ATK by 5696 and Crit Chance by 100 for 10 sec. This effect stacks up to 3 times.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 68,
    "name": "Seria",
    "description": "The 101st Heir of ShadowHilt and the sister of Erze. People call her cold-blooded for her unfriendly attitude, but she used to be all smiles when she was around her beloved sister, Erze. Seria always felt sorry for her feeble sister and was overprotective of her, without realizing that it was actually putting Erze in greater despair. One day, Erze fell into a trap during a mission. She was saved, but her sickness started to worsen dramatically. Meanwhile, Seria was sent to Windland Snow Moutain to follow the traces of the Vampire Princess. She had a glimpse of what was going on with her sister, but she left for the top-priority mission, praying that she was wrong. However, the tragedy struck the sisters is if mocking Seria's prayers.\n- Oh my beloved sister, Seria!\nSeria returned to find the corpses of her comrades lying on the ground, cold as ice. Erze welcomed her with two sharp fangs, thirsting for blood. Seria trembled with waves of emotions. Her heart was breaking, yet she spoke in a cold, calm tone.\n- You....you are not my little sister anymore. You're a filthy bloodsucker.",
    "type_dmg": "Magic",
    "slug": "seria",
    "role_id": "warrior",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1449520,
        "ATK": 22488,
        "P.DEF": 7328,
        "M.DEF": 8792
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Penetration": 150,
        "ACC": 100,
        "P.Dodge": 100,
        "M.Dodge": 100,
        "CC Resist": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Mysterious Sword - Falling Petals",
        "description": "Performs a horizontal slash to the front and deals 181520 M.DMG to the target and enemies in a narrow range. Can activate [Mysterious Sword - Blossom] once within 5 sec after use.",
        "mana": 1,
        "cooldown": 7,
        "order": 1
      },
      {
        "name": "Mysterious Sword - Blossom",
        "description": "Performs a vertical slash to the front and deals 193079 M.DMG to the target and enemies in a narrow range.",
        "mana": 1,
        "cooldown": 0,
        "order": "1_2"
      },
      {
        "name": "Blood Scattering Blade",
        "description": "Rapidly charges forward to deal 32677 M.DMG and inflicts irremovable Original Sin of Blood on enemies for 3 sec. Enemies under Original Sin of Blood have their ATK Spd reduced by 300. Shortly afterward, attacks enemies under Original Sin of Blood 2 times, and deals additional 108184 M.DMG, and if the target is not a hero, deals additional 105928 DEF Ignoring M.DMG.",
        "mana": 2,
        "cooldown": 13,
        "order": 2
      },
      {
        "name": "Red Moon Blade",
        "description": "Brandishes a moon-bloodying sword, dealing 423175 M.DMG to enemies in a wide range. If the target is not a Hero, deals 272537additional  M.DMG that ignores DEF. When the moon is full, gains Moonlight for 1 sec, and when cast at this state, deals 467966 M.DMG to enemies and reduces their Heal Rate by 100%. If the target is not a hero, deals 286320 additional M.DMG that ignores DEF. While using the Skill, Seria is not affected by changes in ATK Spd.",
        "mana": 4,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Cold-Blooded Witch",
        "description": "Increases ATK by 43455. Upon a Criti Skill hit, own Crit DMG by 10% and DMG dealt to Non-Hero enemies by 1%. This effect can be stacked up to max 15 times and is irremovable.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 69,
    "name": "Shamilia",
    "description": "A powerful Demon who used to be one of the officers serving Dark Lord Angmund. She is capable of holding all of the curses in the world. But her real goal isn't the resurrection of the Dark Lord, nor world domination. Everything that happens in the world is a part of a drama, and she thinks of herself as the audience. Her actions are like that of a scriptwriter who revises the scenario, pulling the strings from the shadows and looking forward to how the scenes she's written play out.",
    "type_dmg": "Magic",
    "slug": "shamilia",
    "role_id": "archer",
    "position": "Middle",
    "base_stats": [
      {
        "Max HP": 1066728,
        "ATK": 27864,
        "P.DEF": 5376,
        "M.DEF": 4392
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Penetration": 250,
        "ACC": 100,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Curse of Petrification",
        "description": "Attacks an enemy dealing 219192 M.DMG and inflicting Curse of Petrification for 3 seconds that can't be dispelled. The enemy under the Curse of Petrification will have ATK Spd reduced by 200 , and this effect gets stronger up to max 600% as time passes. When the curse ends, petrifies the target for 3 seconds.",
        "mana": 2,
        "cooldown": 12,
        "order": 1
      },
      {
        "name": "Curse of Time",
        "description": "Attacks an enemy inflicting 173941 M.DMG and also inflicts Curse of Time for 10 seconds, increasing all skill cooldown by 1.5 seconds. All skill cooldowns of the enemy under the Curse of Time increases by 1 seconds every 3 seconds.",
        "mana": 2,
        "cooldown": 18,
        "order": 2
      },
      {
        "name": "Curse of Pain",
        "description": "Attacks en enemy dealing 512927 M.DMG and inflicting knockback. Also inflicts Curse of Pain for 8 seconds, dealing a total of 390080 M.DMG over time.",
        "mana": 3,
        "cooldown": 9,
        "order": 3
      },
      {
        "name": "The Vessel of Curses",
        "description": "At the beginning of every battle, for 10 seconds, obtains The Vessel of Curses, creates a shield that cannot be canceled, and absorbs 130726 damage. For the duration of the shield, gains Immunity to CC. Upon the activation of the skill, consumes The Vessel of Curses to have 4 enemies as the target.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 70,
    "name": "Shea",
    "description": "Listening to the beautiful melody on the battlefield makes me wonder if I am truly in the middle of a battlefield.' 'I dropped the sword from my hand. All the other soldiers present also dropped their swords.' 'It felt as though the girl was in an entirely different plane of existence, removed from the rest of us.' The sensational tale of the pink-haired girl, whose sudden appearance and performance stopped the battle, quickly spread. Her beautiful, captivating melody and her demure, lovely presence has captured everyone's imagination. However, no one really knew where she came from or where she was headed. 'She seemed kind of strange to me, the way she was talking to thin air, as if there was somebody there...' Of course, some have suggested more convincing theories on the girl’s whereabouts, but her mysterious beauty has drowned out all speculation.",
    "type_dmg": "Magic",
    "slug": "shea",
    "role_id": "priest",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 1104864,
        "ATK": 23216,
        "P.DEF": 4888,
        "M.DEF": 6104
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "ACC": 100,
        "M.Block": 500,
        "M.Block DEF": 250,
        "M.Tough": 150,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Green Nature's Melody",
        "description": "Heals all allies' HP by a total 437344 over 8 times, and reduced All DMG all allies take by 35% for 8 sec. If used during [Trance] state,  this Skill's Heal Rate increases by 100% and changes the DMG Reduction Effect to 70%.",
        "mana": 2,
        "cooldown": 28,
        "order": 1
      },
      {
        "name": "Blue Wind's Song",
        "description": "Recovers  all allies Mana by a total of 640 over 8 times, heals HP of a target with max Mana by 68334, and reduces the duration of CC effects by 50% for 8 sec. If used during [Trance] state, this Skill's Mana Recovery and Heal Rate increase by 50%, and all allies will gain Immunity to CC for 8 sec.",
        "mana": 3,
        "cooldown": 28,
        "order": 2
      },
      {
        "name": "Dance of Red Passion",
        "description": "Deals a total of 297040 M.DMG to all enemies over 8 times, and increases ATK of all allies by 71244 for 8 sec. If used during [Trance] state, this Skill's DMG and ATK Boost increase by 100%, and continuously displels all enemies' positive effects.",
        "mana": 3,
        "cooldown": 28,
        "order": 3
      },
      {
        "name": "Trance",
        "description": "After Skill is used, Shea gains 1 stack of [Blissful Perfomance]. If Shea uses her next Skill when she has 3 stacks of [Blissful Perfomance], Shea consumes [Blissful Perfomance] and heals HP of all allies by 180271 and enters [Trance] state for 12 sec. [Blissful Perfomance] and [Trance] are irremovable.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 71,
    "name": "Sonia",
    "description": "A combat homunculus created by a wizard in Orvel, who used the heart of Vikal the Lightning Beast as her core. After gaining self-awareness in the creation process, she fled the laboratory and spent the next few years at Ricardo's orphanage. She is capable of casting powerful lightning magic at will. As a combat homunculus, she boasts excellent physical abilities as well. Beneath her appearance as a young girl, she is a confused war machine searching for the meaning of her existence. The wizards of the Tower of Sage bestowed her the title of 'Blue' to indicate her mastery over chant-less spell casting. However, she distrusts wizards and has no desire to associate herself with the Tower.",
    "type_dmg": "Magic",
    "slug": "sonia",
    "role_id": "knight",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1706672,
        "ATK": 19792,
        "P.DEF": 8792,
        "M.DEF": 6840
      }
    ],
    "add_stats": [
      {
        "Crit": 50,
        "P.Block": 100,
        "M.Block": 100,
        "P.Tough": 250,
        "M.Tough": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Lightning Strike!",
        "description": "Causes an electric explosion ahead, dealing 120402 M.DMG to enemies in range and placing an electric field for 3 sec. The electric field deals a total of 173690 M.DMG over 10 attacks and with 25% chance, stuns the enemy for 0.5 sec.",
        "mana": 2,
        "cooldown": 8,
        "order": 1
      },
      {
        "name": "Power of Lightning!",
        "description": "For 10 sec, ATK is increased by 56992 and all DEF is increased by 56992. While the skill is in use, each auto attack has a 30% chance of dealing extra 135344 M.DMG to 2 random enemies and stunning them for 0.5 sec.",
        "mana": 2,
        "cooldown": 20,
        "order": 2
      },
      {
        "name": "Electric Explosion!",
        "description": "Deals a total of 160542 M.DMG over 3 attacks to nearby enemies in a circular range. Then causes an Electric Explosion, dealing a total of 240804 M.DMG over 3 attacks and stunning them for 5 sec.",
        "mana": 4,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Shock",
        "description": "With every attack, injects Electricity to targets not inflicted by Shock and increases M.DMG taken by 1% for 10 sec. Electricity can be stacked up to 30 times, and the 30th stack will consume all Electricity to deal 334703 M.DMG and Shock the target for 7 sec. Enemies inflicted by Shock take 70% increased M.DMG, and when they are inflicted by Stun, the duration is increased by 0.7 sec.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 72,
    "name": "Taily",
    "description": "There exist many animal hybrids in the world, but even among those animal hybrids, the origin of the Shuti tribe is considered extraordinary. It is told that once upon a time, a valiant canine used a stone of supernatural power to create a technique that allows one to transcend the limits of the physical body temporarily. That technique was passed down to several successors, and they gathered to form the 'Shuti' tribe. They then promptly sanctified the stone that started it all, and called it the 'Lucky Stone.' They cherished the stone in their hearts, and whenever they would use the technique, they would even chant and shout the name 'Lucky Stone.' But for some unknown reason, the Lucky Stone vanished without leaving a trace, and this caused the Shuti tribe to wander endlessly in search of the stone. Even now, the Shuti tribe leads a nomadic lifestyle, moving from one place in another, to find the stone. The recovery of the stone has become the long-cherished desire of the Shuti tribe. Recently, the Shuti tribe was blessed with the advent of young Taily, a Valiant Knight Commander who has stepped up to represent her tribe, and fulfill their greatest wish. When Taily managed to inscribe the strongest seal in history onto Prochika, the iconic hammer of the Shuti tribe, Taily rose to become the hero who will finally fulfill the long-lingering wish of the tribe. Carrying the wish of her tribe on her shoulders, brave Taily sets off to find the Lucky Stone that is hiding out there in the world somewhere. Though it should be noted that Taily's journey is often interrupted by all kinds of animal hybrids who want to sabotage her journey, and Taily often finds herself straying away from the main objective because of that.",
    "type_dmg": "Physical",
    "slug": "taily",
    "role_id": "knight",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1706672,
        "ATK": 19792,
        "P.DEF": 8792,
        "M.DEF": 6840
      }
    ],
    "add_stats": [
      {
        "Crit": 50,
        "P.Block": 100,
        "M.Block": 100,
        "P.Tough": 250,
        "M.Tough": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "BOOM! Here Goes!",
        "description": "Attacks frontal enemies in a straight line, dealing 94601 P.DMG, inflicting Stun for 2 sec, and reducing All Block Chance by 350 for 8 sec. Afterward, deals 127849 P.DMG to enemies within range and knocks them down for 3 sec.",
        "mana": 2,
        "cooldown": 13,
        "order": 1
      },
      {
        "name": "Protection! Was dat Lucky Stone?",
        "description": "Dispels negative effects from self, and while charging energy, Taily takes 50% reduced DMG. When fully charged, increases own Heal Rate by 25% and All DEF by 52244 for 10 sec. If this Skill is activated with 50 or more [Emblem of Courage] stacks, applies the effect to all allies and consumes all of the [Emblem of Courage] stacks.",
        "mana": 3,
        "cooldown": 22,
        "order": 2
      },
      {
        "name": "Charge! Knight Commander Power!",
        "description": "Deals 296040 P.DMG over 5 times to nearby enemies in a circular range of self and gains [Power of da Shuti Tribe] stacks. Afterward, gathers strength and delivers a final blow, dealing 254252 P.DMG and increases All DMG the target takes by 30%+[2% per stack of Power of da Shuti Tribe] for 10 sec, and inflicts Stun for 3 sec. [Power of da Shuti Tribe] can be stacked up to max 30 times.",
        "mana": 3,
        "cooldown": 15,
        "order": 3
      },
      {
        "name": "Blessing of da Shuti Tribe!",
        "description": "When HP percentage is 30% or above, attacks nearby enemies in range every sec, dealing 115769 P.DMG. Taily gains an irremovable stack of [Emblem of Courage] each hit. Each stack of [[Emblem of Courage] increases All DEF of all allies by 707. [Emblem of Courage] can be stacked up to max 50 times. When HP percentage is 30% or below, increases own All Block Chance by 700.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 81,
    "name": "Talisha",
    "description": "Anyone who's been to the streets of Orvel has met this girl at least once. She passes on useful information to others at the Orvel Plaza, gives directions, and sometimes offers advice like a friend. She knows many people and is very experienced, but also sometimes gives others quite a shock by being friendly towards an unexpected person. Though she looks like a regular wanderer who enjoys traveling at first glance, she has a rather concrete goal; 'to see the most beautiful soul.' Ever since she was young, Talisha could see the lights of souls by using jewels. Clever Talisha soon realized that it was a special power only given to her, and she often enjoyed peeking into other people's souls. Later, she chose to be an information dealer because she could see more people, and meeting more people meant more lights of souls. As time passed, she became more and more skilled as an information dealer and soul appraiser. She learned that the best jewels to appraise souls were crystals imbued with mana. The more mana there was, the better she could see, and the more souls she appraised, the brighter the gem shone. She also learned that the colour of people's souls never stayed the same, and were constantly changing. Talisha, captivated by the beautiful colour and hues of the souls, wanted to appraise even more souls. She wanted to see the constantly changing brilliance of the souls and the momentary flash of glittering light with her very own eyes. In order to do that, she needed crystals that were imbued with lots of mana. Naturally, those kind of crystals were very rare and expensive. Talisha gave out information to gather crystals and people, and sometimes she herself would set out to find the source of some rumors. In the process, she once worked in a partnership with 'the owner of the Gold Bar', but due to a particular event, they became quite hostile towards each other, and ended up not even being able to stand hearing the other' name. Of course, to Talisha, that was just one of the 'small things' that happened during her journey. Talisha met Dosarta, who waits for the day when she can finally leave the Tower of Challenge, Turan, who Talisha considers a sister, a noble lady who she briefly met in Penteonia, Evan, the kind alchemist, and the energetic Commander Taily... Talisha saw the colour of all their souls and committed every one of them to memory. Even the soul of the Gold Bar's owner, whom she didn't even want to think about. Talisha was content with her life, and firmly believed she would be happy if she could continue to travel and see souls. But one day, she came across a particular gossip. It was a rumor that The Crystal of Blue Water, which had never been seen before and was treated as an old legend, had finally appeared. In Talisha's content life, a single question started to form. What would she be able to see if she looked at a soul with that crystal? If she saw the world's most beautiful soul with it, how brilliantly would those colours shine? Talisha made a decision. She promised herself that she would get her hands on that crystal by any means, and see the most brilliant flash of light.",
    "type_dmg": "Magic",
    "slug": "talisha",
    "role_id": "archer",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 1066728,
        "ATK": 27864,
        "P.DEF": 5376,
        "M.DEF": 4392
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Penetration": 250,
        "ACC": 100,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Radiance of Cimatis",
        "description": "Deals 262231 M.DMG to the target and neartby enemies. Upon attacking the same target with this skill within 7 sec, deals 239939 additional M.DMG that ignores DEF. Cooldown will be applied every time this Skill is used 2 times.",
        "mana": 2,
        "cooldown": 17,
        "order": 1
      },
      {
        "name": "Dance of Luberry",
        "description": "Attacks the target and nearby enemies within a small range 9 times, dealing a total of 388116 M.DMG and inflicting Stun on the target for 1 sec each hit. If the target is a boss, the last hit deals 172346 additional M.DMG that ignores DEF.",
        "mana": 2,
        "cooldown": 6,
        "order": "1_2"
      },
      {
        "name": "Splendor of Cimatis",
        "description": "Explodes Cimatis around the target, dealing 193125 M.DMG and creating [Splendor of Cimatis] for 10 sec. [Splendor of Cimatis] recovers Mana of allies within range by 400 every sec and deals 30703 M.DMG to enemies within range every sec.",
        "mana": 3,
        "cooldown": 25,
        "order": 2
      },
      {
        "name": "Full Bloom of Luberry",
        "description": "Explodes Luberry in front of self, healing HP of allies within range by 147415 and creating [Full Bloom of Luberry] for 10 sec. [Full Bloom of Luberry] heals HP of all allies within range by 25825 every sec and reduces ATK of Enemies within range by 30%.",
        "mana": 3,
        "cooldown": 25,
        "order": "2_2"
      },
      {
        "name": "Crystal of Resonance",
        "description": "Talisha projects Light of Luberry to the crystal she owns, healing own HP by 101047 and changes [Radicance of Cimatis] and [Splendor of Cimatis] to [Dance of Luberry] and [Full Bloom of Luberry] respectively. Upon using this Skill again, Talisha projects Light of Cimatis to the crystal and recovers Mana by 500.",
        "mana": 1,
        "cooldown": 9,
        "order": 3
      },
      {
        "name": "Brilliant Gemologist",
        "description": "Talisha appraises a gem, increasing ATK by 6170 and DMG dealt to non-Hero enemies by 1% every sec. This effect can be stacked up to max 30 times.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 73,
    "name": "Tanya",
    "description": "An assassin of the Laughing Mask, and Roi's colleague. Although she has a physical advantage over Roi as a Half-Elf, she lacks his worldly wisdom and his ability to connect with others, traits that made him crucial in large-scale operations. This has given her something of an inferiority complex. As the 'Cleaner' of the organization, she was tasked with eliminating any traitors. When Roi abandoned the organization, she set out to chase him to figure out his motivation, leaving all her other tasks behind. Her plans after finding him remain to be seen.",
    "type_dmg": "Physical",
    "slug": "tanya",
    "role_id": "assassin",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1384992,
        "ATK": 24688,
        "P.DEF": 7816,
        "M.DEF": 6840
      }
    ],
    "add_stats": [
      {
        "Crit": 200,
        "Crit DMG": 30,
        "ACC": 100,
        "P.Dodge": 200,
        "M.Dodge": 200,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Target Sighted",
        "description": "Increases P.DMG the enemy with the lowest P.DEF takes by 30% for 10 sec, and moves behind the target, dealing 167461 P.DMG and knocking it down for 2 sec. If used during Stealth, 150% increased Crit DMG applies, and Stealth is dispelled. If Skill is used while not in Stealth, becomes Stealth for 10 sec.",
        "mana": 2,
        "cooldown": 8,
        "order": 1
      },
      {
        "name": "Blade Tornado",
        "description": "Attacks nearby enemies 3 times and deals a total of 333339 P.DMG, inflicting 1 stack of Bleed per each hit. If used in a Stealth state, target's heal rate is reduced by 70%, and Stealth is dispelled. If Skill is used while not in Stealth, becomes Stealth for 10 sec.",
        "mana": 2,
        "cooldown": 14,
        "order": 2
      },
      {
        "name": "Whisper of Death",
        "description": "Attacks a random enemy 6 times and deals a total of 947466 P.DMG, then deals an extra that deals 297146 P.DMG. If used during Stealth, dispels positive effects from the Target, and Stealth is dispelled. If Skill is used while not in Stealth, becomes Stealth for 10 sec.",
        "mana": 3,
        "cooldown": 18,
        "order": 3
      },
      {
        "name": "Silent Ambush",
        "description": "Increases Crit Chance by 300 and Dodge by 300 during Stealth. Upon a Critical Skill Hit, deals 69004 additional P.DMG to the enemy and inflicts Silence for 2 sec. If the target is not a Hero, deals 48199 additional P.DMG that ignores DEF and reduces the target's ATK Spd by 200 for 10 sec.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 74,
    "name": "Theo",
    "description": "A knight who served the Republic of Gray 100 years ago, and an admirer of Jane Gray. Theo was the First Knight of the Republic and the wielder of the Lightning Legios. During the Duchy's battle against the Demon Army, the Mountain Fortress went on a rampage when its seal was lifted. Under Jane's order, Theo set out to contain it. In his absence, powerful Demon officers attacked the royal palace. Theo returned to fight them despite heavy injury, but was unable to defeat them by himself. When the battle was over, he held the body of the princess in his arms and cried out from the ruins of the palace. Suddenly, a mysterious entity offered him a chance to defend his princess for all eternity. When he accepted, he fell into a deep slumber.",
    "type_dmg": "Magic",
    "slug": "theo",
    "role_id": "warrior",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1449520,
        "ATK": 22488,
        "P.DEF": 7328,
        "M.DEF": 8792
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Penetration": 150,
        "ACC": 100,
        "P.Dodge": 100,
        "M.Dodge": 100,
        "CC Resist": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Final Crash",
        "description": "Attacks 16 times, dealing a total of 361408 M.DMG to enemies in range. Upon each Crit Hit, Crit DMG is increased by 3% for 10 sec, and there is a 30% chance to deal 23776 extra M.DMG, inflicting stun for 0.3 sec. Crit DMG boost can be stacked up to 30 times max.",
        "mana": 2,
        "cooldown": 12,
        "order": 1
      },
      {
        "name": "God of Lightning",
        "description": "Upon casting, activates 'God of Lightning' and throws a spear of lightning at the enemy, dealing 221647 M.DMG. Hit enemy takes 50% increased M.DMG for 10 sec. While in 'God of Lightning' state, increases activation chance of 'For Jane' is increased by 40% and ATK is increased by 71244 for 15 sec.",
        "mana": 2,
        "cooldown": 20,
        "order": 2
      },
      {
        "name": "Lightning Explosion",
        "description": "Jumps and strikes, thrusting the spear to the ground and hitting target enemy and enemies in range 5 times, dealing a total of 346445 M.DMG and inflicting Stun for 3 sec.",
        "mana": 3,
        "cooldown": 22,
        "order": 3
      },
      {
        "name": "For Jane",
        "description": "Each auto attack has a 20% chance of dealing 122422 M.DMG and inflicting Stun for 0.7 sec.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 75,
    "name": "Veronica",
    "description": "A genius scholar from the Tower of Sage who remembers everything she sees. After developing her own theories and systems of Rune Magic, she quickly grew bored and moved onto a different subject. Soon, she was appointed as the highest ranking royal secretary of finance. Unfortunately, many politicians refused to accept a commoner as their superior. After many lies and ill rumors, Veronica eventually decided to leave the palace on her own. But this was hardly a defeat for her, and she soon set out to conquer a new path. She headed to the Orvel Guild Alliance, where she would be measured only by her abilities and nothing else. As expected, her incredible perception and analytical skills made her an indispensable asset to numerous guilds.",
    "type_dmg": "Magic",
    "slug": "veronica",
    "role_id": "wizard",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 985328,
        "ATK": 29328,
        "P.DEF": 3904,
        "M.DEF": 5864
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "Penetration": 150,
        "ACC": 100,
        "M.Dodge": 200,
        "M.Block": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "This will hurt a little!",
        "description": "Deals 215290 M.DMG to enemy and surrounding enemies within range, and inflicts Stun for 2 sec.",
        "mana": 2,
        "cooldown": 9,
        "order": 1
      },
      {
        "name": "Let me help you.",
        "description": "Grants a Rune to all allies to increase their ATK by 56992 and any DMG to bosses by 15% for 12 sec.",
        "mana": 4,
        "cooldown": 25,
        "order": 2
      },
      {
        "name": "Get out of my sight!",
        "description": "Attacks target and enemies in a wide surrounding area 2 times to deal 392862 M.DMG, and knocks them down for 5 sec. Hit enemies take 30% increased M.DMG for 10 sec.",
        "mana": 4,
        "cooldown": 25,
        "order": 3
      },
      {
        "name": "Top Financier's Knowledge",
        "description": "Increases ATK of all allies by 5696 and gains Experience stack upon using a Skill. When 3 Experiences are stacked, gains Top Financier's Knowledge that increases own Crit DMG by 30% and the effects of all active Skills by 10%. The Top Financier's Knowledge effect is irremovable and stacks up to 5 times.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 76,
    "name": "Viska",
    "description": "A maverick among Demons who seeks to grow her own power by devouring other powerful Demons. She embodies the worst possible meaning of the word Demon. She crossed the dimensional rift to seek out and devour the Demons who traveled to the earthly realm. She placed a limit on her own power and assumed the form of a sickly young girl to further humiliate her victims. She detests weaklings who pretend to be strong. On the other hand, she respects those who recognize their own weaknesses and risk their lives in the pursuit of strength.",
    "type_dmg": "Magic",
    "slug": "viska",
    "role_id": "warrior",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1449520,
        "ATK": 22488,
        "P.DEF": 7328,
        "M.DEF": 8792
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Penetration": 150,
        "ACC": 100,
        "P.Dodge": 100,
        "M.Dodge": 100,
        "CC Resist": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Meal Time!!",
        "description": "Deals 217775 M.DMG to frontal enemies in range. For 10 sec, Hit enemies' ATK is reduced by 25% for and own ATK is increased by 42740. If used while holding 3 or more stacks of Soul, shackles the enemy for 3 sec.",
        "mana": 2,
        "cooldown": 8,
        "order": 1
      },
      {
        "name": "I'll slice you up!!",
        "description": "Moves behind the target, dispelling positive effects and dealing 184564 M.DMG, increases M.DMG the target takes by 25% for 15 sec, and knock it down. If used while holding 3 or more stacks of Soul, reduces enemy M.DEF by 30% for 15 sec.",
        "mana": 2,
        "cooldown": 10,
        "order": 2
      },
      {
        "name": "I'll rip you to pieces!!",
        "description": "Deals 343869 M.DMG to enemies in a wide surrounding area, and inflicts Stun for 3 sec. If used while holding 5 stacks of Soul, consumes all stacks to reset the cooldown of this skill.",
        "mana": 4,
        "cooldown": 18,
        "order": 3
      },
      {
        "name": "Yummy Souls!",
        "description": "Enemies attacked with Viska's skills lose Souls. Upon losing their Soul, targets take 32032 extra M.DMG, and per each soul stacked, Viska's HP is healed by 63853 and Mana is healed by 300. Souls last until they are used, can't be dispelled and can be stacked up to 5 times max.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 77,
    "name": "Xerah",
    "description": "A girl that the Tidhar created to discretely impose their will on the world. She hides her identity, conceiling herself amidst the shadows, operating among regular people. Her main purpose is to gather the power of darkness for the advent and find a vessel to contain it. She did find an ideal vessel from the ancient kingdom of Sekireinel and a certain mighty-being thwarted her plans. But Xerah was not frustrated nor disappointed. The longer it took, the more she'll enjoy destroying this world.",
    "type_dmg": "Magic",
    "slug": "xerah",
    "role_id": "wizard",
    "position": "Middle",
    "base_stats": [
      {
        "Max HP": 985328,
        "ATK": 29328,
        "P.DEF": 3904,
        "M.DEF": 5864
      }
    ],
    "add_stats": [
      {
        "Crit": 100,
        "Penetration": 150,
        "ACC": 100,
        "M.Dodge": 200,
        "M.Block": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Orbs of Darkness",
        "description": "Throws 6 orbs of darkness, dealing a total of 350658 M.DMG to a random enemy and enemies in a circular range of the target. When Xerah is in [Darkness Awakened] state, increases DMG of [Orbs of Darkness] by x2, and reduces Cooldown by 100%. [Crest of Extortion Level 1 Effect] Destroys shield from the target.",
        "mana": 2,
        "cooldown": 5,
        "order": 1
      },
      {
        "name": "Crest of Extortion",
        "description": "Dispels negative effects from self and casts Crest of Extortion that lasts permanently on self. If Xerah already possesses a Crest of Extortion, the level of Crest of Extortion increases instead. [Crest of Extortion] Deals 189967 M.DMG to a random enemy every 5 sec. Level 1: Adds an additional effect to [Orbs of Darkness] Skill. Level 2: Effect activation interval changes to 4 sec, and adds an additional effect to [Blood Moon] Skill. Level 3: Effect activation interval changes to 3 sec, and [Crest of Extortion] Skill changes to [Crest Bestowal] Skill.",
        "mana": 3,
        "cooldown": 17,
        "order": 2
      },
      {
        "name": "Crest Bestowal",
        "description": "Upon use, dispels negative effects from self and bestows the power of the Crest of Extortion to an ally with the lowest HP. The ally instantly recovers 1 orb of Mana, heals its HP by a total of 515420 for 5 sec, and gains Immunity to CC.",
        "mana": 2,
        "cooldown": 17,
        "order": "2_2"
      },
      {
        "name": "Blood Moon",
        "description": "Creates a [Blood Moon] for 10 sec. For the duration of Blood Moon, increases ATK of all allies by 80740, reduces DMG taken by 20%, deals a total of 850510 M.DMG to all enemies, and reduces their Heal Rate by 50%. [Crest of Extortion Level 2 Effect] Boosts the effect all allies receive by x2.",
        "mana": 4,
        "cooldown": 25,
        "order": 3
      },
      {
        "name": "Darkness Awakened",
        "description": "Upon using a Skill, if Xerah is not in Darkness Awakened state, gains an irremovable stack of [Darkness]. Upon gaining 4 [Darkness] stacks, Xerah consumes the stacks to enter [Darkness Awakened] state that is irremovable for 10 sec, increasing Lifesteal by 200 and dealing 50% increased DMG to Non-Hero enemies. When Xerah takes fatal DMG while in [Darkness Awakened] state, [Darkness Awakened] becomes deactivated, consumes entire Mana of self, and heals HP by 30%. Afterward, Xerah cannot gain any Darkness stacks for 10 sec.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 78,
    "name": "Yanne",
    "description": "A Barbarian warrior who specializes in dealing with monsters that threaten people. Thanks to a unique physical trait, her muscular strength is several times stronger than that of a normal Barbarian warrior. She wields a greatbow larger than her own body with such ease that people call her a walking siege weapon. While she is a kindhearted woman who enjoys helping others, once engaged in a combat, her Barbarian aggressiveness begins to surface. She once slayed a mad dragon named Svelta, a feat that earned her the nickname Dragon Slayer.",
    "type_dmg": "Physical",
    "slug": "yanne",
    "role_id": "archer",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 1066728,
        "ATK": 27864,
        "P.DEF": 5376,
        "M.DEF": 4392
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Penetration": 250,
        "ACC": 100,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Focus Shot!",
        "description": "Taking up a stance, focuses for a while and deals 226461 P.DMG to enemies in a straight line. If the target is a dragon, inflicts Stun for 3 sec. The longer she focuses, DMG and Stun duration are increased by 100%.",
        "mana": 2,
        "cooldown": 9,
        "order": 1
      },
      {
        "name": "Wipeout!",
        "description": "Deals 314476 P.DMG to target enemy and other enemies in range. If the target is a Dragon, deals 250496 extra DMG that ignores DEF.",
        "mana": 3,
        "cooldown": 10,
        "order": 2
      },
      {
        "name": "No Holding Back!",
        "description": "Dispels all negative effects from self. For 30 sec, ATK is increased by 36096 and Penetration by 500. For the duration of skill, normal attacks consume 3% Mana to deal DMG to all enemies in a straight line and deals 41796 additional P.DMG that ignores DEF to Dragons. This effect is irremovable.",
        "mana": 4,
        "cooldown": 25,
        "order": 3
      },
      {
        "name": "Dragon Slayer",
        "description": "ATK is increased by 10685 , and Max HP is increased by 30%. Also, DMG dealt to Dragons is increased by 100%.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 79,
    "name": "Yuria",
    "description": "If one asks who the most famous tailor is in Orbis Continent, most people won't know who to name. However, those who know a thing or two about clothing will never fail to bring up Yuria's name. Yuria, a tailor from Penteonia, always has two conditions that she sets when accepting requests. First, the client needs to allow Yuria to spend some time with the client so that she draws inspiration as to what kind of clothing she would make. Second, while she is with the client, the client must not lie or pretend to be something they are not. The first condition is for her sense of 'Foresight.' She needs to feel the client's thread of fate so she can express it through clothing. The second condition is mainly because she can sense the truth and finds lies disgusting. She doesn't want to make anything for anyone who won't be true. Her masterpieces, made with the fate she's read, are as valuable as starlight. Even the nobles would be envious of them.",
    "type_dmg": "Magic",
    "slug": "yuria",
    "role_id": "archer",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 1066728,
        "ATK": 27864,
        "P.DEF": 5376,
        "M.DEF": 4392
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Penetration": 250,
        "ACC": 100,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Binding Karma",
        "description": "Deals 285387 M.DMG that ignores M.Block to 2 enemies and reduces their Mana by 500. If the target is affected by 'Threading Destiny', deals DMG that ignores DEF, and 'Threading Destiny' will be removed.",
        "mana": 2,
        "cooldown": 12,
        "order": 1
      },
      {
        "name": "Starlight Sewing",
        "description": "Dispels negative effects from self and casts a shield that absorbs 425964 DMG for 10 sec. While the shield active, gains immunity to CC, increases Crit Chance by 300, and increases the number of targets that Yuria attacks by 1.",
        "mana": 2,
        "cooldown": 15,
        "order": 2
      },
      {
        "name": "Circle of Fate",
        "description": "Deals 424754 M.DMG to 2 enemies, increasing the M.DMG they take by 30% for 10 sec and inflicting 'Threading Destiny' for 5 sec. Enemies under 'Threading Destiny' have their ATK Spd reduced by 250.",
        "mana": 3,
        "cooldown": 12,
        "order": 3
      },
      {
        "name": "Blessing of Truth",
        "description": "Increases own All DEF by 9737 and ATK Spd by 300. Normal attacks hit 2 enemies. Every normal attack inflicts a stack of 'Stigma of Stars' upon enemies. Targets take 1% increased M.DMG for every stack of 'Stigma of Stars'. This effect can be stacked up to max 15 times and is irremovable.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 80,
    "name": "Zafir",
    "description": "A Prince and successor to the God King of the ancient desert kingdom who possesses the power to control desert sand. As the young leader of the Mauhata tribe of Desert Warriors, he has been trained and educated to be the worthy successor to the great king. When the Trovatia tribe, their sworn brothers, were praying at the Shrine of Flow to awake the God Dragon, he led his warriors to defeat all demons approaching the oasis. Assisted by the God Dragon and Laudia, her priestess, he is fulfilling his role as a Desert Warrior defending his home. He hopes that his efforts make the late God King proud.",
    "type_dmg": "Physical",
    "slug": "zafir",
    "role_id": "archer",
    "position": "Back",
    "base_stats": [
      {
        "Max HP": 1066728,
        "ATK": 27864,
        "P.DEF": 5376,
        "M.DEF": 4392
      }
    ],
    "add_stats": [
      {
        "Crit": 150,
        "Penetration": 250,
        "ACC": 100,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Judgment of the Desert",
        "description": "Deals 182140 P.DMG to enemies in a wide range, and per each enemies hit, reduces Cooldown by 1 sec. Deals 364309 P.DMG to enemies inflicted by [Mark of Desert] and removes 1 stack of [Mark of Desert]. Upon each Skill use, Crit DMG is increased by 5%. This effect can be stacked up to max 18 times and is irremovable.",
        "mana": 2,
        "cooldown": 5,
        "order": 1
      },
      {
        "name": "Blessing of the Sand Spirit",
        "description": "Creates a shield around the ally with the lowest HP that absorbs 534273 DMG for 5 sec. Gains immunity to CC while the shield lasts. When the shield duration is over, 'Sand Storm' is activated and deals 261124 P.DMG to enemies in a wide range, inflicting 2 stacks of [Mark of Desert]. If the shield is dispelled or destroyed, 'Sand Storm' does not activate.",
        "mana": 2,
        "cooldown": 14,
        "order": 2
      },
      {
        "name": "Doom of the Desert",
        "description": "Deals 123855 P.DMG to frontal enemies in a wide range and inflicts 1 stack of [Mark of Desert]. Then summons 'Pit of Sand' for 5 sec, dealing 41350 P.DMG every 0.5 sec, and decreasing their P.DEF by 30% for 10 sec. 'Pit of Sand' has a 25% chance of inflicting 1 stack of [Mark of Desert] and draws in all enemies in range to the center.",
        "mana": 3,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Calling of the Guardian",
        "description": "Each auto attack has a 15% chance of dealing 96597 P.DMG that ignores DEF to all enemies, inflicting 1 stack of [Mark of Desert]. [Mark of Desert] can be stacked up to max 10 times.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  },
  {
    "id": 99,
    "name": "Shakmeh",
    "description": "The second prince of Ancient Sekireinel Kingdom who abandoned the desert and chose otherwordly darkness. He emerged as a threat to the world but was defeated by the new successor of the desert. However, he was born again with the fragment of darkness that remained from being the vessel of Tidhar. It is unclear whether he is fully Shakmeh himself or one of the Tidhar, the otherwordly Darkness, but his twisted obsession toward his brother, Cain, persists and serves as proof that he is, in fact, Shakmeh. Shakmeh's life until now was covered in dark emotions, but after being reborn, he wishes to move forward by obtaining a greater power of darkness to destroy Aegina Desert and surpass Cain. Though Shakmeh is aware better than anyone what the path he chose means, he has made up his mind not to hesitate or falter no matter what direction the results will lea him - for he has become the one who walks inside the darkness.",
    "type_dmg": "Physical",
    "slug": "shakmeh",
    "role_id": "knight",
    "position": "Front",
    "base_stats": [
      {
        "Max HP": 1706672,
        "ATK": 19792,
        "P.DEF": 8792,
        "M.DEF": 6840
      }
    ],
    "add_stats": [
      {
        "Crit": 50,
        "P.Block": 100,
        "M.Block": 100,
        "P.Tough": 250,
        "M.Tough": 250,
        "ATK Spd": 1000
      }
    ],
    "skill": [
      {
        "name": "Wind of Heart",
        "description": "Attacks frontal enemies in a straight line, dealing a total of 282970 P.DMG over 5 times. Each hit recovers self's Mana by 100.",
        "mana": 2,
        "cooldown": 13,
        "order": 1
      },
      {
        "name": "Gate of Grudges",
        "description": "Creates [Gate of Grudges] in frontal of self for 7 sec, dealing a total of 463092 P.DMG to enemies in range. Each hit inflicts a stack of [Grudge] that lasts for 15 sec on enemies. [Grudge] can be stacked up to max 5 times, and each stack reduces the target's Heal Rate by 4%. If the target is not a Hero, Heal Rate Reduction is increased by 2 times.",
        "mana": 3,
        "cooldown": 20,
        "order": 2
      },
      {
        "name": "Advent of Despair",
        "description": "Dispels negative effects from self and consumes all [Dark Spirit] stacks to increase all allies' ATK by 10% + 0.5% per [Dark Spirit] stack for 15 sec, deal 201864 additional P.DMG to all enemies, inflict Stun for 3 sec, and increases P.DMG the targets take by 20% + 1% per [Dark Spirit] stack for 15 sec. DMG of this Skill increases by 10% per [Dark Spirit] stack. If the target is not a Hero, DMG Boost per stack increases by 2 times.",
        "mana": 3,
        "cooldown": 20,
        "order": 3
      },
      {
        "name": "Vessel of Dark Spirit",
        "description": "Increases Max HP by 20%. Dealing DMG to an enemy with a Skill deals additional P.DMG equal to 1% of self's Max HP, heals HP of all allies equal to 0.1% of self's Max HP, increases their M.DEF by 707 for 15 sec, and stacks [Dark Spirit] that lasts for 30 sec upon self. [Dark Spirit] can be stacked up to max 30 times, and is irremovable. The M.DEF Boost effect can be stacked up to max 30 timws.",
        "mana": "NULL",
        "cooldown": "NULL",
        "order": 4
      }
    ]
  }
]
