[
  {
    "name": "Noble Fate, Mahitra",
    "description": "Summons the soul of Noble Fate, Mahitra for 8 sec. While the soul is summoned, increases own Crit DMG by 50%, deals 43992 DMG to enemy every 0.5 sec, and increases M.DMG the target takes by 25% for 5 sec.",
    "charges": 7,
    "cooldown": 22,
    "charge_type": "Charges up upon Dealing DMG 120 times.",
    "advancement": "Advancement Phase 1\nIncreases the duration of the effect by 5 sec.\n\nAdvancement Phase 2\nIncreases all allies' ATK by 30% and Crit DMG by 30% for the duration of Skill."
  },
  {
    "name": "Crystallized Technomagic, Rascal",
    "description": "Summons the soul of Crystallized Technomagic, Rascal, recovering Mana of all allies by 300 every sec for 10 sec. Self activates Overcharge and increases M.DMG all enemies take by 30% for the duration.",
    "charges": 6,
    "cooldown": 22,
    "charge_type": "Charges up over 20 sec.",
    "advancement": "Advancement  Phase 1\nFully recovers Mana for the duration of skill.\n\nAdvancement Phase 2\nThe duration of Skill increases by 4 sec, and self gains immunity to CC for the duration of Skill."
  },
  {
    "name": "Clear Blue Sky, Sherrkyle",
    "description": "Summon the soul of Clear Blue Sky, Sherrkyle, dealing 111456 M.DMG to all enemies and marks Judgement Sigil for 15 sec. Afterward, increases own Crit DMG by 100% for 11 sec.",
    "charges": 6,
    "cooldown": 20,
    "charge_type": "Charges up over 18 sec.",
    "advancement": "Advancement Phase 1\nFor the Duration of Skill, reduces Cooldown of self's all Skills by 1 sec every sec.\n\nAdvancement Phase 2\nFor the duration of Skill, attacks a random enemy, dealing 83592 M.DMG every 1 sec and marking Judgement Sigil for 15 sec. If the target is already marked with a Judgement Sigil, dealing 83592 additional M.DMG that ignores DEF."
  },
  {
    "name": "Brilliant Praise, Brauxio",
    "description": "Summons the soul of Brilliant Praise, Brauxio for 8 sec, increasing all allies' ATK by 40% and DEF by 40%.",
    "charges": 6,
    "cooldown": 24,
    "charge_type": "Charges up upon dealing DMG 150 times.",
    "advancement": "Advancement Phase 1\nReduces DMG all allies take from enemies by 30% for the duration of the Skill.\n\nAdvancement Phase 2\nDispels negative effects from all allies and dispels positive effects from all enemies every 1 sec for the duration of the Skill."
  },
  {
    "name": "Solar Halo, Ignisius",
    "description": "Summons the soul of Solar Halo, Ignisius, increasing own P.DEF by 60% for 10 sec. Afterward, attacks the target and the enemies nearby within a small range 20 times, dealing a total of 118740 M.DMG. Each hit inflicts 'Judgement of Ignisius', increasing M.DMG the target takes by 2% for 5 sec. 'Judgement of Ignisius' can be stacked up to 10 times.",
    "charges": 7,
    "cooldown": 20,
    "charge_type": "Charges up upon using Skills 5 times.",
    "advancement": "Advancement Phase 1\nEach stack of 'Judgement of Ignisius' also reduces the target's M.DEF by 2%\n\nAdvancement Phase 2\nIncreases the duration of 'Judgement of Ignisius' by 5 sec, and changes the max number of stacks to 20 times."
  },
  {

    "name": "God's Book, Genesis",
    "description": "Summons the soul of God's Book, Genesis, increasing the number of targets of normal attacks to 2 for 10 sec, healing HP of all allies by 92864 and dispelling negative effects every 2 sec.",
    "charges": 5,
    "cooldown": 22,
    "charge_type": "Charges up upon using Skills 5 times.",
    "advancement": "Advancement Phase 1\nChanges Skill Activation Requirements of the Soul Weapon to 4.\n\nAdvancement Phase 2\nReduces All DMG that allies take by 30% and increases their Heal Rate by 50% for the duration of Skill."
  },
  {
    "name": "Kiln of Futility, Targarios",
    "description": "Summons the soul of Kiln of Futility, Targarios, attack all enemies every sec for 10 sec, dealing 13492 M.DMG. Whenever dealing DMG on the enemy, absorbs its power to increase DMG dealt to enemies by 2% for 10 sec. This effect stacks up to 15 times.",
    "charges": 6,
    "cooldown": 22,
    "charge_type": "Charges up upon dealing DMG 70 times.",
    "advancement": "Advancement Phase 1\nStuns the target for 1 sec.\n\nAdvancement Phase 2\nMax stacks for the effect is changed to 30."
  },
  {
    "name": "Might of the God King, Tyrannicus",
    "description": "Summons the soul of Might of the God King, Tyrannicus, dealing 175968 P.DMG to enemies within range of self, and inflicting time stop for 4 sec. Afterwards, increases own ATK by 50% for 10 sec. While time stop is active, Normal and Skill attacks cannot be used, and Cooldown is fixed.",
    "charges": 5,
    "cooldown": 22,
    "charge_type": "Charges up upon using Skills 5 times.",
    "advancement": "Advancement Phase 1\nHeals HP of allies within range by 351930 over 10 sec.\n\nAdvancement Phase 2\nDispels positiv effects of all enemies in range."
  },
  {
    "name": "Aurelian Whisper, Goldbreeze",
    "description": "Summons the soul of Aurelian Whisper, Goldbreeze for 10 sec, increasing ATK Spd of all allies by 300, dealing 46432 M.DMG to all enemies, and increasing M.DMG they take 25% for 10 sec. Upon this Skill at the Arena, inflicts Charm to all enemies for 5 sec.",
    "charges": 4,
    "cooldown": 23,
    "charge_type": "Charges up upon using Skills 4 times.",
    "advancement": "Advancement Phase 1\nChanges Skill Activation Requirements to 3 times.\n\nAdvancement Phase 2\nUpon activation, recovers Mana of all allies by 2000 and increases Crit DMG by 80% for the duration of Skill."
  },
  {
    "name": "Supersonic Tempest, Gigantix",
    "description": "Summons the soul of Supersonic Tempest, Gigantix for 12 sec. Normal and Skill attacks have a 10% chance to deal 40665 P.DMG to the target and enemies within a small range of it, inflicting stun for 1 sec.",
    "charges": 7,
    "cooldown": 22,
    "charge_type": "Charges up upon using Skills 7 times.",
    "advancement": "Advancement Phase 1\nIncreases own ATK by 40% for the duration of Skill.\n\nAdvancement Phase 2\nActivation chance is increased to 20%."
  },
  {
    "name": "Blood Lancer Monolith",
    "description": "Summons the soul of Blood Lancer Monolith, dealing 89952 P.DMG to nearby enemies of self and knocking them down for 4 sec. Afterward, recovers own HP equal to 40% of Max HP, increasing ATK by 30% and Heal Rate by 30% for 10 sec.",
    "charges": 5,
    "cooldown": 22,
    "charge_type": "Charges up upon dealing DMG 60 times.",
    "advancement": "Advancement Phase 1\nChanges the duration of the effect to 15 sec.\n\nAdvancement Phase 2\nFor the duration of Skill, increases own DMG dealt to enemies by 20%. Normal attacks have a 10% chance to stun the target for 1.5 sec."
  },
  {

    "name": "Prism Nova, Arc Lumineir",
    "description": "Summons the soul of Prism Nova, Arc lumineir for 10 sec. For the duration of the Skill, the soul attack according to the Light Chrisha owns every 3 sec.\n'Red Light' - Attacks the enemy and deals 76248 M.DMG that ignores DEF.\n'Blue Light' - Attack all enemies, dealing 50832 M.DMG and recovering all allies' 1 orb of Mana.\n'Green Light' - Attacks 2 enemies, dealing 127080 M.DMG and reducing targets ATK by 35% for 5 sec.",
    "charges": 7,
    "cooldown": 21,
    "charge_type": "Charges up upon using Skills 5 times.",
    "advancement": "Advancement Phase 1\nReduces Skill Activation Requirement to 4 times.\n\nAdvancement Phase 2\nAll effects will be enhanced.\n[Red Light] - DMG increases by 50%.\n[Blue Light] - Mana Recovery increases by 100%.\n[Green Light] - ATK Reduction changes to 50%."
  },
  {
    "name": "The Guardian, Exian",
    "description": "Summons the soul of The Guardian, Exian, increasing P.DEF of all allies by 70% for 12 sec. For the duration of the Skill, normal attacks stun the target for 1 sec.",
    "charges": 5,
    "cooldown": 25,
    "charge_type": "Charges up every sec and every time self takes DMG. This Skill can be cast upon gaining 80 charges.",
    "advancement": "Advancement Phase 1\nFor the Duration of the Skill, normal attacks reduce the target's P.DEF by 5% for 5 sec. The P.DEF reduction effect stacks up to max 7 times.\n\nAdvancement Phase 2\nUpon activation, reduces P.DMG the ally with the highest ATK takes by 80% for 6 sec, and increases ATK equal to 100% of clauses P.DEF. This effect is irremovable."
  },
  {
    "name": "Primal Flame, Flenos",
    "description": "Summons the Soul of Primal Flame, Flenos, dealing 146640 M.DMG to 5 enemies. Dealing DMG to enemies with this Skill increases DEF Penetration by 25 for 60 sec. This effect stacks up to 20 times.",
    "charges": 7,
    "cooldown": 22,
    "charge_type": "Charges up upon using Skills 6 times.",
    "advancement": "Advancement Phase 1\nIncreases DMG by 50%.\n\nAdvancement Phase 2\nIncreases DMG by 50%. Each stack grants 2.5% ATK Boost effect."
  },
  {
    "name": "Hellhound, Akistra",
    "description": "Summons the soul of Hellhound, Arkistra for 15 sec. When Crow casts [Even Gods shall die.], it deals additional 203228 P.DMG. At max charge, deals 100% increased DMG. The soul disappears after dealing DMG.",
    "charges": 3,
    "cooldown": 30,
    "charge_type": "Charges up upon using Skills 4 times.",
    "advancement": "Advancement Phase 1\nDMG is increased by 80%.\n\nAdvancement Phase 2\nFor the duration fo Skill, increases own ATK by 40%."
  },
  {
    "name": "Lake of Remembrance, Armekith",
    "description": "Summons the soul of Lake of Remembrance, Armekith, creating a tidal wave, dealing 175968 M.DMG to enemies within wide frontal range of self and knocking them down for 3 sec. Dakaris then heals 117312 HP and 1 orbs of Mana to allies within range. Afterward, absorbs the soul of Lake of Remembrance, Armekith, increasing own ATK by 60% for 10 sec.",
    "charges": 6,
    "cooldown": 20,
    "charge_type": "Charges up upon using Skills 7 times.",
    "advancement": "Advancement Phase 1\nDispels positiv effects of enemies and negative effects of allies within range.\n\nAdvancement Phase 2\nReduces Skill Activation Requirements to 5 times, and for the duration of Skill, the number of targets of [May Their Agony End!] increases to 2."
  },
  {
    "name": "Corrupted Holy Sword, Aea",
    "description": "Summons the soul of Corrupted Holy Sword, Aea for 10 sec, increasing own ATK by 50 and judging enemies upon Skill use.\n[Judgment Blade] Deals 67464 P.DMG to the enemy with the highest ATK and enemies in a circular range of the target, reducing their Mana by 1000.\n[Doom] Deals 112440 P.DMG with 500 increased DEF Penetration to the enemy with the highest ATK and nearby enemies in a circular range of the target",
    "charges": 6,
    "cooldown": 22,
    "charge_type": "Charges up upon dealing DMG 80 times.",
    "advancement": "Advancement Phase 1\nChanges Skill Activation Requirements to 60 times and Mana Reduction to 2000.\n\nAdvancement Phase 2\nChanges the duration of Soul to 15 sec and increases DMG dealt to enemies by 20% for the duration."
  },
  {
    "name": "The Blue Light, Arpheus",
    "description": "Summons the soul of The Blue Light, Arpheus, increasing all allies' P.Crit Resistance by 300 and P.Block Chance by 300 for 10 sec. Afterward, places [Mana Source of Blue Light] around self for 10 sec. For the duration of [Mana Source of Blue Light], deals a total of 98960 P.DMG to enemies within range over 9 times and reduces their Mana by 300. At the end of duration, creates an explosion that deals 118752 P.DMG and silences enemies within range for 5 sec.",
    "charges": 7,
    "cooldown": 22,
    "charge_type": "Charges up upon using Skills 4 times.",
    "advancement": "Advancement Phase 1\nAllies within [Mana Source of Blue Light] have their ATK Spd increases by 300 and recover 300 Mana every sec.\n\nAdvancement Phase 2\nContinuously dispels positive effects placed upon enemies that are within [Mana Source of Blue Light] and changes the duration of Silence to 8 sec."
  },
  {
    "name": "Tears of the Moon, Nerius",
    "description": "Summons the soul of Tears of the Moon, Nerius, dealing 111456 M.DMG to frontal enemies and inflicting them with [Curse of the Moon] for 10 sec. Targets inflicted by [Curse of the Moon] take 25% increased M.DMG and have their Heal Rate reduced by 25%. Afterward, increases own Crit DMG by 50%.",
    "charges": 7,
    "cooldown": 23,
    "charge_type": "Charges up upon using Skills 5 times.",
    "advancement": "Advancement Phase 1\nIncreases DMG by 50% and changes the M.DMG Boost effect to 45%.\n\nAdvancement Phase 2\nFor the Duration of Skill, increases own ATK by 40%."
  },
  {
    "name": "Ancient Valor, Seliere",
    "description": "Summons the soul of Ancient Valor, Seliere, increasing P.Block chance of all allies by 500 for 10 sec. Afterward, deals 39584 M.DMG near self every 3 sec and inflicts the target with Silence for 1 sec, creating a shield that grants immunity to CC and absorbs DMG equal to 300% of Dosarta's ATK for 4 sec on an ally with the lowest HP.",
    "charges": 6,
    "cooldown": 25,
    "charge_type": "Charges up upon using Skills 6 times.",
    "advancement": "Advancement Phase 1\nIncreases M.DMG the hit enemy takes by 25% for 5 sec.\n\nAdvancement Phase 2\nChanges the number of targets applied by the shield to 3."
  },
  {
    "name": "The Seductress, Guillotine",
    "description": "Summons the Soul of The Seductress, Guillotine, and increases own ATK by 40% for 8 sec. For the duration of Skill, Normal and Skill attacks have a 20% chance to deal 37032 M.DMG that ignores DEF to a target. If [Absorbing Blow] hits a target, this effect will activate with a 100% chance.",
    "charges": 6,
    "cooldown": 18,
    "charge_type": "Charges up over 18 sec.",
    "advancement": "Advancement Phase 1\nActivation chance changes to 30%, and DMG increases by 50%.\n\nAdvancement Phase 2\nThe M.DMG now ignores Block, and hit enemy takes 30% increased M.DMG for 7 sec."
  },
  {
    "name": "Essence of Greed, Perion",
    "description": "Summons the soul of Essence of Greed, Perion for 7 sec. Every Skill attack grants a stack of 'Essence of Greed'. After 7 sec, the soul explodes and deals 148128 P.DMG to all enemies. The DMG of this Skill increases by 1% for every 'Essence of Greed' stacks gained for the duration. 'Essence of Greed' can be stacked up to max 30 times.",
    "charges": 6,
    "cooldown": 15,
    "charge_type": "Charges up over 22 sec.",
    "advancement": "Advancement Phase 1\nEach stack of 'Essence of Greed' deals 2% DMG.\n\nAdvancement Phase 2\nMax number of stacks of 'Essence of Greed' increases by 30, and DMG dealt at max stack of 'Essence of Greed' increases by 150%."
  },
  {
    "name": "Wanderer's Pleasure, Lu Etrona Dice",
    "description": "Summons the soul of Wanderer's Pleasure, Lu Etrona Dice, and rolls the dice. Depending on the number of the dice's dots, immediately reduces Cooldown of Esker's next Soul Weapon use by 10% and increases ATK of all allies by 12% for 60 sec. The ATK Boost effect can be stacked up to max 5 times.",
    "charges": 7,
    "cooldown": 18,
    "charge_type": "Charges up upon using Skills 6 times.",
    "advancement": "Advancement Phase 1\nChanges the max number of stacks to 7.\n\nAdvancement Phase 2\nIncreases DEF Penetration of all allies by 50 per every stack."
  },
  {
    "name": "Small Synthesized Darkness, Naav Gehen",
    "description": "Summons the soul of Small Synthesized Darkness, Naav Gehen for 10 sec, periodically healing HP of all allies by 46432 and recovering Mana of all allies by 300 over 7 times.",
    "charges": 6,
    "cooldown": 20,
    "charge_type": "Charges up over 20 sec.",
    "advancement": "Advancement Phase 1\nIncreases Heal Rate by 40% and changes Mana Recovery to 500.\n\nAdvancement Phase 2\nPeriodically reduces Evan's Skill Cooldown by 2 sec."
  },
  {
    "name": "Jailer of Despair Barbatos",
    "description": "Summons the soul of Jailer of Despair, Barbatos for 12 sec, dealing 111096 M.DMG to nearby enemies within a circular range of self, increasing own ATK by 50%. For the duration of Skill, if Ezekiel is in Fury State, he can still be controlled and will not consume HP upon Skill use. After Skill use, gains 1 stack(s) of Cursed Blood. Cursed Blood stacks gained from this Skill can also be gained during Fury State.",
    "charges": 6,
    "cooldown": 18,
    "charge_type": "Charges up upon using Skills 6 times.",
    "advancement": "Advancement Phase 1\nGains 1 additional Cursed Blood stack(s).\n\nAdvancement Phase 2\nFor the duration of Skill, increases own DMG dealt to enemies by 30%."
  },
  {
    "name": "Angel's Despair, Rosmerta",
    "description": "Summons the soul of Angel's Despair, Rosmerta, increasing DMG of Heaven's Vengeance by 50% for 10 sec, and applies [Angel's Despair] to all enemies, reducing their ATK by 25%. Afterward, delivers [Judgement of the Fallen Angel] to a random enemy and nearby every 1 sec, dealing 30180 M.DMG each hit and reducing ATK Spd by 100 for 10 sec. The ATK Spd reduction effect can be stack up to max 5 times.",
    "charges": 6,
    "cooldown": 18,
    "charge_type": "Charges up over 20 sec.",
    "advancement": "Advancement Phase 1\nReduces Skill Activation Requirements by 4 sec, and changes ATK Reduction of [Angel's Despair] to 40%.\n\nAdvancement Phase 2\nEach hit dispels positive effects from target and increases All DMG the target takes by 40% for 10 sec."
  },
  {
    "name": "Twinswords of Fury, Veralta",
    "description": "Summons the soul of Twinswords of Fury, Veralta for 10 sec. For the Duration of Skill, the DMG of Normal attacks is increased by 50%, and Fluss' Skills are enhanced.\n[Tempest Blade] Attack the target and the enemies nearby 3 times, dealing a total of 103689 additional P.DMG and reducing the Heal Rate of the hit target by 30% for 5 sec.\n[Flashstep] Increases own Crit DMG by 100% for 10 sec.\n[Bloody Petals] Deals a total of 236992 P.DMG to one enemy over 16 attacks. The Mark effect of [Flashstep] will not be applied to this Skill.",
    "charges": 6,
    "cooldown": 24,
    "charge_type": "Charges up upon Dealing DMG 70 times.",
    "advancement": "Advancement Phase 1\nCharges the duration of the Soul Weapon to 15 sec.\n\nAdvancement Phase 2\nFor the duration of Skill, each attack has a 100% chance to reduce Cooldown of self's all Skills by 2%."
  },
  {
    "name": "God's Authority, Rosmerta",
    "description": "Summons the soul of God's Authority, Rosmarta for 12 sec. Healing HP of 1 ally with the lowest HP by 55718 every sec. Additionally, attack the enemy with the highest ATK and enemies nearby it every 1 sec, dealing 23216 M.DMG and inflicting stun for 1 sec.",
    "charges": 6,
    "cooldown": 25,
    "charge_type": "Charges up upon using Skills 5 times.",
    "advancement": "Advancement Phase 1\nDuration of the soul is changed to 15 sec.\n\nAdvancement Phase 2\nIncreases Heal Rate by 50%, and healed target block all incoming attacks for 5 sec."
  },
  {
    "name": "Holy Bird, Numinu",
    "description": "Summons the soul of Holy Bird, Numinu, increasing own ATK by 60% for 8 sec. Upon activation, summons the Storm of Numinu in the front for 8 sec, dealing 15741 P.DMG every 0.5 sec to enemies within range and reducing the target's ATK Spd by 100 for 5 sec. The ATK Spd Reduction effect can be stacked up to max 10 times. Enemies with 10 stacks are inflicted with Freeze and take 30% increased P.DMG for 5 sec.",
    "charges": 6,
    "cooldown": 22,
    "charge_type": "Charges up upon using Skills 4 times.",
    "advancement": "Advancement Phase 1\nIncreases the duration of Storm of Numinu and soul by 4 sec.\n\nAdvancement Phase 2\nChanges the increased P.DMG the enemies take to 50%, and every hit dispels positive effects from the enemy."
  },
  {
    "name": "Beast Fist, Mastra",
    "description": "Summons the soul of Beast Fist, Mastra, dealing 74064 P.DMG that ignores DEF to the enemy with the highest ATK, and increasing own ATK by 50% for 10 sec. For the duration of Skill, increases DMG of [Ultimate Punch!] by 50%. Upon activating [This will hurt!], deals 49376 additional P.DMG that ignores DEF.",
    "charges": 6,
    "cooldown": 20,
    "charge_type": "Charges up upon using Skills 5 times.",
    "advancement": "Advancement Phase 1\nUpon using [Ultimate Punch!] for the Duration of Skill, DMG that ignores DEF also applies to targets other than Bosses.\n\nAdvancement Phase 2\nIncreases DMG by 100% and changed DMG Boost of [Ultimate Punch!] to 100%."
  },
  {
    "name": "The Counterattack, Maxithea",
    "description": "Summons the soul of The Counterattack, Maxithea, healing all allies' HP by 158336 and increasing DEF by 50% for 10 sec. Afterward, sends the soul charging to the front, dealing 98960 P.DMG to enemies within range and knocking them down for 5 sec.",
    "charges": 6,
    "cooldown": 20,
    "charge_type": "Charges up every sec and every time self takes DMG. This Skill can be cast upon gaining 80 charges.",
    "advancement": "Advancement Phase 1\nFor the duration of Skill, increases own DEF by 50%, and increases ATK of all allies except for self by 40%.\n\nAdvancement Phase 2\nUpon activation, dispels negative effects from all allies. When the soul charges, it dispels positive effects from all enemies within range, and increases P.DMG the target takes by 25% for 10 sec."
  },
  {
    "name": "Gateway to Purgatory, Pigritia",
    "description": "With the power of the Gateway to Purgatory, Pigritia, Gremory transforms into her true form and attacks enemies with a wide frontal range 2 times, dealing a total of 51844 M.DMG. Afterward, she lets out a deafening roar, dealing 23216 M.DMG to enemies within a wide range. Each stack of [Mana Charge] increases DMG of Soul Weapon by 20%.",
    "charges": 8,
    "cooldown": 12,
    "charge_type": "Charges up upon using Skills 4 times.",
    "advancement": "Advancement Phase 1\nIncreases DMG by 50%.\n\nAdvancement Phase 2\nIncreases the max number of [Mana Charge] stacks by an additional 2."
  },
  {
    "name": "The Playtime, HN-0",
    "description": "Summons the soul of The Playtime, HN-0, increasing Crit DMG by 30% for 60 sec. Afterward, commands 'Attack Order' 3 times every 3 sec, dealing 101664 P.DMG to frontal enemies in a straight line and inflicting Stun for 2 sec. Upon activating this Skill in Guild Battles, additional effects apply, and Crit DMG Boost effect stacks up to 4 times.\n[Guild Conquest] - Every time 'Attack Order' activates, hit enemies take 30% increased P.DMG for 5 sec.\n[Guild War] - Reduces Skill Activation Requirements to 10 sec.\n[Guild Raid] - Upon activation of 'Attack Order', gains 50 Ammo.",
    "charges": 7,
    "cooldown": 21,
    "charge_type": "Charges up over 21 sec.",
    "advancement": "Advancement Phase 1\nIncreases DMG by 30%, and changes the max number of stacks to 7 times.\n\nAdvancement Phase 2\nIncreases DMG by 70%. ATK increases by 6% per each stack."
  },
  {
    "name": "Dreams of an Artificial God, Innocentia",
    "description": "Summons the soul of Dreams of an Artificial God, Innocentia for 10sec, increasing own ATK by 40%, recovering Mana by 200 every sec, and reducing ATK of all enemies by 30% for the duration of Skill.",
    "charges": 5,
    "cooldown": 20,
    "charge_type": "Charges up over 20 sec.",
    "advancement": "Advancement Phase 1\nChanges the Skill Activation Requirements to 15sec, and reduces DEF of all enemies by 30% for the duration of Skill.\n\nAdvancement Phase 2\nChanges the duration of soul to 15 sec and increases DMG dealt to enemies by 20% for the duration of Skill."
  },
  {
    "name": "Coqnuerer of Darkness, Del Terravion",
    "description": "Summons the soul of Conquerer of Darkness, Del Terravion, dealing 175968 P.DMG to all enemies and locking hit targets within an irremovable special barrier. Targets within the special barrier cannot receive positive effects and they take 25% increased P.DMG for 8 sec. Afterward, the Skill lasts for 12 sec and increases Isolet's ATK by 30%.",
    "charges": 5,
    "cooldown": 20,
    "charge_type": "Charges up upon using Skills 4 times.",
    "advancement": "Advancement Phase 1\nIncreases the duration of the special barrier by 4 sec.\n\nAdvancement Phase 2\nIncreases Isolet's DMG dealt to non-Hero enemies by 35% for the duration of soul."
  },
  {
    "name": "Unchanging Mind, Erekura",
    "description": "Summons the soul of Unchanging Mind, Erekura for 10 sec, increasing Heal Rate of self by 50%. Every 0.5 sec causes 4 random enemies to take 8% increased M.DMG for 5 sec. This effect stacks up to 5 times. After 10 sec, removes the stack from target, dealing 15833 M.DMG per stack.",
    "charges": 6,
    "cooldown": 20,
    "charge_type": "Charges up every sec and every time self takes DMG. This Skill can be cast upon gaining 80 charges.",
    "advancement": "Advancement Phase 1\nReduces Activation Requirement to 60.\n\nAdvancement Phase 2\nIncreases the max number of Stacks to 10."
  },
  {
    "name": "Hundred-Flavor Banquet, Tempora Fyrr",
    "description": "Summons the Soul of Hundred-Flavor Banquet, Tempora Fyrr for 10 sec and gains additional effects accourding to Juno's status.\nWhile in [Cook from Heaven], increases all allies' All DEF by 50% + euqal to 3% of Juno's ATK.\nWhile in [Cook from Hell], increases all allies' ATK by 30% + euqal to 3% of Juno's ATK.\nUpon using the Skill at 2 or more stacks of [Excellent Ingredient], consumes 2 stacks and increases all effect by 50%.",
    "charges": 5,
    "cooldown": 22,
    "charge_type": "Charges up upon using Skills 7 times.",
    "advancement": "Advancement Phase 1\nReduces Skill Activation Requirement to 5 times.\n\nAdvancement Phase 2\nWhile in [Cook from Heaven], reduces All DMG all allies take by 20%.\nWhile in [Cook from Hell], increases All DMG all enemies take by 15%.\nThe effect of Excellent Ingredient stacks applies to these effects."
  },
  {
    "name": "0-Form Perpetual Motion Cannon, Heaven Shatterer",
    "description": "Summons the soul of 0-Form Perpetual Motion Cannon, Heaven Shatterer for 12 sec. The summoned soul attacks the target continuously, dealing 12708 M.DMG every 0.5 sec. If the attack hits the same target for more than 5 sec, the effect is enhanced, increasing DMG by 100%",
    "charges": 7,
    "cooldown": 24,
    "charge_type": "Charges up over 20 sec.",
    "advancement": "Advancement Phase 1\nIncreases the duration of the soul by 6 sec.\n\nAdvancement Phase 2\nThe enhanced attack stuns the enemy for 1 sec, and increases its DMG by an additional 100%."
  },
  {
    "name": "The Holy Sword, Aea",
    "description": "Summons the soul of the Holy Sword, Aea for 10 sec, increasing own ATK by 30% and All DEF by 30%. The soul of The Holy Sword, Aea follows Kasel around, healing HP of allies within range equal to 5% of their Max HP every sec.",
    "charges": 5,
    "cooldown": 24,
    "charge_type": "Charges up over 19 sec.",
    "advancement": "Advancement Phase 1\nDispels negative effects from the healed ally.\n\nAdvancement Phase 2\nDeals 67464 P.DMG to enemies within range every sec."
  },
  {
    "name": "The Bluewind, Coventina",
    "description": "Summons the soul of The Bluewind, Conventina, recovering Mana of all allies by 2000. Afterward, reduces Heal Rate of all enemies by 30%, increases M.DMG the enemies take by 30% for 10 sec, and attacks a random enemy with lighting every 3 sec. dispelling positiv effects, dealing 46432 M.DMG, and reducing the enemy's Mana by 500. After 10 sec, deals 92864 M.DMG to all enemies and inflicts Stun for 5 sec.",
    "charges": 7,
    "cooldown": 20,
    "charge_type": "Charges up over 20 sec.",
    "advancement": "Advancement Phase 1\nChanges Heal Rate Reduction effect to 50% and M.DMG Boost effect to 50%.\n\nAdvancement Phase 2\nIncreases DEF Penetration of all allies by 500 for the duration of Skill."
  },
  {
    "name": "Midnight Demonic Swords, Night Sky & Dark Shadow & Veil",
    "description": "Summons the soul of Midnight Demonic Swords, Night Sky & Dark Shadow & Veil, launching a blow to all enemies within wide frontal range of self that deals 98752 M.DMG, inflicting Stun for 3 sec, and reducing their Mana by 2000. Afterward, increases own ATK by 30% for 10 sec and deals a total of 98752 M.DMG to 1 random enemy over 4 hits every 3 sec. Additional effects will be applied depending on Kibera's selected sword.\n[Nocturnal Demonic Sword, Night Sky] - Increases DMG dealt to enemies by 30% for 10 sec.\n[Umbral Demonic Blade, Dark Shadow] - Reduces ATK of hit enemies by 40% for 10 sec.\n[Darkslayer Demonic Sword, Veil] - DMG ignores DEF.",
    "charges": 7,
    "cooldown": 15,
    "charge_type": "Charges up over 24 sec.",
    "advancement": "Advancement Phase 1\nReduces Skill Activation Requirements by 2 sec and increases DMG by 50%.\n\nAdvancement Phase 2\nReduces Skill Activation Requirements by an additional 4 sec and dispels positive effects of the target."
  },
  {
    "name": "Judgment Edge, Elicipira",
    "description": "Summons the soul of Judgment Edge, Elicipira, changing the activation chance of the additional M.DMG effect of Judgment Edge, Elicipira to 10% and reducing All DMG taken by 40% for 10 sec.",
    "charges": 7,
    "cooldown": 25,
    "charge_type": "Charges up upon dealing DMG 60 times.",
    "advancement": "Advancement Phase 1\nFor the duration of Skill, increases ATK by 50%.\n\nAdvancement Phase 2\nIncreases the duration of the effect by 5 sec and changes the activation chance of Judgment Edge, Elicipira to 15%."
  },
  {
    "name": "Flowing Circle, Eltoirre",
    "description": "Summons the soul of Flowing Circle, Eltoirre for 10 sec, healing all allies' HP by 27859 and mana by 400 every sec.",
    "charges": 6,
    "cooldown": 23,
    "charge_type": "Charges up upon using Skills 5 times.",
    "advancement": "Advancement Phase 1\nIncreases the healed ally's M.DEF by 10% and M.Block by 200. This effect stacks up to 5 times.\n\nAdvancement Phase 2\nFor the duration of the skill, self becomes immune to All DMG and Cooldown of all active Skills is reduced by 1 sec every sec."
  },
  {
    "name": "Lakrak MK-1",
    "description": "Summons the soul of Lakrak MK-1, increasing own ATK by 50% for 12 sec. Afterward, deals a total of 152496 P.DMG to enemies within range of a random enemy over 5 times every 4 sec, stunning them for 2 sec and increasing P.DMG they take by 30% for 8 sec.",
    "charges": 6,
    "cooldown": 19,
    "charge_type": "Charges up over 18 sec.",
    "advancement": "Advancement Phase 1\nReduces Skill Activation Requirements by 2 sec and gains immunity to CC for 12 sec.\n\nAdvancement Phase 2\nReduces Skill Activation Requirements by an additional 4 sec, and immediately reduces Cooldown of all Skills by 3 sec every 4 sec."
  },
  {
    "name": "Whispering Sands, Arlaq",
    "description": "Summons Whispering Sands, Arlaq for 6 sec, recovering own Mana by 500 every sec, and reducing ATK Spd of enemies within circular range of self by 120. The ATK Spd Reduction effect stacks up to 5 times, and enemies inflicted with 5 stacks take 50% increased M.DMG for 7 sec, and become Petrified.",
    "charges": 6,
    "cooldown": 22,
    "charge_type": "Charges up over 21 sec.",
    "advancement": "Advancement Phase 1\nIncreases own ATK by 40% for the duration of the Skill.\n\nAdvancement Phase 2\nFor every sec, dispels positive effects from an enemy within range and deals 44438 M.DMG."
  },
  {
    "name": "Void Soul, Dunn Nemecia",
    "description": "Summons the soul of Void Soul, Dunn Nemecia, dealing 69648 M.DMG to all enemies and inflicting them with 'Soul Mischief'. Enemies inflicted with 'Soul Mischief' take 8% increased M.DMG and have their Heal Rate reduced by 8% for 7 sec. Afterward, every time Lavril uses a Skill for 10 sec, she inflicts 69648 M.DMG to all enemies and inflicts them with 'Soul Mischief'. The 'Soul Mischief' effect can be stacked up to max 3 times.",
    "charges": 5,
    "cooldown": 25,
    "charge_type": "Charges up over 22 sec.",
    "advancement": "Advancement Phase 1\nChanges the max number of stacks of 'Soul Mischief' to 4.\n\nAdvancement Phase 2\nIncreases the effect of 'Soul Mischief' by 50%."
  },
  {
    "name": "Phoenix Quill, Belisa",
    "description": "Summons the soul of Pheonix Quill, Belisa, creating a shield on an ally wiht the highest ATK for 10 sec that absorbs 185728 DMG, grants immunity to CC, and increases DMG dealt to enemies by 20% for 10 sec. Afterward, dispels positive effects of frontal enemies in a straight line and deals 139296 P.DMG.",
    "charges": 5,
    "cooldown": 23,
    "charge_type": "Charges up upon using Skills 5 times.",
    "advancement": "Advancement Phase 1\nChanges Skill Activation Requirements to 3 times.\n\nAdvancement Phase 2\nPrevents hit enemies from receiving positive effects for 5 sec."
  },
  {
    "name": "Scarlet Ruler, Dominicia",
    "description": "Summons the Soul of Scarlet Ruler, Dominicia, increasing Lewisia's ATK by 40% and M.DMG the enemy takes by 20% for 12 sec. Afterwards, deals a total of 381260 M.DMG over 10 times on the enemy and heals all allies' HP equal to 5% of the DMG dealt. After 10 sec, deals 117312 M.DMG. If the target is a Boss, deals 234624 additional M.DMG.",
    "charges": 7,
    "cooldown": 23,
    "charge_type": "Charges up upon dealing DMG 60 times.",
    "advancement": "Advancement Phase 1\nReduces Cooldown by 8 sec.\n\nAdvancement Phase 2\nIncreases DMG by 70%, and changes ATK Boost to 60%"
  },
  {
    "name": "Infinite Spring, Cielamaha",
    "description": "Summons the soul of Infinite Spring, Cialamaha for 12 sec, increasing own DMG dealt to enemies by 20%. Normal and Skill attacks have a 10% chance of dealing 55723 additional P.DMG.",
    "charges": 6,
    "cooldown": 22,
    "charge_type": "Charges up upon dealing DMG 70 times.",
    "advancement": "Advancement Phase 1\nFully recovers Mana for the duration of Skill.\n\nAdvancement Phase 2\nIncreases DMG by 100%."
  },
  {
    "name": "Wave of Protection, Gaiamenes",
    "description": "Summons the soul of Wave of Protection, Gaiamenes, dealing 79168 P.DMG to frontal enemies and inflicting Stun for 3 sec. Afterward, for 10 sec, increases all allies ATK by 30% + equal to 5% of Loman's ATK, and increases M.DEF by 30%, while recovering 1000 Mana of all allies every 3 sec.",
    "charges": 7,
    "cooldown": 22,
    "charge_type": "Charges up over 22 sec.",
    "advancement": "Advancement Phase 1\nHeals all allies equal to 12% of Max HP and dispels negative effects every 3 sec.\n\nAdvancement Phase 2\nReduces Skill Activation Requirements by 6 sec. Upon hit, increases P.DMG the hit target takes 35% for 10 sec."
  },
  {
    "name": "World Tree's Will, Roburu",
    "description": "Summons the soul of World Tree's Will, Roburu for 10 sec, dealing 87984 M.DMG on a random enemy every 2 sec, increasing M.DMG it takes by 30% for 10 sec and inflicting Shackle for 2 sec. Also recovers own mana by 500 and reduces Cooldown of all Skills by 1 sec every 2 sec.",
    "charges": 7,
    "cooldown": 21,
    "charge_type": "Charges up over 17 sec.",
    "advancement": "Advancement Phase 1\nIncreases own ATK by 50% for the duration of soul.\n\nAdvancement Phase 2\nIncreases the duration of CC effects applied upon all enemies by 30% and reduces their M.DEF by 25% for the duration of soul."
  },
  {
    "name": "Blessing of Light, Benedicia",
    "description": "Summons the soul of Blessing of Light, Benedicia for 10 sec, increasing all allies Heal Rate by 35% and ATK Spd by 350.",
    "charges": 7,
    "cooldown": 24,
    "charge_type": "Charges up upon using Skills 4 times.",
    "advancement": "Advancement Phase 1\nIncreases ATK of all allies by 35% for the duration of Skill.\n\nAdvancement Phase 2\nEvery 1 sec, Skill Cooldown of self is reduced by 1 sec for the duration of Skill."
  },
  {
    "name": "Flower of Eternity, Hyacinth",
    "description": "Summons the soul of Flower of Eternity, Hyacinth, dealing 83592 M.DMG to nearby enemies within a circular range of self, freezing them for 5 sec and knocking them back. Afterward, the Soul of Hyacinth deals 167184 additional M.DMG to frozen enemies and increases own Crit DMG by 100% for 10 sec.",
    "charges": 5,
    "cooldown": 17,
    "charge_type": "Charges up over 17 sec.",
    "advancement": "Advancement Phase 1\nHit targets take 40% increased M.DMG for 10 sec.\n\nAdvancement Phase 2\nFor the duration of Skill, Normal attacks hit 3 targets, and its range increases by 30%. Hit targets will be knocked back."
  },
  {
    "name": "Lea's Messenger, Cocytus",
    "description": "Summons the Soul of Lea's Messenger, Cocytus, dealing 146640 M.DMG to frontral enemies in a straight line, knocking them back far away for 3 sec, and inflicting 'Raven Catastrophe' for 10 sec. Targets inflicted with 'Raven Catastrophe' have their ATK reduced by 40%.",
    "charges": 8,
    "cooldown": 15,
    "charge_type": "Charges up upon using Skills 4 times.",
    "advancement": "Advancement Phase 1\nReduces Heal Rate of the target inflicted with Raven Catastrophe by 50%.\n\nAdvancement Phase 2\nReduces Skill Activation Requirements to 3 times."
  },
  {
    "name": "The Box of Fragrance, Etelia",
    "description": "Summons the soul of The Box of Fragrance, Etalia, healing a total of 278590 HP of all allies over 10 sec and increasing ATK of the ally with the highest ATK by 4% for 120 sec every 3 sec. The ATK Boost effect can be stacked up to 15 times, and upon activation, there is a 30% chance to stack 2 times at once.",
    "charges": 5,
    "cooldown": 20,
    "charge_type": "Charges up over 15 sec.",
    "advancement": "Advancement Phase 1\nChanges the max number of stacks to 20 times.\n\nAdvancement Phase 2\nIncreases Heal Rate by 100%, and increases the chance to stack 2 times at once to 50%."
  },
  {
    "name": "Merciful Threat, Phistonia",
    "description": "Summons the Soul of Merciful Threat, Phistonia, increasing ATK of the ally with the highest ATK equal to 20% of Mediana's ATK for 10 sec, and healing the target and Mediana by a total of 232160 HP over 10 sec.",
    "charges": 4,
    "cooldown": 25,
    "charge_type": "Charges up over 25 sec.",
    "advancement": "Advancement Phase 1\nFor the duration of Skill, Mediana and the target recover 400 Mana every 1 sec.\n\nAdvancement Phase 2\nATK Boost is increased by 50%."
  },
  {
    "name": "Endless Acceleration, Riventina",
    "description": "Places Endless Acceleration, Riventina on the ground for 10 sec. Endless Acceleration, Riventina attacks the enemy with the lowest M.DEF, dealing 98752 M.DMG and inflicting 'Target Lock On'. Afterwards, attack the enemy every 3 sec, dealing 98752 M.DMG and inflicting stun for 2 sec. All effects prioritize the enemy inflicted with 'Target Lock On'.",
    "charges": 6,
    "cooldown": 23,
    "charge_type": "Charges up upon using Skills 5 times.",
    "advancement": "Advancement Phase 1\nUpon activation, increases Mirianne's Crit DMG by 100% and ACC by 300 for 10 sec.\n\nAdvancement Phase 2\nUpon activation, [Assassination] ignores the enemy's DEF, and increases its DMG by 30% for 10 sec."
  },
  {
    "name": "Ultimate Weapon, Leviathan",
    "description": "Summons the soul of Ultimate Weapon, Leviathan, icnreasin own ATK by 30% for 10 sec, and dealing 63540 P.DMG to all enemies every 3 sec. Each hit increases P.DMG the enemies take by 20% for 5 sec.",
    "charges": 8,
    "cooldown": 18,
    "charge_type": "Charges up over 22 sec.",
    "advancement": "Advancement Phase 1\nIncreases the P.DMG Boost effect by additional 20%.\n\nAdvancement Phase 2\nReduces Cooldown by 7 sec and increases P.DMG boost by an additional 20%."
  },
  {
    "name": "Roar of Madness, Velkinoth",
    "description": "Summons the soul of Roar of Madness, Velkinoth for 10 sec, increasing own ATK for 30%. The soul of Roar of Madness, Velkinoth attacks the enemy 12 times, dealing 17791 each hit + 254 per each stack of Death Mark.",
    "charges": 7,
    "cooldown": 25,
    "charge_type": "Charges up upoin dealing DMG 80 times.",
    "advancement": "Advancement Phase 1\nIncreases DMG of the soul of Roar of Madness, Velkinoth by 70%.\n\nAdvancement Phase 2\nFor the duration of Skill, increases own DMG dealt to enemies by 30%."
  },
  {
    "name": "Flame of Victory, Carprain",
    "description": "Deals 59376 M.DMG to nearby enemies within a circular range of self and knocks them down for 3 sec. Afterwards, summons Flame of Victory, Carprain for 13 sec, increasing self's ATK by 60%.",
    "charges": 6,
    "cooldown": 22,
    "charge_type": "Charges up over 18 sec.",
    "advancement": "Advancement Phase 1\nFor the duration of Skill, reduces M.DMG all allies take by 50%.\n\nAdvancement Phase 2\nFor the duration of Skill, increases M.DMG all nearby enemies take by 40%. The effect is increased by 80% against Bosses."
  },
  {
    "name": "Cursed Claws, Baroro",
    "description": "Summons the soul of Cursed Claws, Baroro, increasing own ATK by 40% for 10 sec. For the duration of Skill, deals 101196 P.DMG to frontral enemies every 3 sec. Hit enemies are inflicted with Curse of Baroro for 5 secs, taking 30% increased P.DMG and having their Heal Rate reduced by 30%. If the target is a Boss, the Curse of Baroro effect increases by 1.5 times.",
    "charges": 6,
    "cooldown": 23,
    "charge_type": "Charges up upon using Skill 5 times.",
    "advancement": "Advancement Phase 1\nPetrifies the hit enemy for 3 sec.\n\nAdvancement Phase 2\nChanges Skill Activation Requirements to 4 times and increases the duration of the soul by 3 sec."
  },
  {
    "name": "Roaring Dragonmaw, Acravita",
    "description": "Summons the soul of Roaring Dragonmaw, Acravita, attacking enemies in a wide frontal range, dealing 234480 M.DMG proportional to own All DEF, inflicting stun for 4 sec, and reducing target's ATK by 35% for 10 sec.",
    "charges": 5,
    "cooldown": 18,
    "charge_type": "Charges up every sec and every time self takes DMG. This Skill can be cast upon gaining 80 charges.",
    "advancement": "Advancement Phase 1\nDispels positive effects of all enemies within range.\n\nAdvancement Phase 2\nChanges Skill Activation Requirement to 50 times. Hit enemies take 25% increased M.DMG for 10 sec."
  },
  {
    "name": "Rending Chaos, Zakadras",
    "description": "Summons the soul of Rending Chaos, Zakadras, dealing 98752 P.DMG to all enemies, stunning them for 4 sec, and increasing P.DMG the enemies take by 20% for 10 sec. Afterward, increases own ATK by 25% and ATK Spd by 250 for 10 sec.",
    "charges": 5,
    "cooldown": 22,
    "charge_type": "Charges up upon using Skills 5 times.",
    "advancement": "Advancement Phase 1\nIncreases DMG by 30% and P.DMG the enemies take to 40%.\n\nAdvancement Phase 2\nReduces Cooldown by 7 sec. Upon activation, gains 2 stacks of Demonic Blood."
  },
  {
    "name": "Mace of Rehabilitation, Hartnon",
    "description": "Summons the soul of Mace of Rehabilitation, Hartnon, dealing 89952 P.DMG to enemies within range of self. Afterward, every Normal and Skill attack inflicts irremovable stack of Grudge of Hartnon for 10 sec, increasing P.DMG the target takes by 2% and reducing its ATK by 2% for 10 sec. After 10 sec, attacks all enemies, dealing 134928 P.DMG and inflicting Stun for 5 sec. Grudge of Hartnon can be stacked up to max 10 times. If the target is a Boss, all effects are increased by 2 times.",
    "charges": 6,
    "cooldown": 20,
    "charge_type": "Charges up upon using Skills 5 times.",
    "advancement": "Advancement Phase 1\nChanges Skill Activation Requirements to 4 times.\n\nAdvancement Phase 2\nChanges the max number of stacks of Grudge of Hartnon to 15."
  },
  {
    "name": "Dimensional Key, Magnus Fille",
    "description": "Summons the soul of Dimensional Key, Magnus Fille for 10 sec and immediately recovers 3 Mana. For the duration of the Skill, increases own Crit DMG by 150%.",
    "charges": 6,
    "cooldown": 24,
    "charge_type": "Charges up upon dealing DMG 70 times.",
    "advancement": "Advancement Phase 1\nReduces Skill Activation Requirements to 50 time(s).\n\nAdvancement Phase 2\nIncreases the duration by 4 sec, and self becomes immune to CC for the duration of Skill."
  },
  {
    "name": "Moonshade Countdown, Tempodiana",
    "description": "Summons the soul of Moonshade Countdown, Tempodiana, increasing Crit DMG of the ally with the Highest ATK by 80% for 15 sec, and reducing Cooldown of all Skills by 1 sec every sec.",
    "charges": 7,
    "cooldown": 25,
    "charge_type": "Charges up over 23 sec.",
    "advancement": "Advancement Phase 1\nFor the duration of Skill, increases the target's DEF Penetration by 350.\n\nAdvancement Phase 2\nChanges the number of targets to 3."
  },
  {
    "name": "Cards of Destiny Del Arcana",
    "description": "Summons the soul of Cards of Destiny Del Acana, discarding all currently owned cards. Afterward, acquires the [Star] card, increasing ATK by 60% for 10 sec. Upon using a Skill while owning the [Star] card, the effects of [Death], [Love], and [Fortune] will be activated and [Star] card will be consumed.",
    "charges": 7,
    "cooldown": 17,
    "charge_type": "Charges up upon using Skills 6 times.",
    "advancement": "Advancement Phase 1\nUpon activation, self recovers 3 orbs of Mana.\n\nAdvancement Phase 2\nChanges Skill Activation Requirements to 4 time(s)."
  },
  {
    "name": "Roar of Raging Heat, Tersia",
    "description": "Summons the soul of Roar of Raging heat, Tersia, increasing Pansirone's ATK Spd by 500 for 8 sec. Afterward, attacks enemies in a wide frontal range 3 times, dealing total of 152496 P.DMG. The last hit places 'Tersia's Prank' on a wide frontal range for 8 sec, dealing 16520 P.DMG every 1 sec and increasin P.DMG the targets take by 25%. If the target is inflicted with 'Eternal Blaze', the increased P.DMG the target takes changes to 35%.",
    "charges": 5,
    "cooldown": 18,
    "charge_type": "Charges up upon dealing DMG 85 times.",
    "advancement": "Advancement Phase 1\nIncreases DMG by 100%.\n\nAdvancement Phase 2\nThe duration of the ATK Spd Boost effect and 'Teria's Prank' increases by 4 sec."
  },
  {
    "name": "Dragon Hearts, Andarta Andraste",
    "description": "Summons the soul of Dragon Hearts, Andarta Andraste, increasing own Crit DMG by 100% for 10 sec. Upon activation, deals 146640 M.DMG to enemies in a straight line, increasing M.DMG the target takes by 30% for 10 sec, and inflicting Freeze for 6 sec. Upon attacking the frozen enemy, deals 146640 M.DMG that ignores DEF, self recovers 2 orbs of Mana, and reduces Cooldown of all skills by 30%.",
    "charges": 5,
    "cooldown": 21,
    "charge_type": "Charges up upon using Skills 5 times.",
    "advancement": "Advancement Phase 1\nChanges Skill Activation Requirements to 4 times.\n\nAdvancement Phase 2\nIncreases DMG 80% and dispels positiv effects from the hit enemy."
  },
  {
    "name": "Dragon's Ruins, Atein",
    "description": "Summons the soul of Dragon's Ruins, Atein for 10 sec. For the duration of the soul, increases own DEF by 60%, normal attacks deal additional P.DMG equal to 1% of own Max HP, enhancing own Skills.\n[Collision] Deals 19792 additional P.DMG to the target and increases P.DMG the target takes by 20% for 10 sec.\n[Headbutt] Deals additional P.DMG 10% of own HP.\n[Earth Incarnate] Upon activation, immediately heals HP equal to 20% own Max HP.",
    "charges": 6,
    "cooldown": 24,
    "charge_type": "Charges up over 23 sec.",
    "advancement": "Advancement Phase 1\nIncreases the duration of soul by 5 sec.\n\nAdvancement Phase 2\nChanges the additional P.DMG proportional to Max HP from normal attacks to 2%, and increases DEF Reduction effect of [Destroy Armor] by 50% for the duration of Skill."
  },
  {
    "name": "Tumultuous Dance, Excilius",
    "description": "Summons the soul of Tumultuous Dance, Excilius for 12 sec, increasing ATK of self and the ally with the highest ATK by 40%, and Crit DMG by 40%. Additionally grants immunity to CC effect to an ally with the highest ATK.",
    "charges": 6,
    "cooldown": 18,
    "charge_type": "Charges up over 19 sec.",
    "advancement": "Advancement Phase 1\nReduces Skill Activation Requirements by 4 sec.\n\nAdvancement Phase 2\nFor the duration of Skill, increases DMG dealt of the ally with the highest ATK by 30%."
  },
  {
    "name": "Adversary of the Goddess, Galicta",
    "description": "Summons the soul of the Adversary of the Goddess, Galicta, increasing own ATK by 40% for 10 sec. Afterward, attack a random target and nearby enemies in a circular range, dealing 67464 P.DMG and knocking them down for 3 sec.",
    "charges": 5,
    "cooldown": 16,
    "charge_type": "charges up upon using Skills 4 times.",
    "advancement": "Advancement Phase 1\nIncreases DMG by 50%.\n\nAdvancement Phase 2\nIncreases own DMG that ignores DEF by 30% for the duration of soul."
  },
  {
    "name": "Anthem of a New Road, Matimaruma",
    "description": "Summons the soul of Anthem of a New Road, Matimaruma, increasing all allies ATK by 50% for 10 sec. After 10 sec, deals 116080 P.DMG to frontal enemies in a straight line, knocking them down for 3 sec.",
    "charges": 6,
    "cooldown": 24,
    "charge_type": "Charges up upon using Skills 5 times.",
    "advancement": "Advancement Phase 1\nIncreases ATK Spd of all allies by 400 for the duration of the Skill.\n\nAdvancement Phase 2\nincreases P.DMG the enemy takes by 50% for 15 sec."
  },
  {
    "name": "Lightning Flash, Livatis",
    "description": "Summon the soul of Lightning Flash, Livatis, increasing own ATK by 60% for 12 sec. For the duration of Skill, increases DMG of [Float Like a Butterfly] by 50%.",
    "charges": 7,
    "cooldown": 22,
    "charge_type": "Charges up upon using Skills 10 times.",
    "advancement": "Advancement Phase 1\nFor the Duration of Skill, increases own DEF Penetration by 500.\n\nAdvancement Phase 2\nIncreases the duration of Skill by 5 sec and changes the Skill DMG Boost of [Float Like a Butterfly] to 100%."
  },
  {
    "name": "God's Lamp, Kurulati",
    "description": "Summons the soul of God's Lamp, Kurulati for 10 sec, increases ATK Spd of all allies by 300 and Mana recovery per sec by 100%. Afterward, inflicts hallucination upon one random enemy every 3 sec, reducing their ACC by 350 for 3 sec.",
    "charges": 6,
    "cooldown": 23,
    "charge_type": "Charges up upon using Skills 5 time.",
    "advancement": "Advancement Phase 1\nInflicts hallucination upon 2 enemies and reduces the target's Mana by 500.\n\nAdvancement Phase 2\nUpon activation, immediately activates the invisibility effect of God's Lamp, Kurulati on 2 allies."
  },
  {
    "name": "The Flute of Silent Winds Rakshathar",
    "description": "Summons the soul of The Flute of Silent Winds Rakshathar for 10 sec. For the duration of the Soul, deals 33436 + 334 P.DMG per each 1 stack of Tickle Tickle Potion inflicted upon the target every sec. The hit target will be Petrified for 1 sec.",
    "charges": 6,
    "cooldown": 20,
    "charge_type": "Charges up upon dealing DMG 70 times.",
    "advancement": "Advancement Phase 1\nIncreases All DMG the hit enemy takes by 30% for 10 sec.\n\nAdvancement Phase 2\nIncreases the duration of soul by 5 sec."
  },
  {
    "name": "Light of Judgment, Theoria",
    "description": "Summons the soul of Light of Judgment, Theoria for 15 sec, increasing own DEF by 50%. If Ricardo takes DMG for the duration of Skill, there is a 10% chance to deal 35264 P.DMG to the attacker and inflict stun for 2 sec.",
    "charges": 5,
    "cooldown": 25,
    "charge_type": "Charges up every sec and every time self takes DMG. This Skill can be cast upon gaining 100 charges.",
    "advancement": "Advancement Phase 1\nIncreases the duration of stun by 2 sec.\n\nAdvancement Phase 2\nIncreases activation chance by 10% and reduces Mana of the hit target by 500."
  },
  {
    "name": "Black Lunar Wing, Noctipheus",
    "description": "Summons the soul of Black Lunar Wing, Noctipheus, dealing 23612 M.DMG to the target and nearby enemies, and inflicts 30 stacks of [Otherworldly Curse] on hit targets. After use, gains a stack of [Black Moon Force]. Each stack of [Black Moon Force] increases DMG dealt to enemies by 5%. [Black Moon Force] can be stacked up to max 3 times and it is irremovable. If [Ripine] is in the team, [Ripine] also gains stacks of [Black Moon Force].",
    "charges": 5,
    "cooldown": 16,
    "charge_type": "Charges up over 20 sec.",
    "advancement": "Advancement Phase 1\n[Black Moon Force] additionally reduces DMG taken by 5%.\n\nAdvancement Phase 2\nIncreases the max number of [Black Moon Force] stacks by 2."
  },
  {
    "name": "Silver Lunar Wings, Clarapheon",
    "description": "Summons the soul of Silver Lunar Wing, Clarapheon for 8 sec, increasing own ATK by 30% and creating a shield that absorbs 123440 DMG and increases Crit DMG by 50% for 8 sec. If there is [Riheet] in the team, [Riheet] gains the same shield.",
    "charges": 6,
    "cooldown": 20,
    "charge_type": "Charges up over 20 sec.",
    "advancement": "Advancement Phase 1\nChanges the duration of the soul and the shield to 12 sec.\n\nAdvancement Phase 2\nChanges ATK Boost to 50% and Crit DMG Boost to 100%. The shield becomes irremovable."
  },
  {
    "name": "Rodina Custom Rifle Mod.0",
    "description": "Summons the soul of Rodina Custom Rifle Mod.0, increasing own Crit DMG by 100% for 10 sec. For the duration of Skill, deals 25416 P.DMG that ignores DEF every 2 sec and inflicts Stun on the hit target for 2 sec. If the target is a Boss, the DMG and duratoin of Stun increases by 2 times.",
    "charges": 6,
    "cooldown": 22,
    "charge_type": "Charges up over 22 sec.",
    "advancement": "Advancement Phase 1\nIncreases DMG by 50%.\n\nAdvancement Phase 2\nIncreases DMG by 50% and gains immunity to CC for the duration of Skill."
  },
  {
    "name": "Specter's Breath, Redeal",
    "description": "Summons the soul of Specter's Breath, Redeal for 12 sec, increasing own Crit DMG by 80%. Each time Roi casts [Blade Claw], deals 66657 additional DMG to the target and inflicts 1 stack of [Mortal Wound].",
    "charges": 7,
    "cooldown": 18,
    "charge_type": "Charges up upon using Skills 6 times.",
    "advancement": "Advancement Phase 1\nFor the duration of Skill, [Blade Claw] does not remove [Mortal Wound] stacks.\n\nAdvancement Phase 2\nFor the duration of Skill, fixes Cooldown of [Blade Claw] to 0 sec, and additionally recovers 1 orb of Mana upon use."
  },
  {
    "name": "Blade of Conviction, White Belona",
    "description": "Summons the soul of Blade of Conviction, White Belona, increasing own ATK by 50% for 8 sec and dealing 134928 P.DMG to the enemy with the highest ATK.",
    "charges": 6,
    "cooldown": 16,
    "charge_type": "Charges up upon using Skills 5 times.",
    "advancement": "Advancement Phase 1\nChanges Skill Activation Requirements to 4 times.\n\nAdvancement Phase 2\nIncreases DMG by 70%, and dispels positive effect from the hit target."
  },
  {
    "name": "Green Winds, Notos",
    "description": "Summons the soul of Green Winds, Notos for 13 sec, increasing own ATK by 50% and Crit DMG by 50%. For the duration of Skill, deals 69660 P.DMG that ignores DEF on an enemy every 4 sec, knocking them back for 2 sec, and immediately reducing the Cooldown of own Skills by 1 sec.",
    "charges": 8,
    "cooldown": 20,
    "charge_type": "Charges up upon dealing DMG 60 times.",
    "advancement": "Advancement Phase 1\nIncreaes DMG by 50%, and every time the Soul attacks an enemy, recovers own Mana by 1000.\n\nAdvancement Phase 2\nIncreaes DMG by 30% and reduces Skill Activation Requirements to 40 times."
  },
  {
    "name": "Executioner of Domains, Elsion",
    "description": "Summons the soul of Executioner of Domains, Elsion and deals 56220 M.DMG to nearby enemies within a circular range of self and increases M.DMG the enemies take 30% for 5 sec. Afterward, absorbs the soul of Executioner of Domains, Elsion for 10 sec and deals 17990 M.DMG to one random enemy every 1 sec. If the target is not a Hero, the DMG increases by 100%.",
    "charges": 5,
    "cooldown": 24,
    "charge_type": "Charges up over 20 sec.",
    "advancement": "Advancement Phase 1\nFor the duration of Skill, Seria's ATK is increased by 25%, and Crit DMG is increased by 50%.\n\nAdvancement Phase 2\nDMG dealt every 1 sec now ignores target's DEF."
  },
  {
    "name": "Wings of Corruption, Apoliox",
    "description": "Summons the soul of Wings of Corruption, Apoliox, inflicting 'Curse of Apoliox' to all enemies and granting 'The Vessel of Curses.' on self. 'Curse of Apoliox' reduces enemy's M.DEF by 40% and Heal Rate by 40% for 10 sec.",
    "charges": 6,
    "cooldown": 18,
    "charge_type": "Charges up over 20 sec.",
    "advancement": "Advancement Phase 1\nReduces Skill requirement by 2 sec, and recovers 1000 Mana upon use of Skill.\n\nAdvancement Phase 2\nSkill requirement is reduced by an additional 5 sec. Mana of the enemies inflicted with 'Curse of Apoliox' is reduced by 300 every sec."
  },
  {
    "name": "Charming Melody , Schwanheite",
    "description": "Summons the Soul of Charming Melody, Schwanheite, and recovers 100 Mana for 10 sec every sec. For the duration of Skill, upon using Trance at 3 stacks, increases allies' ATK by 25% and DEF by 25% for 6 sec.",
    "charges": 6,
    "cooldown": 30,
    "charge_type": "Charges up upon using skills 7 times.",
    "advancement": "Advancement Phase 1\nUpon using Trance at 3 stacks, also increases Crit DMG by 50%.\n\nAdvancement Phase 2\nChanges ATK Boost to 40%, DEF Boost to 40%, and Crit DMG Boost to 80%."
  },
  {
    "name": "Eye of the Storm, Yanadi",
    "description": "Summons the soul of Eye of the Storm, Yanadis, and deals 59376 M.DMG to enemies in a wide frontal range and stuns them for 3 sec. Afterward, places 'Raging Magnetic Field' for 6 sec. Enemies within the 'Raging Magnetic Field' take 30% increases M.DMG, and the duration of all CC effects the enemies take increases by 30%.",
    "charges": 5,
    "cooldown": 25,
    "charge_type": "Charges up upon dealing DMG 90 times.",
    "advancement": "Advancement Phase 1\nIncreases the duration of 'Raging Magnetic Field' by 3 sec.\n\nAdvancement Phase 2\nDeals M.DMG equal to 3% of Sonia's Max HP to enemies within 'Raging Magnetic Field' every sec."
  },
  {
    "name": "Rock of Perseverance, Prochika",
    "description": "Dispels all positive effects from frontal enemies in a circular range, dealing 79168 P.DMG, and summons the Soul of Rock of Perseverance, Prochika. The soul of Prochika disappears after activating an additional effect on the next Skill use.\n[BOOM! Here Goes!] Deals 79168 P.DMG to enemies within range and increases All DMG they take by 40% for 8 sec.\n[Protection! Was dat Lucky Stone?] While charging energy, recovers target's Mana by a total of 2 orbs over 4 times. Afterward, increases the target's ATK by 50% for 10 sec.\n[Charge! Knight Commander Power!] Deals 118752 P.DMG to the frontal enemy in range and instantly reduces the target's Mana by 3 orbs. Deals 118752 additional P.DMG to Non-Hero enemies.",
    "charges": 6,
    "cooldown": 18,
    "charge_type": "Charges up upon using Skills 4 times.",
    "advancement": "Advancement Phase 1\nChanges Skill Activation Requirements to 3 times.\n\nAdvancement Phase 2\nReduces Cooldown by 5 sec, and after summoning the soul, increases own DEF Penetration by 300 for 15 sec."
  },
  {
    "name": "Colorful Splendor, Diogemme",
    "description": "Summons the soul of Colorful Splendor, Diogemme, icnreasing own Crit DMG by 100% for 12 sec. Afterward, attacks all enemies and deals 125388 M.DMG. If the target is a Boss, deals 83592 additional M.DMG that ignores DEF.",
    "charges": 6,
    "cooldown": 18,
    "charge_type": "Charges up upon using Skills 5 times.",
    "advancement": "Advancement Phase 1\nIncreases DMG by 30% and reduces cooldown by 4 sec.\n\nAdvancement Phase 2\nIncreases DMG by 30%, and All DMG the hit targets take by 35% for 15 sec."
  },
  {
    "name": "Demon of the Calm, Caethasis",
    "description": "Summons the soul of Demon of the Calm, Caethasis, increasing own ATK by 50% for 10 sec. Afterward, hits the enemy with the lowest P.DEF 4 times every 3 sec, dealing a total of 197504 P.DMG.\nIf the target's HP is 50% or above, this hit reduces target's P.DEF by 5% for 5 sec.\nIf the target's HP is below 50%, this hit increases its DMG by 2 times and will be a Critical Hit.\nThe P.DEF Reduction effect can be stacked up to max 10 times.",
    "charges": 6,
    "cooldown": 22,
    "charge_type": "Charges up over 18 sec.",
    "advancement": "Advancement Phase 1\nChanges Skill Activation Requirements to 14 sec.\n\nAdvancement Phase 2\nChanges the P.DEF Reduction effect to 7%. The DMG Boost effect applied to enemies below 50% HP applies as 3.6 times."
  },
  {
    "name": "Lightning Bolt, Legios",
    "description": "Summons the soul of Lightning Bolt, Legios, attacking nearby enemies 4 times. Each attack deals 22488 M.DMG and stuns enemies for 0.5 sec. Afterwards, increases ATK by 30% for 10 sec, and activates 'Fury of Legios' every sec that deals 22488 M.DMG to a random enemy and nearby enemies within range. Hit enemies are stunned for 1 sec.",
    "charges": 6,
    "cooldown": 25,
    "charge_type": "Charges up upon dealing DMG 100 times.",
    "advancement": "Advancement Phase 1\nTarget hit by 'Fury of Legios' takes 30% increased M.DMG for 5 sec.\n\nAdvancement Phase 2\nUpon activation, the effect of 'Lightning Bolt, Legios' will be activated."
  },
  {
    "name": "Infinite Charter, Accordio",
    "description": "Summons the soul of Infinte Charter, Accordio and immediately acquires 2 stacks of 'Top Financier's Knowledge', increasing Crit DMG of the ally with the highest ATK by 50% and DMG dealt to Bosses by 20% for 10 sec.",
    "charges": 6,
    "cooldown": 21,
    "charge_type": "Charges up upon using Skills 5 times.",
    "advancement": "Advancement Phase 1\nIncrease the duration of the Skill by 4 sec.\n\nAdvancement Phase 2\nIncreases Boost effect that ally with the highest ATK receives by 100%."
  },
  {
    "name": "Nightmare Fang, Kitrax",
    "description": "Summons the soul of Nightmare Fang, Kitrax for 10 sec. For every 1 stack of Soul owned, takes 6% reduced DMG, recovering HP equal to 1% of own Max HP and 50 Mana every sec. Afterward, deals 67464 M.DMG to enemies in a wide frontal range and petrifies the hit targets for 4 sec. If Viska has 5 Souls, Skill Cooldown will reset.",
    "charges": 5,
    "cooldown": 25,
    "charge_type": "Charges up over 20 sec.",
    "advancement": "Advancement Phase 1\nIncreases the duration of Petrification by 3 sec and hit targets take 30% increased M.DMG for 10 sec.\n\nAdvancement Phase 2\nFor the Duration of Skill, DMG of 'I'll rip you to pieces!!' increases by 100%."
  },
  {
    "name": "Crest of Extortion, Kaliosk",
    "description": "Summons the soul of Crest of Extortion, Kaliosk, for 10 sec, dealing 87984 M.DMG to an enemy with the highest ATK. For the duration of the soul, reduces target's ATK by 20%, Mana by 250 every sec, and increases own ATK by 30%.",
    "charges": 6,
    "cooldown": 22,
    "charge_type": "Charges up upon using Skills 5 times.",
    "advancement": "Advancement Phase 1\nChanges Skill Activation Requirements to 4 times, reduces ATK Reduction effect to 30%, and Boost effect to 50%.\n\nAdvancement Phase 2\nUpon use, immediately enters Darkness Awakened state for 10 sec."
  },
  {
    "name": "Dragonbane, Svelta",
    "description": "Summons the soul of Dragonbane, Svelta for 10 sec, increasing all allies' ATK Spd by 300 and recovering own Mana by 400 every sec. For the duration of Skill, increases All DMG that all enemies take by 20%. If the target enemy is a Dragon, the DMG Boost effect changes to 60%.",
    "charges": 7,
    "cooldown": 25,
    "charge_type": "Charges up over 18 sec.",
    "advancement": "Advancement Phase 1\nThe duration of the effect increases by 10 sec.\n\nAdvancement Phase 2\nFor the duration of Skill, increases own ATK by 50%."
  },
  {
    "name": "Starry Sky Weaver, Mellifluo",
    "description": "Summons the soul of Starry Sky Weaver, Mellifluo, resetting the Cooldown of [Blinding Karma]. Afterward, attacks the enemy, dealing 111456 M.DMG, reducing Heal Rate by 50% for 10 sec, and inflicting 'Threading Destiny' for 10 sec. If the target is a Boss, deals 111456 additional M.DMG that ignores DEF.",
    "charges": 5,
    "cooldown": 20,
    "charge_type": "Charges up over 20 sec.",
    "advancement": "Advancement Phase 1\nIncreases DMG by 70%.\n\nAdvancement Phase 2\nReduces Skill Activation Requirements by 5 sec."
  },
  {
    "name": "Glory of the God King, Zaries",
    "description": "Summons the soul of Glory of the God King, Zaries for 10 sec, increasing P.DMG all enemies take by 25%, and increases ATK Spd of self by 500 for the duration of the skill.",
    "charges": 6,
    "cooldown": 25,
    "charge_type": "Charges up upon using Skills 6 times.",
    "advancement": "Advancement Phase 1\nIncreases DEF Penetration of self by 500 for the duration of the Skill.\n\nAdvancement Phase 2\nIncreases the duration by 4 sec, and becomes immune to CC for the duration of the Skill."
  },
  {
    "name": "Form of Ultimate Destruction, Barbatos Gigante",
    "description": "Resonates with the soul of Form of Ultimate Destruction, Barbatos Gigante, creating [Authority of the Demon God] upon self, dealing M.DMG to enemies within range, and inflicting Stun for 4 sec. Afterward, the soul of Form of Ultimate Destruction, Barbatos Gigante remains for 10 sec. Lucikiel cannot use any Skills for the duration of the soul, but his ATK Spd increases by 400, All DMG taken reduces by 30%, DMG of normal attacks increases by 2 , normal attacks deal DMG that ignores DEF, dealing 50% DMG to the targets nearby enemies. If Lucikiel kills an enemy while his soul remains, he creates [Authority of the Demon God].",
    "charges": 5,
    "cooldown": 16,
    "charge_type": "Charges up upon using Skills 3 times.",
    "advancement": "Advancement Phase 1\nUpon using the Soul Weapon Skill, Lucikiel dispels negative effects from self and dispels positive effects from targets hit by the first soul-resonating.\n\nAdvancement Phase 2\nIncreases the duration of the soul by 5 sec and reduces Cooldown by 5 sec. Gains immunity to CC for the duration of the soul."
  },
  {
    "name": "Encroaching Darkness, Leifende",
    "description": "Summons the soul of Encroaching Darkness, Leifende for 10 sec, dealing P.DMG equal to 5% own Max HP to frontal enemies in range every 3 sec. Each hit increases P.DMG the target takes by 30% for 5 sec. For the duration of the soul, increases DMG dealt to enemies of Shakmeh and the ally with the highest ATK excluding self by 10%.",
    "charges": 0,
    "cooldown": 0,
    "charge_type": "Charges up over 20 sec.",
    "advancement": "Advancement Phase 1\nFor the duration of the soul, recovers Mana by 400 sec.\n\nAdvancement Phase 2\nChanges the Skill Activation Requirements to 15 sec and DMG Boost against enemies to 20%."
  }
]
